{"events":[{"event":{"title":"Mentor Match: A Student & Alumni Networking Dinner","teaser":"If you have ever thought about mentoring a UC Santa Cruz student—this is the event for you! Alumni are cordially invited to Mentor Match: A Student & Alumni Networking Dinner.","location":"Stevenson Event Center","link":"https://events.ucsc.edu/event/2802","event_instances":"1","event_date":"1429840800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/mentor-match.jpg?itok=7McvJFU7","alt":"Mentor Match - Alumni Weekend 2015 Featured Event"},"description":"If you have ever thought about mentoring a UC Santa Cruz student—this is the event for you! Alumni are cordially invited to Mentor Match: A Student & Alumni Networking Dinner. \r\rThis event provides a fantastic opportunity to share your field of expertise and life lessons with an exceptional group of students from across campus. \r\rLearn about the challenges facing current students, connect with other slugs, and provide guidance for the next generation of alumni.\r\rFor more information contact [Katie Linder](mailto:klinder@ucsc.edu), Alumni and Student Outreach Coordinator.\r"}},{"event":{"title":"KZSC Alumni Airchecks","teaser":"Calling all KZSC (née KRUZ) alums—we are inviting one time Slug Radio wizards to spin some classics and share personal reflections about their glory days on the air.Current staff will be on hand to document your treasured stories and give flashback tours of KZSC's redwood outpost.","location":"KZSC","link":"https://events.ucsc.edu/event/2689","event_instances":"3","event_date":"1429894800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/KZSC%20Airchecks.jpg?itok=2W9dbHYt","alt":""},"description":"Calling all KZSC (née KRUZ) alums—we are inviting one time Slug Radio wizards to spin some classics and share personal reflections about their glory days on the air. \r\rCurrent staff will be on hand to document your treasured stories and give flashback tours of KZSC's redwood outpost. \r\rDrop by between 10:00am to 6:00pm anytime throughout the alumni weekend. We're all grown up and sling 20,000 watts now!\r\rFor more information contact [Keith Rozendal](mailto:rozendal@ucsc.edu), KZSC Broadcast Advisor.\r"}},{"event":{"title":"TEDxSantaCruz","teaser":"UC Santa Cruz is a major sponsor for TEDxSantaCruz 2015. For their 2015 event, the TEDx team is planning an event to help shine a spotlight on the impact of UC Santa Cruz through faculty research and alumni endeavors.","location":"","link":"https://events.ucsc.edu/event/2774","event_instances":"1","event_date":"1429894800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/tedxsc.jpg?itok=YUvExWnC","alt":""},"description":"UC Santa Cruz is a major sponsor for TEDxSantaCruz 2015. For their 2015 event, the TEDx team is planning an event to help shine a spotlight on the impact of UC Santa Cruz through faculty research and alumni endeavors. We encourage UC Santa Cruz faculty, staff, students and alumni to apply to be speakers at this event and expect it to be an inspiring day of ideas and experiences born out of, or in need of, radical collaboration. More at the [TEDxSantaCruz website](http://www.tedxsantacruz.org)."}},{"event":{"title":"DNA Day","teaser":"UC Santa Cruz, home of the UCSC Genome Browser and the assembly of the first draft of the human genome, celebrates national DNA Day every April.","location":"","link":"https://events.ucsc.edu/event/2846","event_instances":"1","event_date":"1429898400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/DNADay.jpg?itok=8MZ01C59","alt":""},"description":"UC Santa Cruz, home of the UCSC Genome Browser and the assembly of the first draft of the human genome, celebrates national DNA Day every April. \r\rThe celebration features the annual double-human helix dance, the banana slug genome project, a student research poster session, hands-on strawberry DNA extraction, opportunities to learn about the CBSE Research Mentoring Institute (RMI) and other campus activities and groups related to genomics, and free stuff.\r\rDNA Day commemorates the date in 1953 when James Watson, Francis Crick, Maurice Wilkins, Rosalind Franklin, and colleagues published papers in the journal Nature on the structure of DNA. It was first celebrated in 2003 by proclamation of both the US Senate and the House of Representatives."}},{"event":{"title":"11th Annual Graduate Research Symposium","teaser":"The Graduate Research Symposium highlights the innovative research being conducted by graduate students in our thirty-eight programs across five academic divisions.It celebrates the scholarly, creative, social and commercial impact they make within California and around the world!","location":"McHenry Library","link":"https://events.ucsc.edu/event/2690","event_instances":"1","event_date":"1429905600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/11th-annual-graduate-research-symposium.jpg?itok=bMV1VA5y","alt":"11th Annual Graduate Research Symposium - Alumni Weekend 2015"},"description":"The Graduate Research Symposium highlights the innovative research being conducted by graduate students in our thirty-eight programs across five academic divisions.\r\rIt celebrates the scholarly, creative, social and commercial impact they make within California and around the world!\r\rIn addition to graduate students presenting their research to a general audience, graduate alumni selected by the Division of Graduate Studies will serve as Symposium judges, and graduate symposium alumni researchers noteworthy contributions will be highlighted. Join us at the Symposium to view presentations and discuss students' research.\r\rFor more information contact [gradadm@ucsc.edu](mailto:gradadm@ucsc.edu).\r"}},{"event":{"title":"UCSC Greenhouse Tour","teaser":"Enjoy a tour of our Science Hill facilities, including rooftop visits to our instructional plant collection, restoration project plants, and current research projects.","location":"Thimann Laboratories","link":"https://events.ucsc.edu/event/2803","event_instances":"1","event_date":"1429909200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/UCSC%20Greenhouse%20Tour.png?itok=zn4CwKPZ","alt":""},"description":"Enjoy a tour of our Science Hill facilities, including rooftop visits to our instructional plant collection, restoration project plants, and current research projects.\r\rOur main facility on Thimann labs rooftop has a garden feel with two outdoor classrooms nestled among the five hundred labeled species of plants in the collection. There are five greenhouses with many plants of distinction. Chocolate, vanilla, tea and coffee are just some of the vines bushes and trees housed. A vibrant restoration program will be one topic during the tour. \r\rWe have an extensive collection of California natives used as teaching aids. Students are making this rooftop their own as evident by the six-foot waterfall designed and constructed by art, engineering and environmental student groups on campus. \r\rResearch is conducted on rooftop facilities on Sinsheimer and ISB. These are both very short walks away, one being on an adjacent building connected to Thimann. These research facilities are accessible by elevator as is our main Thimann facility. Research centers on evolution, ecology and environmental studies. Various projects underway will be highlighted for those interested. \r\rDirector Jim Velzy will give an overview of the various aspects related to these rooftop facilities and light refreshments will be served.\r\rFor more information visit our [website](http://greenhouse.ucsc.edu) or contact [Jim Velzy](mailto:jhvelzy@ucsc.edu), Greenhouse Director.\r"}},{"event":{"title":"Take a Walk around UCSC with Portland-based art collective Public Doors and Windows","teaser":"See the campus you know and love through a unique experiential walk with artists-in-residence Public Doors and Windows.The walk will include stops chosen by both alumni and present students that are important to their experiences and memories at UC Santa Cruz.","location":"Digital Arts Research Center (DARC)","link":"https://events.ucsc.edu/event/2804","event_instances":"1","event_date":"1429909200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Take%20a%20walk.jpg?itok=Bc9W9DZ6","alt":""},"description":"See the campus you know and love through a unique experiential walk with artists-in-residence Public Doors and Windows. \r\rThe walk will include stops chosen by both alumni and present students that are important to their experiences and memories at UC Santa Cruz. \r\rAt each stop alumni or current students will speak about the importance of the site, its notable aspects, and its relevance to their university experience. \r\r**About the Collective**\r[Public Doors and Windows](http://publicdoorsandwindows.tumblr.com/) is a collaborative artist team made up of **Harrell Fletcher**, **Molly Sherman**, and **Nolan Calisch**. They are based in Portland, Oregon. Together they work to create participatory and site-specific projects that engage with and include local people and the broader public.\r\rDrawing inspiration from small-scale farming and the community supported agriculture (CSA) model, PD&W bring similar elements into their artistic practice, creating work that values collaboration, reciprocal relationships, and a sense of investment with the people and places where they work.\r\rFor more information contact [Rachel Nelson](mailto:ias@ucsc.edu), Assistant to John Weber, Founding Director.\r"}},{"event":{"title":"Porter College / College 5 Reception","teaser":"Provosts Emeriti Kathy Foley and David Evan Jones seek the pleasure of your company at the Porter College Koi Pond for refreshments and conversation among friends.","location":"Porter College","link":"https://events.ucsc.edu/event/2805","event_instances":"1","event_date":"1429911000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Porter%20College-College%205%20Reception.jpg?itok=EpjGCCkH","alt":""},"description":"Provosts Emeriti Kathy Foley and David Evan Jones seek the pleasure of your company at the Porter College Koi Pond for refreshments and conversation among friends. \r\rIn Japanese culture, koi symbolize love, friendship and affection. Three fitting sentiments for reconnecting with fellow slugs around a Porter College icon.  \r\rFor more information contact [Susan Beach](mailto:sjbeach@ucsc.edu), College Academic Programs Coordinator.\r"}},{"event":{"title":"Social Sciences Distinguished Alumni Award Ceremony","teaser":"Alumni are cordially invited to celebrate the achievements of Distinguished Alumni from the Division of Social Sciences for 2014-2015.","location":"Seymour Marine Discovery Center","link":"https://events.ucsc.edu/event/2806","event_instances":"1","event_date":"1429916400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Social%20Sciences%20Distinguished%20Alumni%20Award%20Ceremony.jpg?itok=4acfOj50","alt":""},"description":"Alumni are cordially invited to celebrate the achievements of Distinguished Alumni from the Division of Social Sciences for 2014-2015.  \r\rSurrounded by their peers, mentors and friends, the ceremony takes a moment to celebrate accomplishments and acknowledge their contributions to the field.\r\rLight refreshments and good company will be served.\r\rFor more information contact [Joni White](mailto:joni@ucsc.edu), Event Coordinator, Social Sciences Division."}},{"event":{"title":"An Uncommon Place: Shaping the UC Santa Cruz Campus ","teaser":"Attend a gallery reception for the Sesnon Art Gallery’s 50th anniversary exhibition, An Uncommon Place: Shaping the UC Santa Cruz Campus.","location":"Sesnon Gallery, Porter College","link":"https://events.ucsc.edu/event/2783","event_instances":"1","event_date":"1429916400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/p265101coll25_3241.jpeg?itok=Y0kpv2lh","alt":""},"description":"Attend a gallery reception for the Sesnon Art Gallery’s 50th anniversary exhibition, [An Uncommon Place: Shaping the UC Santa Cruz Campus](http://art.ucsc.edu/galleries/exhibitions/upcoming).\r\rEnjoy recently uncovered architectural drawings and photographs from UC Santa Cruz’s early years and discuss with the curators how they reflect the ideas that shaped a physical landscape in dialogue with an innovative educational project, leading to the campus of today.\r\rExhibition curators\r\rJames Clifford, Emeritus Professor in the History of Consciousness Department, has been photographing the campus intensively for a decade and gathering an archive of images—from before the founding to the present—that document and attempt to capture the spirit of the place. He is also developing an analysis of UC Santa Cruz’s “poetics of space,” its continuing role as a utopian, visionary site.\r\rMichael Cowan, Emeritus Professor of American Studies, has had a long-standing interest in campus physical and academic planning and in the relationship of places as imagined and places as actually experienced. For a number of years he taught a course in urban planning literature that used the UC Santa Cruz campus as a case study, and he has written several essays on the campus's history. He has served on the Campus Planning Committee and on several campus building committees. \r\rVirginia Jansen, Emerita Professor of the History of Art & Visual Culture, taught courses on The History of the UCSC Campus Plan and American Campus Planning and served on the Campus Physical Planning Committee and the Design Advisory Board. She is particularly interested in the development of campus planning from medieval monastic and collegiate traditions, including the history of collegiate experiments. She continues to study the intersection of building and society.\r\rFrank Zwart, FAIA, FAUA, Campus Architect Emeritus, first arrived at UC Santa Cruz in 1967 and graduated from Cowell College in 1971. After receiving a master’s degree in architecture from Princeton University, he joined the campus’s staff in 1985 and served as campus architect from 1988 to 2010. He is particularly interested in the ways that UC Santa Cruz’s development relates to contemporaneous trends in architecture, landscape architecture, and planning.\r\rFor more information contact [Frank Zwart](fzwart@ucsc.edu), Campus Architect Emeritus."}},{"event":{"title":"Graduate Alumni Social","teaser":"Join us in the Graduate Student Commons for Graduate Alumni Cocktail Hour—an event for UC Santa Cruz graduate alumni and current graduate students!","location":"Graduate Student Commons","link":"https://events.ucsc.edu/event/2807","event_instances":"1","event_date":"1429920000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Graduate%20Alumni%20Social.jpg?itok=YMCyPEq1","alt":""},"description":"Join us in the Graduate Student Commons for Graduate Alumni Cocktail Hour—an event for UC Santa Cruz graduate alumni and current graduate students! \r\rCome meet current Vice Provost & Graduate Dean Tyrus Miller, and Assistant Dean Jim Moore, make friends, reconnect with old friends, and learn more about the GSC while enjoying a refreshing cocktail. Drinks and appetizers will be provided.\r\rThis event is hosted by GSC and the Graduate Division. GSC and the Graduate Division are interested in developing a network of past graduate students and strengthening the ties between the current graduate students and the alumni. Please help us build a valuable UC Santa Cruz graduate student alumni network!\r\rGSC is an independent organization that exists solely to serve the needs and interests of graduate students at UC Santa Cruz. Check the GSC [website](http://gradcommons.soe.ucsc.edu/), [Facebook](https://www.facebook.com/pages/UCSC-Graduate-Student-Commons/137290272983385), [Twitter](https://twitter.com/gsCommons), and [LinkedIn](http://www.linkedin.com/groups/UCSC-Division-Graduate-Studies-Network-6507434/about) to learn more about the current and past events.\r\rHelp us make this event even bigger: forward, Facebook, or Tweet this event to your UC Santa Cruz grad friends!\r\rFor more information, please contact [Dalia Terleckaite](mailto:dterleck@ucsc.edu), GSC Professional Development Coordinator.\r"}},{"event":{"title":"Alumni Shabbat","teaser":"Join Santa Cruz Hillel for Shabbat services and a delicious home-cooked Shabbat meal. Nosh, mingle, share stories, and re-strengthen ties to fellow alums, Hillel, and UC Santa Cruz.","location":"","link":"https://events.ucsc.edu/event/2808","event_instances":"1","event_date":"1429924500","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Alumni%20Shabbat.jpg?itok=d6J0aICX","alt":""},"description":"Join Santa Cruz Hillel for Shabbat services and a delicious home-cooked Shabbat meal. Nosh, mingle, share stories, and re-strengthen ties to fellow alums, Hillel, and UC Santa Cruz. \r\rCome swap memories and connect with local board members, current students, and staff who will join with alumni to celebrate the vibrancy of Jewish life at UC Santa Cruz. \r\rDon’t miss this great chance to reconnect with old friends, meet new ones, and schmooze with students about life on campus today.\r\rSanta Cruz Hillel is located at 222 Cardiff Place (next to the 7-Eleven off High St.).\r\rFor more information contact [Leah Shapiro](mailto:leah@santacruzhillel.org), Program Director, Santa Cruz Hillel.\r"}},{"event":{"title":"Recent Grad Mixer","teaser":"Calling all recent graduates—come network with other young alumni and current seniors at Motiv downtown. Enjoy tapas plates and a no host bar!","location":"","link":"https://events.ucsc.edu/event/2809","event_instances":"1","event_date":"1429927200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Recent%20Grad%20Mixer.png?itok=CMkyZh8S","alt":""},"description":"Calling all recent graduates—come network with other young alumni and current seniors at Motiv downtown. Enjoy tapas plates and a no host bar!\r\rThe Senior Class Council of 2015 invites all young alumni to join them at Motiv in downtown Santa Cruz for a fun event filled with conversation, appetizers, and student support.\r\rWith only months before graduation, seniors are looking to alumni for guidance on Banana Slug life beyond the campus. Please come and share your advice and career-path stories, while also learning about the student-supported [Senior Legacy Fund](http://giving.ucsc.edu/studentgiving/seniorlegacy/) and [Senior Class Council](http://giving.ucsc.edu/studentgiving/seniorclasscouncil/index.html).\r\rIf you’re interested in learning more, please contact [Katie Linder](mailto:klinder@ucsc.edu), Alumni and Student Outreach Coordinator with University Relations.\r"}},{"event":{"title":"True Originals: M. Sanjayan presents: A New Wild: Saving Nature in a Human-Dominated World ","teaser":"In a world of seven billion humans, can wild nature continue to exist? The environmental movement has long been dominated by a Western philosophy that sees humans as separate from and detrimental to nature.","location":"Media Theater","link":"https://events.ucsc.edu/event/2691","event_instances":"1","event_date":"1429929000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/sanjayan1_0.jpg?itok=U9sM_FRE","alt":"M. Sanjayan - Alumni Weekend 2015 Featured Event"},"description":"In a world of seven billion humans, can wild nature continue to exist? The environmental movement has long been dominated by a Western philosophy that sees humans as separate from and detrimental to nature. While great strides have been made in the past few decades, most scientists will agree that conservation efforts are simply not keeping up with the vast scale of planetary change. Despite our best efforts, the conservation movement is failing.   \r \r**Dr. M. Sanjayan**, Executive Vice President and Senior Scientist for Conservation International and UCSC grad (Graduate Divison 97), has just returned from a global quest to explore what it means to save nature in a world where wildness no longer exists. Looking beyond the expected devastation of human activity on the natural world, Sanjayan found places—most at the frontiers of where people and wildlife meet—where people can help nature thrive. Even more crucially, this \"new wild\" relationship is benefiting human well-being in ways we never before imagined.\r\rSanjayan’s talk will draw on his 2015 PBS television series [EARTH: A New Wild](http://www.pbs.org/earth-a-new-wild/home/) to reveal how, through human ingenuity, technology and sometimes ecological tragedy, people are becoming a positive part of the ecological systems we depend on for our well-being. The result is a new framework that reinvents environmentalism by making saving nature about saving ourselves. \r\rThis presentation is part of the *True Originals Notable Alumni Speakers Series*.\r\rFor more information contact the [Special Events Office](mailto:specialevents@ucsc.edu), or call 831-459-5003."}},{"event":{"title":"Econ Alumni Reception","teaser":"Alumni, faculty, staff, and students are cordially invited to the Economics Department reunion in celebration of UC Santa Cruz’s 50th Anniversary.","location":"Engineering 2","link":"https://events.ucsc.edu/event/2695","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Econ%20Alumni%20Reception.jpg?itok=0MScAfmS","alt":""},"description":"Alumni, faculty, staff, and students are cordially invited to the Economics Department reunion in celebration of UC Santa Cruz’s 50th Anniversary.\r\rFollowing a brief introduction and short presentation, a continental breakfast will be served in the courtyard where attendees may reconnect over their shared memories of their time on campus.\r\rFor more information contact Economics Department Assistant [Leigh Faulk](mailto:lsfaulk@ucsc.edu).\r"}},{"event":{"title":"The Creation of Beauty in the Company of Friends","teaser":"Since 2011, Cowell has started Alumni Weekend with a symposium.","location":"","link":"https://events.ucsc.edu/event/2694","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/The%20Creation%20of%20Beauty%20in%20the%20company%20of%20friends.jpg?itok=l2hXsWh8","alt":""},"description":"Since 2011, Cowell has started Alumni Weekend with a symposium. 2015 will mark the 5th anniversary of that tradition and the 50th year of Cowell College with a panel of three Pioneer artists, **Eric Thiermann**, **Holly Downing** and **Richard Shaffer**, who have lived their lives in art.\r\rAlumni and early faculty will gather in the Page Smith Library with the panelists and moderator **Bonita Banducci**, to discuss how their experiences at Cowell drew them toward art and shaped some of their approaches to art.\r\rOpen to all alumni and especially Cowell alumni. Other Pioneer artists including architecture will join us. As the role of the college in arts education and the role of arts in the colleges is discussed, those who think of themselves as un-artistic might enjoy reflecting on how they were or were not touched by living among beauty, some of which was made by humans and intentional and some of which came unbidden from nature. \r\rCome early for coffee and muffins in the courtyard.\r\rFor more information contact Cowell College Events and Outreach Coordinator [Veronica Hamilton](mailto:vhamilto@ucsc.edu)."}},{"event":{"title":"Pan-DANM-onium","teaser":"The Digital Arts and New Media (DANM) MFA Program invites the community to a day-long festival celebrating DANM’s first decade, on April 25, 2015.","location":"Digital Arts Research Center (DARC)","link":"https://events.ucsc.edu/event/2698","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/DANM.png?itok=tDBHMsud","alt":"View of the Catalina Giraldo’s (DANM ‘13) Verde Oscuro projected on the facade of the Digital Arts Research Center during the 2013 MFA Exhibition."},"description":"The Digital Arts and New Media (DANM) MFA Program invites the community to a day-long festival celebrating DANM’s first decade, on April 25, 2015. This free event includes outdoor exhibits and demos, the annual DANM MFA art exhibition, alumni slideshows, DANM research lab open houses, and a masquerade ball. It’s a day of projection mapping, repurposed military vehicles, free food, fine art, vacuform masks, kids crafts and more - it’s pan-DANM-onium!\r\rThe annual DANM MFA exhibition will be open from 10am to 8pm, with interactive, digital, mixed-media, and performative artworks by graduating artists on display throughout the Digital Arts Research Center (DARC). Jaime Austin, Curator and Director of Programs at ZERO1 and Curator of the DANM 2015 MFA show will lead a guided tour of the show for alumni and visitors at 2pm.\r\rAs part of UCSC’s 50th Anniversary Alumni Weekend, DANM will showcase the achievements of its graduates in a series of rapid-fire PechaKucha-style slideshow presentations from over 20 DANM alumni about their current work and research, from 10am to 1pm in DARC Room 230. \r\rOutside on the grounds of the DARC building, DANM will host a Faire of Making, with Santa Cruz community groups, city agencies, museums, tech groups, UCSC student groups, and DANM research groups hosting interactive craft booths and activities for all ages, from 10am to 4pm. During those hours, DANM faculty research labs and the Prototyping Lab will also be open, with ongoing research on display. \r\rThe festival will be capped off in the evening with a reception for the MFA show from 5pm to 8pm, followed by dancing and a live DJ under the glow of projection art at the Masquerade Ball on the DARC patio, until 10pm.\r\rFor more information visit [pandanmonium.sites.ucsc.edu](http://pandanmonium.sites.ucsc.edu), or contact [Felicia Rice](mailto:fsrice@ucsc.edu), Program Manager, Digital Arts & New Media, at 831-459-1919."}},{"event":{"title":"The Farm Tour","teaser":"Enjoy a guided tour of the gardens, fields and orchards at UCSC's 30-acre organic Farm.Founded in 1971, the 30-acre Farm includes handworked gardens of annual and perennial food and ornamental crops, mechanically cultivated row crops, orchards, and research plots.","location":"UCSC Farm","link":"https://events.ucsc.edu/event/2812","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/The%20Farm%20Tour.jpg?itok=TmxCPBxS","alt":""},"description":"Enjoy a guided tour of the gardens, fields and orchards at UCSC's 30-acre organic Farm.\r\rFounded in 1971, the 30-acre Farm includes handworked gardens of annual and perennial food and ornamental crops, mechanically cultivated row crops, orchards, and research plots. \r\rLearn about the education, research, and public service activities taking place through the work of the Center for Agroecology & Sustainable Food Systems (CASFS).\r\rPlease wear comfortable walking shoes for this event. \r\rFor more information contact [Martha Brown](mailto:mtbrown@ucsc.edu), Senior Editor, CASFS. \r"}},{"event":{"title":"Journey Through Time: Limeworks Tour","teaser":"Join Geologist/Historian Frank Perry (College 8 ‘77) for a tour of the Campus's historic district.","location":"Barn Theater","link":"https://events.ucsc.edu/event/2813","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Journey%20Through%20Time.png?itok=d-ljjYIL","alt":""},"description":"Join Geologist/Historian Frank Perry (College 8 ‘77) for a tour of the Campus's historic district. \r\rWondering how those old lime kilns worked or how the restoration of the Hay Barn is coming along? Learn about these topics and more (plus see some newly-discovered historic photos) as we explore what life was like here in the 19th century.\r\rFor more information about the Limeworks visit http://limeworks.ucsc.edu or contact [Alisa Klaus](aklaus@ucsc.edu), Senior Environmental Planner, Physical Planning & Construction.\r"}},{"event":{"title":"Arboretum Tour","teaser":"The Arboretum is offering alumni a guided tour of the world-renown UC Santa Cruz Arboretum during alumni weekend.On the tour you will learn about our collections of rare and endangered plants from around the world and the importance of them to the university and community.","location":"Arboretum","link":"https://events.ucsc.edu/event/2814","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Arboretum%20Tour.jpg?itok=v_HRCq-S","alt":""},"description":"The Arboretum is offering alumni a guided tour of the world-renown UC Santa Cruz Arboretum during alumni weekend. \r\rOn the tour you will learn about our collections of rare and endangered plants from around the world and the importance of them to the university and community. \r\rWe have sizable collections of mostly drought-tolerant native Californian, Australian, New Zealand, and South African plants, including cacti and succulents.\r\rFor more information contact [Jessica Bailey](mailto:jfbailey@ucsc.edu), Assistant Vice Provost & Executive Director, Arboretum.\r"}},{"event":{"title":"Banana Slug Kid Zone","teaser":"A family-friendly event where alums can visit different craft booths with their little Banana Slugs.","location":"","link":"https://events.ucsc.edu/event/2816","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/sammy.jpg?itok=MGmJ-yyk","alt":"Sammy - Banana Slug Kid Zone - Alumni Weekend 2015 Featured Event"},"description":"A family-friendly event where alums can visit different craft booths with their little Banana Slugs. \r\rCome enjoy the fun kid-centered activities where current slug students will be on hand to engage your little ones with fun activities including face painting, cookie decoration, a reading corner, bubbles, crafts, games, prizes and more!\r\rFor more information contact [Katie Linder](mailto:klinder@ucsc.edu), Alumni and Student Outreach Coordinator."}},{"event":{"title":"Bring Back the Quarry Tour","teaser":"UC Santa Cruz is working to restore the quarry and reopen to become what it once was - a central gathering place.","location":"Quarry Plaza","link":"https://events.ucsc.edu/event/2817","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Bring%20Back%20the%20Quarry.jpg?itok=uxpzw0zV","alt":""},"description":"UC Santa Cruz is working to restore the quarry and reopen to become what it once was - a central gathering place. \r\rJoin us for a hard hat tour to revisit this special place and learn more about the efforts towards its revitalization. As this is a walking tour, please remember to wear comfortable shoes during this event.\r\rClosed since 2006, this restoration project is a priority of The Campaign for UC Santa Cruz.\r\r**Tour Times**\r30 minute tours leave at 10:00am and 10:30am from Quarry Plaza.\r\rFor more information visit http://deanofstudents.ucsc.edu/quarry.\r\r\r"}},{"event":{"title":"UCSC Campus Natural Reserve Hike","teaser":"Join us for a hike on the UC Santa Cruz Campus Natural Reserve, which serves as an outdoor classroom and living laboratory.","location":"","link":"https://events.ucsc.edu/event/2810","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/UCSC%20Campus%20natural%20reserve%20hike.jpg?itok=so5TT6Xq","alt":""},"description":"Join us for a hike on the UC Santa Cruz Campus Natural Reserve, which serves as an outdoor classroom and living laboratory.\r\rThe reserve serves as an outdoor classroom and living laboratory that provides a vital link between ideas discussed within traditional classrooms and hands-on learning in the natural world. \r\rThe campus reserve features steep redwood ravines, flowering azaleas along forested springs, sweeping ocean views, northern maritime chaparral, and more. Meet at the Firehouse parking lot. \r\r**Gage Dayton**, Administrative Director for physical and biological sciences, and **Alex Jones**, UCSC Campus Natural Reserve Steward, will begin with a brief overview of the reserve, followed by a steward-led hike along the interpretative loop trail. \r\rThis event is family friendly. Please wear sturdy shoes. We will walk rain or shine.\r\rFor more information visit the Campus Natural Reserve [website](http://ucsantacruz.ucnrs.org/reserves/ucsc-campus/) or contact Steward [Alex Jones](mailto:asjones@ucsc.edu).\r"}},{"event":{"title":"Gender Equality in Athletics through the years at UCSC","teaser":"Acclaimed academic researcher and Women’s Basketball Alumna Susan Cahn (Kresge ’81) joins a panel of speakers for a topical discussion on gender equality in sport.","location":"West Field House","link":"https://events.ucsc.edu/event/2811","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Gender%20Equality%20in%20Athletics.jpg?itok=NV5dHtml","alt":""},"description":"Acclaimed academic researcher and Women’s Basketball Alumna Susan Cahn (Kresge ’81) joins a panel of speakers for a topical discussion on gender equality in sport.\r\rCahn’s seminal monograph Coming on Strong: Gender and Sexuality in Twentieth-Century Sports (1994) won the Best Book Award in Sport History category from the North American Society of Sports History. She earned her undergraduate degree from the University of California, Santa Cruz in 1981, masters from University of Minnesota in 1985 and Ph.D. five years later.\r\rThe panel, including current professors and players past and present, will focus on gender equality in athletics over the last 35 years, including topics ranging from how Title IX has changed the culture of athletics on campus since 1980, the current state of gender equality, and next steps towards complete equality for female athletes at UC Santa Cruz.\r\rFor more information contact [Todd Kent](mailto:tlkent@ucsc.edu), UC Santa Cruz Head Coach, Women’s Basketball.\r"}},{"event":{"title":"Baskin Alumni Mentoring Program Open House","teaser":"Attend the Baskin Alumni Mentoring Program Open House and meet some of the talented future engineers from UCSC's MESA Engineering Program (MEP).","location":"","link":"https://events.ucsc.edu/event/2815","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Baskin%20Alumni%20Mentoring%20Program%20Open%20House.jpeg?itok=PdMqoana","alt":""},"description":"Attend the Baskin Alumni Mentoring Program Open House and meet some of the talented future engineers from UCSC's MESA Engineering Program (MEP). \r\rThe Baskin Alumni Mentoring Program matches alumni from the School of Engineering with current MEP students. This program enables students to tap into a wealth of knowledge that engineering alumni have accumulated over their academic and professional careers, enabling students to get insights into topics such as searching for jobs, creating resumes, interviewing, and others. \r\rOn your road to a degree from the Baskin School of Engineering, many people probably helped you along the way. What better way to pay-it-forward than by volunteering as a mentor? Come on by, check out the program, and meet some of the current students and alumni mentors!\r\rFor more information contact [Lydia Zendejas](mailto:lzendej1@ucsc.edu), MESA Director and Undergrad Advisor.\r"}},{"event":{"title":"Campus Adventure: A Modern-Day Scavenger Hunt","teaser":"Join us for a modern day scavenger hunt! Bring a team of 2-5 new and old friends to participate in this fun, active and time-limited Campus Adventure.","location":"Cowell Conference Room","link":"https://events.ucsc.edu/event/2827","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Campus%20Adventure%20A%20modern%20day%20scavenger%20hunt.png?itok=PN-7gP1v","alt":""},"description":"Join us for a modern day scavenger hunt! Bring a team of 2-5 new and old friends to participate in this fun, active and time-limited Campus Adventure. \r\rOur modern-day scavenger hunt involves cracking codes, strategy and teamwork to locate and (re)discover great and iconic places on campus. \r\rYour team will receive a packet with a map, word puzzles, pictures, and other clues to point you towards several destination locations. Your team can earn points for each location found and for completing activities along the way. \r\rThe Campus Adventure Program includes strolling/walking, taking photographs, interactive activities, finding out what you know about UCSC Trivia and getting to know something new about your team mates. \r\rPlan on traveling 1-2 miles over a 2 hour time period.\r\rFor more information contact Experiential Leadership Program Director [Miranda Allen-Brower](miranda@ucsc.edu).\r"}},{"event":{"title":"50 Years of Literature","teaser":"From its inception as one of the original Boards of Study, the Literature Department at UC Santa Cruz has had a distinctive identity on campus as well as within the world of scholarship.","location":"Kresge College","link":"https://events.ucsc.edu/event/2692","event_instances":"1","event_date":"1429984800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/50%20Years%20of%20Lit.png?itok=Z2qCDt18","alt":""},"description":"From its inception as one of the original Boards of Study, the Literature Department at UC Santa Cruz has had a distinctive identity on campus as well as within the world of scholarship. \r\rTo celebrate our tradition of working and teaching across national, linguistic, and disciplinary divides, a series of short seminars will pair emeritus faculty with current faculty and alumni for lively, engaging conversations during Alumni Weekend. \r\rA reception, to which all current and former faculty will be invited, will follow.\r\rFor more information contact [Stephanie Casher](mailto:scasher@ucsc.edu), Literature Department Manager."}},{"event":{"title":"Story Quarry","teaser":"Become part of the effort to Bring Back the Quarry by recording your stories of everyday and exceptional experiences in the amphitheater.The restoration of the Quarry is a priority of The Campaign for UC Santa Cruz.","location":"Cowell College","link":"https://events.ucsc.edu/event/2819","event_instances":"1","event_date":"1429984800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Story%20quarry.jpg?itok=yXod2R6f","alt":""},"description":"Become part of the effort to Bring Back the Quarry by recording your stories of everyday and exceptional experiences in the amphitheater. \r\rThe restoration of the Quarry is a priority of The Campaign for UC Santa Cruz.\r\rFor more information visit http://deanofstudents.ucsc.edu/quarry.\r"}},{"event":{"title":"True Originals: Escapist Comedy versus Social Comedy in American Film with filmmakers Lindsay Doran and Ron Yerxa","teaser":"Lindsay Doran (Merrill ’70) and Ron Yerxa (Grad Division ’74) lead a spirited discussion about their different views on comedy in film.","location":"","link":"https://events.ucsc.edu/event/2818","event_instances":"1","event_date":"1429984800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/true-original-escapist.jpg?itok=OmPIl1Vi","alt":"Alumni Weekend 2015 Featured Event"},"description":"**Lindsay Doran** (Merrill ’70) and **Ron Yerxa** (Grad Division ’74) lead a spirited discussion about their different views on comedy in film.\r \rLindsay Doran is a film producer whose credits include *This Is Spinal Tap*, *Sense and Sensibility*, *Stranger Than Fiction*, and *Nanny McPhee*. She has also worked as a story consultant, most recently on *The Lego Movie* and *22 Jump Street*. \r\rOn the other hand, Ron Yerxa is a film producer, whose credits include *Election*, *Little Miss Sunshine*, *Cold Mountain*, and recently *Nebraska*.\r\rFor more information contact [Meg Corman](mailto:mlcorman@ucsc.edu), Special Assistant to the Chancellor and VC of University Relations.\r\r**EVENT UPDATE:** Lindsay Doran's participation is tentative. Future updates will be posted here."}},{"event":{"title":"True Originals: Money, Politics, Climate Change and the Law: Will We Rise to the Challenge?","teaser":"Paul Hall, Esq (Merrill ’72) will moderate an interdisciplinary panel of distinguished alumni who will help us take a keen look at the interplay of money and power in our political and governing systems; from campaign finance and the effect of money in politics to legal and political responses to global warming and climate change.","location":"Stevenson College","link":"https://events.ucsc.edu/event/2820","event_instances":"1","event_date":"1429984800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/paul-hall.jpg?itok=ZA4RsFMc","alt":"Alumni Weekend 2015 Featured Event"},"description":"**Paul Hall**, Esq (Merrill ’72) will moderate an interdisciplinary panel of distinguished alumni who will help us take a keen look at the interplay of money and power in our political and governing systems; from campaign finance and the effect of money in politics to legal and political responses to global warming and climate change. \r\rPanelists include: \r**Mary Doyle** (Porter, '74), Former Vice President, Legal and Global Chief Compliance and Ethics Officer at Oracle, **Judge Kelvin Filer** (Stevenson ’77), Los Angeles Superior Court in Compton, **Judge Alan J. Goodman** (Stevenson ’67), Los Angeles Superior Court,  **Judge Teri Jackson** (Stevenson ’77), San Francisco Superior Court, **Art Torres** (Stevenson ’68), Retired State senator and Vice Chair of CIRM, and **Zach Wasserman** (Merrill ’69) public interest lawyer in Oakland.  \r\rFor more information contact [Meg Corman](mailto:mlcorman@ucsc.edu), Special Assistant to the Chancellor and VC of University Relations."}},{"event":{"title":"Merrill College Rededication","teaser":"Alumni, students, faculty, staff, and community members are invited to join Chancellor Blumenthal to celebrate the rededication of Merrill College.","location":"Merrill College","link":"https://events.ucsc.edu/event/2842","event_instances":"1","event_date":"1429984800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Merrill%20Rededication.jpg?itok=47nftFw8","alt":""},"description":"Alumni, students, faculty, staff, and community members are invited to join **Chancellor Blumenthal** to celebrate the rededication of Merrill College. \r\rFrom its founding in 1968 as the fourth college at UC Santa Cruz, Merrill has stimulated an interdisciplinary environment focusing on global issues. \r\rMerrill Renewal has reshaped the college and rebuilt its programs. The Merrill College Rededication is a moment to reflect on the history of the college and the direction it will take in the future.\r\rVisit the Merrill College [website](http://merrill.ucsc.edu/) for more information, or contact [Esperanza Zamora](mailto:zamora@ucsc.edu), Assistant to the Merrill College Provost.\r\r"}},{"event":{"title":"Merrill Moat Day","teaser":"Looking for a hands-on activity? Join us for a BBQ and help with efforts to restore the moat murals.A Merrill tradition for over 40 years, every April the Merrill students select a series of murals to be removed from the Moat and a collection new ones to take their place.","location":"Merrill College","link":"https://events.ucsc.edu/event/2821","event_instances":"1","event_date":"1429988400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Merrill%20Moat%20Day.png?itok=vX56dapk","alt":""},"description":"Looking for a hands-on activity? Join us for a BBQ and help with efforts to restore the moat murals.\r\rA Merrill tradition for over 40 years, every April the Merrill students select a series of murals to be removed from the Moat and a collection new ones to take their place.  \r\rGrab a paintbrush, enjoy the henna and tie dying activities, and join the Merrill community in a laid back festival atmosphere.\r\rFor more information contact [Jeremy Parker](mailto:jrparker@ucsc.edu), Assistant College Programs Coordinator, Merrill College."}},{"event":{"title":"Banana Slug Lunch: Farm Fresh, Family Style","teaser":"Taking place at the heart of alumni weekend, the Banana Slug Lunch embodies the ideal of coming home. Elbow-to-elbow with fellow alumni and sharing a meal over conversation.This year the lunch will take place in the Cowell courtyard and include stories from assembled guests.","location":"Cowell College","link":"https://events.ucsc.edu/event/2822","event_instances":"1","event_date":"1429990200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Banana-Slug-Lunch-Farm-fresh%2C-family-style.png?itok=wxYODzuy","alt":""},"description":"Taking place at the heart of alumni weekend, the Banana Slug Lunch embodies the ideal of coming home. Elbow-to-elbow with fellow alumni and sharing a meal over conversation.\r\rThis year the lunch will take place in the Cowell courtyard and include stories from assembled guests.\r\rOver a family style meal serving delicious, locally sourced produce, alumni will share their own stories of the campus and know they are always welcome home.\r\rFor more information contact the [Special Events Office](mailto:specialevents@ucsc.edu) or call 831-459-5003.\r"}},{"event":{"title":"EOP Open House & Alumni/Student Mixer","teaser":"Mingle with alumni, grab a bite to eat, and learn about EOP program updates.This event will be an open house mixer with light refreshments. Alumni will be able to tour the ARCenter and enjoy the Courtyard Patio view, while mingling with EOP Students and obtaining EOP program updates.","location":"Academic Resources Center (ARC)","link":"https://events.ucsc.edu/event/2823","event_instances":"1","event_date":"1429992000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/EOP%20open%20house.jpg?itok=4dzSf72e","alt":""},"description":"Mingle with alumni, grab a bite to eat, and learn about EOP program updates.\r\rThis event will be an open house mixer with light refreshments. Alumni will be able to tour the ARCenter and enjoy the Courtyard Patio view, while mingling with EOP Students and obtaining EOP program updates. \r\rFor more information contact [Carolyn Rodriguez](mailto:ctrodrig@ucsc.edu), EOP Specialist. "}},{"event":{"title":"Kenneth S. Norris Center for Natural History Dedication","teaser":"The Kenneth S. Norris Center for Natural History Dedication is an opportunity to celebrate natural history training accomplishments over the past 50 years and articulate a vision for the new Norris Center to the campus community, alumni, and other potential donors.","location":"Natural Sciences 2 Building and Annex","link":"https://events.ucsc.edu/event/2720","event_instances":"1","event_date":"1429995600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/norris_kenneth.98-08-24.gif?itok=mIpL-25V","alt":""},"description":"The Kenneth S. Norris Center for Natural History Dedication is an opportunity to celebrate natural history training accomplishments over the past 50 years and articulate a vision for the new Norris Center to the campus community, alumni, and other potential donors.\r\rThis dedication ceremony was made possible by generous support from the Packard Foundation. \r\r**About Kenneth S. Norris**\rNorris—who created the Natural History Field Quarter and set the tone for its joy-infused, intellectually challenging field-based educational approach—was internationally renowned as a cetacean biologist and desert ecologist, celebrated throughout the University of California for inaugurating its statewide system of protected natural reserves, and beloved on the UC Santa Cruz campus as a brilliant researcher and dedicated teacher.\r\rFor more information contact [Professor Karen Holl](mailto:kholl@ucsc.edu), Environmental Studies Department."}},{"event":{"title":"Tales as Tall as the Redwoods: Reflections on UCSC's Founding Years","teaser":"Join an animated roundtable discussion of faculty emeriti and alumni sharing stories about their experiences at UC Santa Cruz during its early years.Our engaging list of panelists includes:","location":"Stevenson College","link":"https://events.ucsc.edu/event/2721","event_instances":"1","event_date":"1429995600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/red-wood.jpg?itok=dNGceSXM","alt":"Alumni Weekend 2015 Featured Events"},"description":"Join an animated roundtable discussion of faculty emeriti and alumni sharing stories about their experiences at UC Santa Cruz during its early years. \r\rOur engaging list of panelists includes: \r\r**Peter Kenez** (Professor Emeritus)\rMultiple generations of UC Santa Cruz students recognize the name Peter Kenez. A Ph.D. graduate from Harvard University and celebrating 50 years on campus in 2016, it is not uncommon for students ask, \"Does Peter Kenez still teach history here? My dad was a student of his!\" A wonderful opportunity to hear the wisdom of a much beloved pioneer.\r\r**David Thomas** (Professor Emeritus)\rDavid Thomas was a professor of politics at UCSC from 1966 to 1999. From 1980, he taught a course, whose final title was \"Sexual Politics: Queer Politics.\" The course was a major contribution to queer life at UCSC and was one of the first of its kind in the United States. A true trailblazer in his field and one we welcome home for Alumni Weekend.\r\r**Gregg Herken** (Stevenson '69)\rGregg Herken is a distinguished UC Santa Cruz alumnus and Professor Emeritus of History at the University of California. He taught at Oberlin College and Yale before becoming a Founding Faculty member at UC Merced. He is the author of five books and was a finalist for the 2003 Los Angeles Times Book Prize in History.\r\r**Linda Peterson** (Stevenson '70)\rLinda Peterson currently serves as a UC Santa Cruz Foundation Trustee and Associate General Counsel at Occidental Petroleum. Her distinguished career includes tenures as Director of the The Mary Magdalene Project, President of the Los Angeles Chapter of the American Corporate Secretaries and Governance Professionals, and founding member of the Board of Directors of Theater By The Blind (now theater Breaking Through Barriers), a New York City-based theater\rcompany that works with the disabled. \r\r**Gail Hershatter - Moderator**  \rGail Hershatter is Distinguished Professor of History at the University of California, Santa Cruz, where she has taught since 1991.  Her books include *The Workers of Tianjin, 1900-1949* (1986), *Personal Voices: Chinese Women in the 1980s* (with Emily Honig, 1988), *Dangerous Pleasures: Prostitution and Modernity in Twentieth-Century Shanghai* (1997), *Women in China’s Long Twentieth Century* (2007), and *The Gender of Memory: Rural Women and China’s Collective Past* (2011). She chaired the History Department from 2010-2013 and is a former President of the Association for Asian Studies (2011-2012).\r\rFor more information contact [Stephanie Sawyer](sawyer@ucsc.edu), Assistant Manager, History Department."}},{"event":{"title":"True Originals: From Here to Modernity—Perspectives from Distinguished Museum Professionals","teaser":"Alumni Arts professionals present how an array of educational experiences at UC Santa Cruz helped inspire five of its graduates to pursue their present careers at five of America’s notable art museums.","location":"Digital Arts Research Center (DARC)","link":"https://events.ucsc.edu/event/2693","event_instances":"1","event_date":"1429997400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/jock-reynolds.jpg?itok=HDEk5Umr","alt":"True Originals - Alumni Weekend 2015 Featured Event"},"description":"Alumni Arts professionals present how an array of educational experiences at UC Santa Cruz helped inspire five of its graduates to pursue their present careers at five of America’s notable art museums. \r\rA panel hosted and introduced by **Shelby Graham**, Director of the Porter Sesnon Gallery, will be moderated by **Jock Reynolds** (Stevenson ’69), Director of the Yale University Art Gallery, holding forth with alumni colleagues **Jeremy Strick** (Cowell ’77), Director, Nasher Sculpture Center, **Philip Brookman** (Porter ’75), Consulting Curator, National Gallery of Art, **Karen Moss** (Porter ’77), Curator and Faculty, Otis College of Art and Design and USC Curatorial MA Program, and **Erin O’Toole** (Kresge ’92), Associate Curator of Photography, San Francisco Museum of Modern Art.\r\rFor more information contact [Meg Corman](mailto:mlcorman@ucsc.edu), Special Assistant to the Chancellor and VC of University Relations."}},{"event":{"title":"True Originals: The Santa Cruz Stairway—Today's Writing and Publishing Strategies from Fiction to Memoir to Hand-Made Books","teaser":"Alumni authors share their experiences in pursuing their dream of writing and with the changing landscape of publishing.","location":"McHenry Library","link":"https://events.ucsc.edu/event/2773","event_instances":"1","event_date":"1429997400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/bookshop-sc.jpg?itok=ZAnVgSJR","alt":"Alumni Weekend 2015 Featured Events"},"description":"Alumni authors share their experiences in pursuing their dream of writing and with the changing landscape of publishing.\r\r**The panel includes:**  \rLiterary agent and author **Laurie Fox** (Porter College ‘75 -- it was College Five then), Author **Reyna Grande** (Kresge  ’99) , Printer and writer **Tom Killion** (Cowell ‘75), and Author and editor **Don Wallace** (Cowell ’74). \r\rA reading at Bookshop Santa Cruz is planned in town during the weekend.\r\rFor more information contact [Meg Corman](mailto:mlcorman@ucsc.edu), Special Assistant to the Chancellor and VC of University Relations.\r\r"}},{"event":{"title":"An Uncommon Place: A Walking Exploration of UCSC's History, Landscape and Architecture","teaser":"Join Professors Emeriti James Clifford, Michael Cowan, and Virginia Jansen and Campus Architect Emeritus Frank Zwart (Cowell ’71) for an exploration of campus through its environment.","location":"Cowell College","link":"https://events.ucsc.edu/event/2782","event_instances":"1","event_date":"1429997400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/zwart_frank_72.jpg?itok=d0OXOchg","alt":"Campus Architect Emeritus Frank Zwart"},"description":"Join Professors Emeriti James Clifford, Michael Cowan, and Virginia Jansen and Campus Architect Emeritus Frank Zwart (Cowell ’71) for an exploration of campus through its environment. \r\rCo-curators of [An Uncommon Place: Shaping the UC Santa Cruz Campus](http://art.ucsc.edu/galleries/exhibitions/upcoming), a concurrent exhibition at the Sesnon Art Gallery, they have been investigating the early history of UC Santa Cruz as a built environment, from four distinct perspectives. Neither a natural history, an institutional history, nor a purely architectural history, their explorations focus on place making, and on architecture as a broadly interactive process, and are founded on the assumption that UC Santa Cruz’s extraordinary physical setting and the university’s educational vision are inseparable. \r\rHow did the ensemble of sites, structures, and environments that make up the UC Santa Cruz campus take shape? How has this special place been sustained and transformed over 50 years, in relation to an evolving educational project? Where has it fallen short? What has been overlooked in our conversations about it? The campus, praised by all for its beauty, remains in a continuing process of adaptation, negotiating inherent tensions and contradictions in changing historical moments. A tradition as well as an essential resource, it needs to be critically understood, and celebrated. This walk will view the campus through a number of lenses: historical, poetic, critical, and practical. "}},{"event":{"title":"Alan Chadwick Garden Tour","teaser":"Join garden manager Orin Martin for a tour of the Chadwick Garden's unique collection of organically managed vegetables, flowers, fruit trees, and native plants, and learn about the garden's pivotal role in organic gardening education and training.","location":"Alan Chadwick Garden","link":"https://events.ucsc.edu/event/2824","event_instances":"1","event_date":"1429997400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Alan%20Chadwick%20Garden%20tour_0.jpg?itok=VRTUWhdn","alt":""},"description":"Join garden manager Orin Martin for a tour of the Chadwick Garden's unique collection of organically managed vegetables, flowers, fruit trees, and native plants, and learn about the garden's pivotal role in organic gardening education and training.\r\rPlease wear comfortable walking shoes for this event. For more information contact [Orin Martin](mailto:orin@ucsc.edu), Garden Manager."}},{"event":{"title":"Teach In: Bettina Aptheker","teaser":"Be a student again for an afternoon! Attend a lecture entitled \"Feminism & Social Justice\" from faculty professor of feminist studies Bettina Aptheker.","location":"Stevenson College","link":"https://events.ucsc.edu/event/2826","event_instances":"1","event_date":"1429997400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/bettina-aptheker.jpg?itok=WoCy0eSD","alt":"Bettina Aptheker - Teach-in Alumni Weekend 2015 Featured Event"},"description":"Be a student again for an afternoon! Attend a lecture entitled \"Feminism & Social Justice\" from faculty professor of feminist studies Bettina Aptheker.\r\rJoin fellow alums for a lively look at current movements in social justice and the ways in which gender, race, class, and sexuality interconnect with each other.\r\rFrom birth matters to thinking about prisons, from queer stakes to transgender identities, from immigrant lives to environmental justice in scores of communities across the country, these issues animate and agitate. Join in debate, dialogue and discussion.\r\rFor more information contact [Samantha Li](sakli@ucsc.edu), Regional Program Assistant, University Relations."}},{"event":{"title":"Then and Now Walking Tours","teaser":"Join current Student Life University Guides (SLUGS) for a stroll around campus—revisit old haunts and see new additions to campus.Our tour guides will highlight UCSC's latest prestigious achievements and fill you in on some new campus facts and figures.","location":"Cowell College","link":"https://events.ucsc.edu/event/2834","event_instances":"1","event_date":"1429997400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Then%20and%20Now%20Admissions%20Tours.png?itok=imVvQE5P","alt":""},"description":"Join current Student Life University Guides (SLUGS) for a stroll around campus—revisit old haunts and see new additions to campus.\r\rOur tour guides will highlight UCSC's latest prestigious achievements and fill you in on some new campus facts and figures. \r\rRemember to wear comfortable walking shoes and dress in layers. The tour will last an hour and depart in 15 minute increments from **2:30pm, 2:45pm, 3:00pm, 3:15pm, 3:30pm**.\r\rFor more information contact [Beatrice Atkinson-Myers](mailto:beatrice@ucsc.edu), Assistant Director of Admissions."}},{"event":{"title":"Teach In: Craig Haney","teaser":"Be a student again for an afternoon! Professor Craig Haney will present a lecture entitled \"Think Different: Why Everything We’ve Been Taught About Crime is Wrong and What We Need to Do About It.\"","location":"Stevenson College","link":"https://events.ucsc.edu/event/2825","event_instances":"1","event_date":"1429997400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/craig-haney.jpg?itok=FabxE1dU","alt":"Alumni Weekend 2015 Featured Events"},"description":"Be a student again for an afternoon! Professor Craig Haney will present a lecture entitled \"Think Different: Why Everything We’ve Been Taught About Crime is Wrong and What We Need to Do About It.\"\r\rProfessor Haney will describe the political and media misrepresentations of the nature and causes of crime in our society and their consequences in helping to fuel a very expensive and misguided set of crime control policies over the last several decades. \r\rHe will present the results of extensive research—his own and that of a number of others—demonstrating the developmental and social contextual origins of criminal behavior, including the impact of childhood risk factors, trauma, and maltreatment as well as economic inequality and neighborhood disadvantage on life trajectories. \r\rIndeed, there is now an entire science of “life course criminology” that stands in direct opposition to the simplistic model of “free will” upon which much criminal law and prison policy continues to be based. \r\rHaney will conclude by proposing an alternative, truly preventive model of crime control that stems directly from this fundamentally different understanding of the nature of criminality.\r\rFor more information contact [Samantha Li](sakli@ucsc.edu), Regional Program Assistant, University Relations."}},{"event":{"title":"Lavender Reception","teaser":"We welcome all alumni to join the students and staff of the Cantú Queer Center at our annual Lavender Reception.","location":"Cantu Queer Center","link":"https://events.ucsc.edu/event/2828","event_instances":"1","event_date":"1429999200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Lavender%20Reception.jpg?itok=tADvMIXe","alt":""},"description":"We welcome all alumni to join the students and staff of the Cantú Queer Center at our annual Lavender Reception. \r\rThis year we celebrate 25 years since queer student leaders were handed key to the Merrill Rec Room and, with little funding but tremendous chutzpah, began to build a safe space and provide critical support for GLBTIQ students. \r\rEnjoy local wines, hearty hors d'oeuvres, and queer conviviality as you step into UCSC's beloved homo-away-from-home at the Cantú.\r\rFor more information contact [Deborah Abbott](mailto:dabbott@ucsc.edu), Director, Cantú GLBTI Resource Center."}},{"event":{"title":"ACE / STEM Diversity Program Reunion","teaser":"Join us for a celebration of the ACE program and its alumni, as we recognize the living successes within the broader STEM Diversity community.","location":"Oakes College","link":"https://events.ucsc.edu/event/2829","event_instances":"1","event_date":"1429999200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/ACE%20%26%20Stem.jpg?itok=q20U7NxH","alt":""},"description":"Join us for a celebration of the ACE program and its alumni, as we recognize the living successes within the broader STEM Diversity community.\r\rThis event provides a forum for alumni new and old to reconnect and meet current students, and for the broader STEM Diversity community (including MBRS, IMSD, and MARC) to recognize their living successes.\r\rOur distinguished attendees include:\r\r**Nancy Cox-Konopelski** (Grad Div, '87), Director of ACE\r**Stephen Abreu** (Kresge, '98)\r**Marina Ramon** (Grad Div, '95)\r**Howard Hang** (Crown, '98)\r**Sabrina Noel** (Cowell, '02)\r**Blake Riggs** (Grad Div, '97)\r\rFor more information contact [JJ Mack](mailto:jjmack@ucsc.edu), Assistant Director of Development."}},{"event":{"title":"Alumni Wine Reception: Sunset and Wine","teaser":"Unwind with a glass of wine in the company of friends and reconnect with favorite faculty and staff.Featured Teach-In professor Craig Haney will be on-hand to continue discussion of his lecture over fine-food, drink and a beautiful spread of hors d'oeuvres.","location":"Cowell College","link":"https://events.ucsc.edu/event/2830","event_instances":"1","event_date":"1430002800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/wine-reception.jpg?itok=DfkT9XSn","alt":"Alumni Wine Reception: Sunset and Wine - Alumni Weekend 2015 Featured Event"},"description":"Unwind with a glass of wine in the company of friends and reconnect with favorite faculty and staff.\r\rFeatured Teach-In professor **Craig Haney** will be on-hand to continue discussion of his lecture over fine-food, drink and a beautiful spread of hors d'oeuvres. \r\rFor more information contact the [Special Events Office](mailto:specialevents@ucsc.edu) or call 831-459-5003."}},{"event":{"title":"SCIPP Public Lecture on Particle Physics and Cosmology","teaser":"Join the Santa Cruz Institute for Particle Physics (SCIPP) for a discussion of cutting-edge topics in particle physics and cosmology, and meet some of the people who make it possible.","location":"Media Theater","link":"https://events.ucsc.edu/event/2736","event_instances":"1","event_date":"1430006400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/SCIPP.jpg?itok=8Z32BpV8","alt":""},"description":"Join the Santa Cruz Institute for Particle Physics (SCIPP) for a discussion of cutting-edge topics in particle physics and cosmology, and meet some of the people who make it possible.  \r\rFor more than 35 years, SCIPP students, faculty, and staff have been involved in world-leading research projects, including the recent discovery of the Higgs Boson. SCIPP's primary focus is experimental and theoretical particle physics and particle astrophysics, including the development of technologies needed to advance that research, and SCIPP personnel have also pioneered the application of those technologies to enable breakthroughs in other areas, such as neuroscience and biomedicine. Come for a mind-expanding exploration of the field followed by refreshments.\r\rFor more information visit the [SCIPP Reunion]( http://www.scipp2015.myevent.com) website or contact [Mykell Discipulo](mkdiscip@ucsc.edu), Assistant Director for Administration and Finance, SCIPP.\r\r**Related Events**\r\r**SCIPP 35th Anniversary and Reunion**\rCelebrating 35 years of discovery and innovation at the Santa Cruz Institute for Particle Physics. Reunion events will include talks and discussions, a public lecture, dinner on Saturday night, lab tours, and lots of time to reconnect with friends."}},{"event":{"title":"Bonfire by the Bay","teaser":"After a busy day of reconnecting, grab an old friend and head to the East field to catch the remaining moments of the sunset while warming up by a bonfire. Music, hot chocolate, food trucks. This event is a must to wind down your day.","location":"","link":"https://events.ucsc.edu/event/2831","event_instances":"1","event_date":"1430010000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/bonfire.jpg?itok=EjOmvEPD","alt":"Bonfire by the Bay - Alumni Weekend 2015 Featured Event"},"description":"After a busy day of reconnecting, grab an old friend and head to the East field to catch the remaining moments of the sunset while warming up by a bonfire. Music, hot chocolate, food trucks. This event is a must to wind down your day. \r\rFor more information contact the [Special Events Office](mailto:specialevents@ucsc.edu)."}},{"event":{"title":"EOP Alumni Reunion Honoring Bridge Program","teaser":"Join us to celebrate the impact the EOP has had on the UC Santa Cruz community. Connect with staff, mentors and friends that helped shape your experience as a student.","location":"","link":"https://events.ucsc.edu/event/2832","event_instances":"1","event_date":"1430011800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/EOP%20Alumni%20Reunion%20Honoring%20Bridge%20Program.jpg?itok=G7tsETFb","alt":""},"description":"Join us to celebrate the impact the EOP has had on the UC Santa Cruz community. Connect with staff, mentors and friends that helped shape your experience as a student. \r\rFollowing a brief program update honoring the successes of the Bridge Program, join us for dinner and dancing at the Hotel Paradox Ballroom. \r\rThe Bridge Program is a First-Year Experience Program that supports and guides students in their transition from high school to the university. Student participants are first generation college students who may come from low-income backgrounds and under-resourced California high schools.\r\rFor more information contact [Carolyn Rodriguez](mailto:ctrodrig@ucsc.edu), EOP Specialist.\t\r"}},{"event":{"title":"Lick Observatory History and Telescope Viewing","teaser":"Please join us for a fascinating lecture about James Lick, the history of the observatory, and its current astronomical research at 8 p.m, followed by a viewing (weather permitting) through our telescopes: the 36-inch Lick Refractor and/or the 40-inch Nickel Reflector.","location":"Lick Observatory","link":"https://events.ucsc.edu/event/2833","event_instances":"1","event_date":"1430017200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Lick%20Observatory%20History%20and%20Telescope%20Viewing.jpg?itok=ENHZzv18","alt":""},"description":"Please join us for a fascinating lecture about James Lick, the history of the observatory, and its current astronomical research at 8 p.m, followed by a viewing (weather permitting) through our telescopes: the 36-inch Lick Refractor and/or the 40-inch Nickel Reflector. \r\rLick Observatory has a long, distinguished history and has been part of the University of California Observatories system since 1888. In the 1960’s, most of the astronomy faculty at the observatory moved to the new UCSC campus. \r\rThe astronomers and technical staff at UCSC and those at Lick Observatory on Mt. Hamilton continue to collaborate closely on research, building high-tech telescopes and instruments, and designing innovative education programs. Check out the Lick Observatory Archives and our Historical Collections to learn more about the observatory. If you would like to see additional spectacular photos of Lick Observatory, please click here.\r\rLick Observatory has been performing research and public education since 1888 as part of the UC system. The [Support Lick](http://www.ucolick.org/SaveLick/) campaign is raising awareness of the unique research and education programs that Lick Observatory performs and the ways in which you can help those programs.\r\rFor more information contact [Elinor Gates](mailto:egates@ucolick.org), Staff Astronomer, UC Observatories.\t\r"}},{"event":{"title":"Crown Alumni Brunch","teaser":"Join fellow Crown alumni for a light brunch with new Interim Provost Manel Camps at the Crown Provost House.Mingle, reconnect, and reflect on your time at Crown College! This is a great opportunity to share your experiences, as well as hear what things are like on campus today.","location":"Crown College","link":"https://events.ucsc.edu/event/2835","event_instances":"1","event_date":"1430065800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Crown%20Alumni%20Brunch.jpg?itok=o7ImIK1a","alt":""},"description":"Join fellow Crown alumni for a light brunch with new Interim Provost Manel Camps at the Crown Provost House. \r\rMingle, reconnect, and reflect on your time at Crown College! This is a great opportunity to share your experiences, as well as hear what things are like on campus today.\r\rFor more information contact [Cathy Murphy](cmurphym@ucsc.edu), College Academic Programs Coordinator, Crown College."}},{"event":{"title":"College Eight Sustainability Tour","teaser":"Explore the many sustainability programs at UC Santa Cruz and College Eight.","location":"College Eight","link":"https://events.ucsc.edu/event/2836","event_instances":"1","event_date":"1430065800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/College%208%20Sustainability%20Tour.png?itok=1rquF5pL","alt":""},"description":"Explore the many sustainability programs at UC Santa Cruz and College Eight. \r\rSince its creation in 1972, College Eight has been a crucial component of the university's world-renowned Environmental, Ecological and Sustainability programs and initiatives. Our graduates include some of the nation's top environmental professionals and practitioners.\r\rCome meet current students, and learn what everyone can do to help the campus become a living lab for sustainability.\r\rFor more information contact [Jo Chamberlain](jchambe1@ucsc.edu), Academic Programs Coordinator, College 8."}},{"event":{"title":"Cowell Brunch: Cowell's Birthday Celebration!","teaser":"Cowell was the founding college of UC Santa Cruz. Join us in celebrating this 50 year milestone with a brunch on the Cowell Provost Lawn.","location":"","link":"https://events.ucsc.edu/event/2697","event_instances":"1","event_date":"1430067600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Cowell%20Birthday.jpg?itok=aZTtVswl","alt":""},"description":"Cowell was the founding college of UC Santa Cruz. Join us in celebrating this 50 year milestone with a brunch on the Cowell Provost Lawn. \r\rContinuing a tradition that started in during 2011, this event will also mark five years of alumni gathering for bacon, eggs, bagels, and lox in the company of friends. Mingle with alumni from the early years at Cowell, pioneer faculty, current students, and Cowell Provost **Faye Crosby**. \r\rFollowing the Cowell Brunch, we invite you to an intimate gathering of remembrance to honor all those who have passed in the last year. \r\rFor more information contact [Veronica Hamilton](mailto:vhamilto@ucsc.edu), Events and Outreach Coordinator, Cowell College."}},{"event":{"title":"Community Justice: Can Service Learning Be Used to Transform Systems?","teaser":"Do you have fond memories of Oakes Serve or a service learning activity at UC Santa Cruz? If yes, we want to hear your stories and experiences!This event serves as a wonderful opportunity to learn about the budding Service Learning and Community Justice program at Oakes.","location":"Oakes College","link":"https://events.ucsc.edu/event/2837","event_instances":"1","event_date":"1430067600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Community%20justice-%20Can%20service%20learning%20be%20used%20to%20transform%20systems-.jpg?itok=_C7ZMwwp","alt":""},"description":"Do you have fond memories of Oakes Serve or a service learning activity at UC Santa Cruz? If yes, we want to hear your stories and experiences! \r\rThis event serves as a wonderful opportunity to learn about the budding Service Learning and Community Justice program at Oakes. \r\rMeet fellow alumni, bond over your shared experiences of community engagement, and discuss if community engagement can work toward community justice. \r\rFor more information contact [Heidi Flores](mailto:heflores@ucsc.edu), College Academic Programs Coordinator, Oakes College.\r\r\r"}},{"event":{"title":"Stevenson Alumni Brunch","teaser":"Join Provost Alice Yang at her home for the Stevenson Alumni Brunch and Career Panel. Reconnect with fellow alumni, meet current students, and enjoy a delicious meal together.","location":"Stevenson College","link":"https://events.ucsc.edu/event/2838","event_instances":"1","event_date":"1430067600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Stevenson%20Alumni%20Brunch.png?itok=v6C45nfE","alt":""},"description":"Join Provost Alice Yang at her home for the Stevenson Alumni Brunch and Career Panel. Reconnect with fellow alumni, meet current students, and enjoy a delicious meal together. \r\rAlumni and students are invited to learn more about our online Alumni Career Education program and meet with current participants. This program uses contemporary online learning technologies to connect alumni with junior and senior Stevenson students interested in careers in their fields, and also provides students with practical advice to help them select and prepare for future jobs.\r\rFor more information contact [David Mori](mailto:dmori@ucsc.edu), Academic Programs Coordinator, Stevenson College."}},{"event":{"title":"Merrill Renewal Brunch","teaser":"Join fellow Merrill alumni for a light brunch with Provost Elizabeth Abrams at the Merrill Provost House.","location":"Merrill College","link":"https://events.ucsc.edu/event/2843","event_instances":"1","event_date":"1430067600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Merrill%20renewal%20brunch.jpg?itok=AMgw-lIH","alt":""},"description":"Join fellow Merrill alumni for a light brunch with Provost Elizabeth Abrams at the Merrill Provost House. \r\rWhile reconnecting with friends, learn about the wonderful Merrill College Renewal program that has brought architectural additions and upgrades to the residential and administrative spaces within the college.\r\rVisit the Merrill College [website](http://merrill.ucsc.edu/) for more information, or contact [Esperanza Zamora](zamora@ucsc.edu), Assistant to the Merrill College Provost."}},{"event":{"title":"40 years of Kresge, 46 of Porter, and 50 years of UCSC","teaser":"Join Kresge Interim Provost Kathy Foley for a multifaceted event involving collected campus stories and an interactive performance.","location":"Kresge Town Hall","link":"https://events.ucsc.edu/event/2847","event_instances":"1","event_date":"1430067600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Kresge_College.jpg?itok=4ULIMY1w","alt":""},"description":"Join Kresge Interim Provost **Kathy Foley** for a multifaceted event involving collected campus stories and an interactive performance.\r\rCurrent students in the Kresge Challenge Seminar will present an oral histories project alongside selected early faculty, providing a unique opportunity to share generational perspectives of campus life.\r\rAttendees will be treated to an interactive performance *Playful Revolutions: 50 Years of UCSC* and a post-event reception at the Kresge Provost House.\r\rFor more information contact [Kathy Foley](mailto:kfoley@ucsc.edu), Interim Provost, Kresge College.\r"}},{"event":{"title":"We Are Wiser Together: Igniting Possibilities Through Intergenerational Connections","teaser":"Live music, free food, and meaningful intergenerational conversations.Connect with student leaders, community partners, and alumni during a series of World Cafe conversations about how we can be wiser together through collaboration across generations.","location":"Kresge Town Hall","link":"https://events.ucsc.edu/event/2841","event_instances":"1","event_date":"1430074800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/We%20Are%20Wiser%20Together%20Igniting%20Possibilities%20Through%20Intergenerational%20Connections.png?itok=3O8AzIpk","alt":""},"description":"Live music, free food, and meaningful intergenerational conversations. \r\rConnect with student leaders, community partners, and alumni during a series of World Cafe conversations about how we can be wiser together through collaboration across generations. \r\rHow can we work and play together as we turn 50? What becomes possible when we - one generation alive and awake together at this unique moment in history - form partnerships in business, politics, education, and civil society? \r\rFarm fresh lunch prepared by students from the Kresge Common Ground Center and Kresge Garden Coop included with pre-registration.\r\rFor more information contact [David Shaw](mailto:commonground@ucsc.edu), Co-Director, Common Ground. "}},{"event":{"title":"Dizikes Concert: Sounds of the Times","teaser":"Journey up to the Humanities Lecture Hall at 12:30 PM for the annual Dizikes Concert.","location":"","link":"https://events.ucsc.edu/event/2699","event_instances":"1","event_date":"1430076600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Dizikes%20Concert%20Sounds%20of%20the%20Times.png?itok=11f4CmQp","alt":""},"description":"Journey up to the Humanities Lecture Hall at 12:30 PM for the annual Dizikes Concert.\r\rThe Dizikes Concert is an annual event, and it is always well attended. In light of UC Santa Cruz turning 50, the songs this year will be popular songs on the hit parade in 1965-1966. Some of the songs will have surprising and revised lyrics.\r\rA list of featured songs includes:\r\r*Sounds of Silence* - Simon & Garfunkel\r*These Boots Are Made For Walkin'* - Nancy Sinatra\r*California Dreamin'* - The Mamas & Papas \r*We Can Work It Out* - The Beatles\r*Yesterday* - The Beatles\r*California Girls* - The Beach Boys\r*Homeward Bound* - Simon & Garfunkel\r*Do You Believe in Magic* - The Lovin' Spoonful\r*Let's Go Get Stoned* - Ray Charles\r*Monday Monday* - The Mamas & Papas\r*You Baby* - The Turtles  \r\rFor more information contact [Veronica Hamilton](mailto:vhamilto@ucsc.edu), Events and Outreach Coordinator, Cowell College."}},{"event":{"title":"Stevenson History Session","teaser":"Alumni are invited to listen and contribute to interviews featuring the rich tapestry of voices of Stevenson College.","location":"Stevenson College","link":"https://events.ucsc.edu/event/2839","event_instances":"1","event_date":"1430078400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Stevenson%20History.jpg?itok=cm0V_HpW","alt":""},"description":"Alumni are invited to listen and contribute to interviews featuring the rich tapestry of voices of Stevenson College. \r\rThe event will showcase interviews from faculty, pioneer alums, and current alums about their perspective of what life at Stevenson was like. In addition, there will be an opportunity for attendees to add their own voices to the project.\r\rFor more information contact [David Mori](mailto:dmori@ucsc.edu), Academic Programs Coordinator, Stevenson College.\r"}},{"event":{"title":"Deepening Our Connections: A Call to Oakes Alum","teaser":"Join a spirited discussion about ways to deepen alumni connections with Oakes and its future students and families.","location":"Oakes College","link":"https://events.ucsc.edu/event/2840","event_instances":"1","event_date":"1430078400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/oakes-college.jpg?itok=_K2YhvxL","alt":""},"description":"Join a spirited discussion about ways to deepen alumni connections with Oakes and its future students and families.\r\rWhat was your transition to college like? Would you have benefitted from having an Oakes alum, in your home town, who you and your family could have talked with about what to expect?  Would it have helped to have someone you could have turned to who had been in a similar situation as you?  \r\rLet’s talk about deepening our connections and discuss the possibility of developing a movement at Oakes that connects Oakes alum to incoming Oakes students and families.\r\rFor more information contact [Heidi Flores](mailto:heflores@ucsc.edu), College Academic Programs Coordinator, Oakes College."}},{"event":{"title":"50th Anniversary Event Honoring Kenneth and Ann Thimann","teaser":"You are invited to an informal event sharing the memories of Crown College founders Kenneth and Ann Thimann.","location":"Crown College","link":"https://events.ucsc.edu/event/2700","event_instances":"1","event_date":"1430082000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/thimann.jpg?itok=84HTuZ2Q","alt":""},"description":"You are invited to an informal event sharing the memories of Crown College founders Kenneth and Ann Thimann. \r\rKenneth Thimann was an eminent biologist who came from Harvard to become the founding Provost of Crown College and the first dean of the Science Division at UCSC. He played a major role in establishing the Biology department and guided the development of other science departments on campus.\r\rEmeriti faculty and present faculty, including former Crown College Provosts Ed Landesman and Peggy Musgrave will participate.\r\rFor more information contact [Cathy Murphy](mailto:cmurphym@ucsc.edu), College Academic Programs Coordinator, Crown College.\r"}}]}