{"events":[{"event":{"title":"Emeriti Lecture Series","teaser":"“Looking for Santa Cruz’s First Municipal Water System” a lecture by  Melanie Mayer, Professor Emerita Psychology.","location":"Arboretum","link":"https://events.ucsc.edu/event/2684","event_instances":"1","event_date":"1421350200","thumbnail":"","description":"“Looking for Santa Cruz’s First Municipal Water System” a lecture by  Melanie Mayer, Professor Emerita Psychology."}},{"event":{"title":"Campus Kick-Off: Dress Like 1965 Day!","teaser":"Mad Men costume designer and alumna Tiffany White Stanton (Kresge '03, psychology) will prepare advice and tips to give you the perfect look. Dress up and then show up at Quarry Plaza to be photographed so she can determine who has most authentic 1965 costume.","location":"Quarry Plaza","link":"https://events.ucsc.edu/event/2683","event_instances":"1","event_date":"1421352000","thumbnail":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/ms0090_pho_0013.jpg?itok=kgPOEL6K","description":"Mad Men costume designer and alumna Tiffany White Stanton (Kresge '03, psychology) will prepare advice and tips to give you the perfect look. Dress up and then show up at Quarry Plaza to be photographed so she can determine who has most authentic 1965 costume."}},{"event":{"title":"Questions that Matter: Making The Cosmos Local","teaser":"Questions that Matter is a public humanities series developed by UCSC and the community of Santa Cruz. It will bring together in conversation two or more UCSC scholars with community residents and students to explore questions that matter to all of us.","location":"","link":"https://events.ucsc.edu/event/2672","event_instances":"1","event_date":"1422410400","thumbnail":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Cosmos_thumbnail.jpg?itok=CHZZN7yj","description":"Questions that Matter is a public humanities series developed by UCSC and the community of Santa Cruz. It will bring together in conversation two or more UCSC scholars with community residents and students to explore questions that matter to all of us. The series is a part of a strategic initiative of the Institute for Humanities Research (IHR) to champion the role and value of the humanities in contemporary life. At the University of California Santa Cruz, we understand that the humanities are a crucial element of any first-rate liberal arts education. Indeed, what distinguishes the best universities in the United States is the fact that the humanities are an integral part of their core curriculum, along with the arts and sciences. The series is designed as a lecture and conversation, with plenty of time built in for participant questions and answers. The series will be in partnership with Bookshop Santa Cruz, the Santa Cruz Public Libraries, and the Kuumbwa Jazz Center.\r\rPlease stay tuned for more information.\r"}},{"event":{"title":"31st Annual Martin Luther King, Jr. Convocation ","teaser":"Please join us for the 2015 Martin Luther King, Jr. Convocation featuring Angela Y. Davis. Her talk is titled, \"Racism, Militarism, Poverty: From Ferguson to Palestine.\"","location":"","link":"https://events.ucsc.edu/event/2705","event_instances":"1","event_date":"1422500400","thumbnail":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/DAVIScolor-1.jpg?itok=pdVqXN2V","description":"Please join us for the 2015 Martin Luther King, Jr. Convocation featuring Angela Y. Davis. Her talk is titled, \"Racism, Militarism, Poverty: From Ferguson to Palestine.\"\r\rAngela Davis is distinguished professor emerita of History of Consciousness and Feminist Studies at UC Santa Cruz, and the author of nine books, including her most recent book of essays called, \"The Meaning of Freedom.\" Through her activism and scholarship over the last decades, Angela Davis has been deeply involved in our nation’s quest for social justice.  Her work as an educator – both at the university level and in the larger public sphere – has always emphasized the importance of building communities of struggle for economic, racial, and gender equality. \r\rFeaturing vocal performance by singer and songwriter, AlexisRose. Plus presentation of the 7th annual Tony Hill Memorial Award. \r\rQuestions? Please contact the UC Santa Cruz Special Events Office at 831.459.5003 or email specialevents@ucsc.edu. "}},{"event":{"title":"Three Generations of Smiths","teaser":"Page Smith was the founding provost of Cowell College anda pioneer of UCSC. His wife Eloise supported the arts in the colleges. The winter show in the Eloise Pickard Smith Gallery will feature the paintings of Eloise, the fabrics of her son Carter, and the drawings of her granddaughter Sara.","location":"Cowell College","link":"https://events.ucsc.edu/event/2708","event_instances":"1","event_date":"1422666000","thumbnail":"","description":"Page Smith was the founding provost of Cowell College anda pioneer of UCSC. His wife Eloise supported the arts in the colleges. The winter show in the Eloise Pickard Smith Gallery will feature the paintings of Eloise, the fabrics of her son Carter, and the drawings of her granddaughter Sara."}},{"event":{"title":"Celebrating Page and Eloise Smith","teaser":"A one-day celebration in memory of Page and Eloise Smith. Page Smith was a noted historian.","location":"Stevenson Event Center","link":"https://events.ucsc.edu/event/2740","event_instances":"1","event_date":"1422723600","thumbnail":"","description":"A one-day celebration in memory of Page and Eloise Smith. Page Smith was a noted historian. The symposium will be a mix of personal recollections and professional observations by a variety of speakers, with distinguished professor emeriti John Dizikes serving as honorary chair of the symposium."}},{"event":{"title":"Tom Franco co-LAB Art Exhibition","teaser":"This exhibition will be part of a Porter class taught by Shelby Graham with Tom Franco.","location":"Sesnon Gallery, Porter College","link":"https://events.ucsc.edu/event/2732","event_instances":"1","event_date":"1423166400","thumbnail":"","description":"This exhibition will be part of a Porter class taught by Shelby Graham with Tom Franco. UCSC alumnus Tom Franco is co-founder of the Firehouse Art Collective, a pioneering project that is changing the arts community in the East Bay and is a compelling example of how UCSC graduates are truly original. Franco has invested in a collection of buildings and spaces that promotes collaboration and community. The collective, spread throughout the East Bay, has live-work housing, studios, cafes, galleries, and event and performance spaces. This open platform and participatory style is being adopted and practiced by galleries and museums around the world.This project will cultivate a creative community through collaborative exhibition format, community open mic events, performance collectives, discussions, and workshops at the Sesnon Art Gallery."}},{"event":{"title":"50 Artists 5 Decades","teaser":"A fun kick-off exhibition fundraiser that will benefit the Sesnon Art Gallery and celebrate UCSC’s 50th Anniversary. We have two fabulous venues for this exhibition: one on campus and one on the Westside of Santa Cruz in the former Wrigley Gum Factory Building, now an emerging arts venue.","location":"","link":"https://events.ucsc.edu/event/2729","event_instances":"1","event_date":"1423184400","thumbnail":"","description":"A fun kick-off exhibition fundraiser that will benefit the Sesnon Art Gallery and celebrate UCSC’s 50th Anniversary. We have two fabulous venues for this exhibition: one on campus and one on the Westside of Santa Cruz in the former Wrigley Gum Factory Building, now an emerging arts venue. The exhibition will feature 10 alumni artists from each decade. Hosted by Porter College Faculty Gallery and R. Blitzer Gallery in conjunction with Alumnus Tom Franco’s Co-LAB at the Sesnon Gallery. "}},{"event":{"title":"Tom Franco co-LAB Opening Reception","teaser":"UCSC students will showcase their collaboration with alumnus Tom Franco. Franco has invested in a collection of buildings and spaces that promotes collaboration and community.","location":"Sesnon Gallery, Porter College","link":"https://events.ucsc.edu/event/2733","event_instances":"1","event_date":"1423184400","thumbnail":"","description":"UCSC students will showcase their collaboration with alumnus Tom Franco. Franco has invested in a collection of buildings and spaces that promotes collaboration and community. The collective, spread throughout the East Bay, has live-work housing, studios, cafes, galleries, and event and performance spaces. This open platform and participatory style is being adopted and practiced by galleries and museums around the world.  UCSC students play an active role in the exhibition on all levels and will announce their program of special events taking place throughout the winter quarter at the Sesnon Gallery."}},{"event":{"title":"Tom Franco Lecture:  \"The Artist Community Collaborative Experience”","teaser":"Franco has invested in a collection of buildings and spaces that promotes collaboration and community. The collective, spread throughout the East Bay, has live-work housing, studios, cafes, galleries, and event and performance spaces.","location":"Digital Arts Research Center (DARC)","link":"https://events.ucsc.edu/event/2734","event_instances":"1","event_date":"1423191600","thumbnail":"","description":"Franco has invested in a collection of buildings and spaces that promotes collaboration and community. The collective, spread throughout the East Bay, has live-work housing, studios, cafes, galleries, and event and performance spaces. This open platform and participatory style is being adopted and practiced by galleries and museums around the world."}},{"event":{"title":"50 Artists 5 Decades","teaser":"A fun kick-off exhibition fundraiser that will benefit the Sesnon Art Gallery and celebrate UCSC’s 50th Anniversary. We have two fabulous venues for this exhibition: one on campus and one on the Westside of Santa Cruz in the former Wrigley Gum Factory Building, now an emerging arts venue.","location":"","link":"https://events.ucsc.edu/event/2730","event_instances":"1","event_date":"1423274400","thumbnail":"","description":"A fun kick-off exhibition fundraiser that will benefit the Sesnon Art Gallery and celebrate UCSC’s 50th Anniversary. We have two fabulous venues for this exhibition: one on campus and one on the Westside of Santa Cruz in the former Wrigley Gum Factory Building, now an emerging arts venue. The exhibition will feature 10 alumni artists from each decade. Hosted by Porter College Faculty Gallery and R. Blitzer Gallery in conjunction with Alumnus Tom Franco’s Co-LAB at the Sesnon Gallery."}},{"event":{"title":"Banff Mountain Film Festival World Tour","teaser":"This event, celebrating its 25th year in 2015, has been an integral part of the campus and community and is a major benefit for the Wilderness Orientation Program through the Recreation Department here at UCSC.","location":"","link":"https://events.ucsc.edu/event/2727","event_instances":"1","event_date":"1424487600","thumbnail":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Screen%20Shot%202014-12-08%20at%209.47.32%20AM.png?itok=McUVqK0D","description":"This event, celebrating its 25th year in 2015, has been an integral part of the campus and community and is a major benefit for the Wilderness Orientation Program through the Recreation Department here at UCSC. Explore exotic locations, stand on the highest peaks and be part of the gripping tales that make this year's Banff Mountain Film Festival World Tour."}},{"event":{"title":"Anita Hill: “Speaking Truth to Power: Gender and Racial Equality – 1991-2015″","teaser":"UC Presidential Chair in Feminist Critical Race & Ethnic Studies is pleased to bring Anita Hill to UC Santa Cruz for a public talk on sexual harassment law, gender and race equality.","location":"Colleges Nine/Ten Multi-purpose Room","link":"https://events.ucsc.edu/event/2671","event_instances":"1","event_date":"1425000600","thumbnail":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/anita330.jpg?itok=pci0gHMx","description":"UC Presidential Chair in Feminist Critical Race & Ethnic Studies is pleased to bring Anita Hill to UC Santa Cruz for a public talk on sexual harassment law, gender and race equality. After the talk Anita Hill will be signing copies of her book, “Reimagining Equality: Stories of Gender, Race, and Finding a Home.” There will also be a public screening of the film “Anita: Speaking Truth to Power” at the Nickelodeon Theater in Santa Cruz.\r\rTalk Description: \rIn 1991, Judge Clarence Thomas’ Senate Confirmation hearing sparked nation-wide conversations regarding gender representation, sexual harassment, and race. This lecture by Anita Hill, who testified about Thomas’ inappropriate sexual behavior in the workplace when he served as Assistant Secretary for Civil Rights in the Department of Education and Chair of the Equal Employment Opportunity Commission. In it, she explores the impact of the hearing, including the legal developments, and related issues of credibility, consent, agency, and the interplay of culture, race, class, gender, and sexuality. Drawing on history, social science and legal decisions, Professor Hill will encourage a candid dialogue about ongoing public and legal resistance to the recognition of individual civil rights, current debates around campus sexual assault and other challenges to equality in ‘post-identity’ America.\r\rFilm Screenings:\r“Anita: Speaking Truth to Power” (77 min. Documentary by Director Freida Mock) will be shown at the Nickelodeon Theater on:\rSunday, Feb 22, 2015 @ 11am\rMonday, Feb 23, 2015 @ 7pm\rFor movie tickets visit: http://www.thenick.com/comingSoon.html#coming_Anita\r\rAbout Anita Hill:\rSenior Advlsor to the Provost, Brandeis University\rProfessor of Law, Public Poticy and Women’s Studies\rHeller Graduate School of Policy and Management\rOf Counsel at Cohen, Milstein, Sellers and Toll\r\rAnita Hill was thrust into the public spotlight in 1991 when she testified before the Senate Judiciary Committee during the confirmation hearing for U.S. Supreme Court nominee, Judge Clarence Thomas. After, the hearings Ms. Hill began speaking to audiences worldwide about how to build on the great strides of women’s and civil rights struggles. She presents concrete proposals that encourage us to extend our vision of equality to include more than legal rights. Her goal is to encourage creative, equitable and posilive resolution of race, gender and class issues."}},{"event":{"title":"Seymour Center Free Day and 15th Birthday Celebration","teaser":"Experience the Seymour Marine Discovery Center's fascinating marine-life exhibits for free on Community Day –– and celebrate the Seymour Center's 15th Birthday!","location":"Seymour Marine Discovery Center","link":"https://events.ucsc.edu/event/2724","event_instances":"1","event_date":"1426093200","thumbnail":"","description":"Experience the Seymour Marine Discovery Center's fascinating marine-life exhibits for free on Community Day –– and celebrate the Seymour Center's 15th Birthday!"}},{"event":{"title":"Seymour Science Sunday and 15th Birthday Celebration","teaser":"Marine scientists bring you public lectures with photography, video, and stories of their work and lives at the Seymour Marine Discovery Center.","location":"Seymour Marine Discovery Center","link":"https://events.ucsc.edu/event/2725","event_instances":"1","event_date":"1426449600","thumbnail":"","description":"Marine scientists bring you public lectures with photography, video, and stories of their work and lives at the Seymour Marine Discovery Center."}},{"event":{"title":"The Feminist Architecture of Gloria Anzaldua: New Translations, Crossings and Pedagogies in Anzalduan Thought","teaser":"A Conference on the Work of Gloria Evangelina Anzaldua","location":"Humanities 1 Building","link":"https://events.ucsc.edu/event/2738","event_instances":"1","event_date":"1428649200","thumbnail":"","description":"A Conference on the Work of Gloria Evangelina Anzaldua\r\rGloria_AnzalduaGloria Evangelina Anzaldúa — poet, philosopher, and critical scholar — founded, wrote, and encouraged a transformative body of writing and scholarship, with generative influences on critical race, feminist, queer, and decolonizing ways of knowing. Importantly for UCSC, Anzaldúa was a vital presence on our campus for over twenty years, and her legacy is a profound part of the 50th anniversary celebrations of the campus.\r\rThe UC Presidential Chair in Feminist Critical Race and Ethnic Studies is proud to initiate a celebration of the intellectual legacy of Gloria Anzaldúa. This year-long celebration includes a series of undergraduate workshops and creative writing seminars, advanced study seminars for graduate students and faculty, performances by artists and poets as part of the creative writing Living Writers’ reading series, and an installation of Anzaldúa’s writing altar from her archives in McHenry Library’s Special Collections. Finally, our celebration will culminate in a two-day (April 10-11, 2015) scholarly conference: The Feminist Architecture of Gloria E. Anzaldúa: New Translations, Crossings, and Pedagogies in Anzaldúan Thought.\r\rPlease stay tuned for more information."}},{"event":{"title":"Views from the Hill","teaser":"The spring show at the Eloise Pickard Smith Gallery will feature works from UCSC alumni who are well recognized artists. This is an invitational show, celebrating 50 years of the arts infusing education.","location":"Cowell College","link":"https://events.ucsc.edu/event/2741","event_instances":"1","event_date":"1429315200","thumbnail":"","description":"The spring show at the Eloise Pickard Smith Gallery will feature works from UCSC alumni who are well recognized artists. This is an invitational show, celebrating 50 years of the arts infusing education."}},{"event":{"title":"KZSC Alumni Airchecks","teaser":"KZSC alums take over! We're inviting onetime Slug Radio wizards to spin some classics on the air. In our studios, you can spin some tales about KZSC and KRUZ FM. We'll document your oral history and give flashback tours of KZSC's redwood outpost.","location":"KZSC","link":"https://events.ucsc.edu/event/2689","event_instances":"1","event_date":"1429894800","thumbnail":"","description":"KZSC alums take over! We're inviting onetime Slug Radio wizards to spin some classics on the air. In our studios, you can spin some tales about KZSC and KRUZ FM. We'll document your oral history and give flashback tours of KZSC's redwood outpost."}},{"event":{"title":"11th Annual Graduate Research Symposium","teaser":"The Graduate Research Symposium highlights the innovative research being conducted by graduate students in our thirty-eight programs across five academic divisions, and celebrates the scholarly, creative, social and commercial impact they make within California and around the world!","location":"McHenry Library","link":"https://events.ucsc.edu/event/2690","event_instances":"1","event_date":"1429907400","thumbnail":"","description":"The Graduate Research Symposium highlights the innovative research being conducted by graduate students in our thirty-eight programs across five academic divisions, and celebrates the scholarly, creative, social and commercial impact they make within California and around the world! Graduate students present their specialized research to a non-specialized audience, and the Graduate Alumni Social follows the Symposium. Refreshments and appetizers will be provided while you network and re-connect with fellow Banana Slug Grads."}},{"event":{"title":"SCIPP 35th Anniversary and Reunion","teaser":"Celebrating 35 years of discovery and innovation at the Santa Cruz Institute for Particle Physics. Reunion events will include talks and discussions, a public lecture, dinner on Saturday night, lab tours, and lots of time to reconnect with friends.","location":"","link":"https://events.ucsc.edu/event/2736","event_instances":"1","event_date":"1429912800","thumbnail":"","description":"Celebrating 35 years of discovery and innovation at the Santa Cruz Institute for Particle Physics. Reunion events will include talks and discussions, a public lecture, dinner on Saturday night, lab tours, and lots of time to reconnect with friends."}},{"event":{"title":"An Uncommon Place: Shaping the UC Santa Cruz Campus","teaser":"A Conversational Exhibition and Website about the Building of UCSC","location":"Sesnon Gallery, Porter College","link":"https://events.ucsc.edu/event/2731","event_instances":"1","event_date":"1429916400","thumbnail":"","description":"**A Conversational Exhibition and Website about the Building of UCSC**\r\rThis exhibition will present an ongoing investigation of the transformation of a spectacular natural site into the one of the most cherished university campuses in the world. Beginning with the assumption that UCSC’s extraordinary physical setting and its educational vision are inseparable, the exhibition will focus on place-making and architecture as a broadly interactive process."}},{"event":{"title":"M. Sanjayan Lecture","teaser":"Alumnus M. Sanjayan (Grad Div ’97) is a conservation scientist, writer and Emmy-nominated television news contributor, specializing in the role of conservation in improving human well-being, wildlife and the environment.","location":"Music Center Recital Hall","link":"https://events.ucsc.edu/event/2691","event_instances":"1","event_date":"1429929000","thumbnail":"","description":"Alumnus M. Sanjayan (Grad Div ’97) is a conservation scientist, writer and Emmy-nominated television news contributor, specializing in the role of conservation in improving human well-being, wildlife and the environment. Sanjayan is executive vice president and senior scientist at Conservation International and host of the upcoming television series *Earth – A New Wild*, produced by National Geographic Television in association with Passion Pictures, which will air on PBS in February 2015."}},{"event":{"title":"Creation of Beauty in the Company of Friends","teaser":"Since 2011, Cowell has started alumni weekend with a symposium. 2015 will mark the 5th anniversary of that tradition and the 50th year of Cowell College.","location":"","link":"https://events.ucsc.edu/event/2694","event_instances":"1","event_date":"1429981200","thumbnail":"","description":"Since 2011, Cowell has started alumni weekend with a symposium. 2015 will mark the 5th anniversary of that tradition and the 50th year of Cowell College. Alumni and early faculty will gather in the Page Smith Library and will discuss the role of colleges in arts education and the role of the arts in the colleges."}},{"event":{"title":"Econ Alumni Reception","teaser":"We will hold an alumni reunion for our department to celebrate the 50th Anniversary of UCSC. There will be a brief introduction and short presentation followed by a continental breakfast in the courtyard where alumni, faculty, staff, and current students can mingle.","location":"","link":"https://events.ucsc.edu/event/2695","event_instances":"1","event_date":"1429981200","thumbnail":"","description":"We will hold an alumni reunion for our department to celebrate the 50th Anniversary of UCSC. There will be a brief introduction and short presentation followed by a continental breakfast in the courtyard where alumni, faculty, staff, and current students can mingle."}},{"event":{"title":"Pan-DANM-onium","teaser":"The Digital Arts and New Media (DANM) MFA Program invites the campus community to celebrate its first decade with a one-day outdoor DANM Faire featuring DANM student and alumni interactive art and maker exhibits, hands-on workshops, demonstrations, DIY competitions, and an alumni pecha kucha.","location":"Digital Arts Research Center (DARC)","link":"https://events.ucsc.edu/event/2698","event_instances":"1","event_date":"1429981200","thumbnail":"","description":"The Digital Arts and New Media (DANM) MFA Program invites the campus community to celebrate its first decade with a one-day outdoor DANM Faire featuring DANM student and alumni interactive art and maker exhibits, hands-on workshops, demonstrations, DIY competitions, and an alumni pecha kucha. This will fall on the opening day of our annual MFA exhibition and Alumni Weekend."}},{"event":{"title":"50 Years of Literature: Mini-Seminars","teaser":"From its inception as one of the original Boards of Study, the Literature Department at UC Santa Cruz has had a distinctive identity on campus as well as within the world of scholarship.","location":"Kresge Town Hall","link":"https://events.ucsc.edu/event/2692","event_instances":"1","event_date":"1429995600","thumbnail":"","description":"From its inception as one of the original Boards of Study, the Literature Department at UC Santa Cruz has had a distinctive identity on campus as well as within the world of scholarship. To celebrate our tradition of working and teaching across national, linguistic, and disciplinary divides, a series of short seminars will pair emeritus faculty with current faculty and alumni for lively, engaging conversations during Alumni Weekend."}},{"event":{"title":"Kenneth S. Norris Center for Natural History Dedication","teaser":"This dedication ceremony for the Kenneth S.","location":"Natural Sciences 2 Building and Annex","link":"https://events.ucsc.edu/event/2720","event_instances":"1","event_date":"1429995600","thumbnail":"","description":"This dedication ceremony for the Kenneth S. Norris Center for Natural History (made possible by generous support from the Packard Foundation) is an opportunity to celebrate natural history training accomplishments over the past 50 years and articulate a vision for the new Norris Center to the campus community, alumni, and other potential donors."}},{"event":{"title":"Tales as Tall as the Redwoods: Reflections on UCSC's Founding Years","teaser":"A panel of faculty and alumni will share their oral histories about UC Santa Cruz's early years. Refreshments will be provided.","location":"McHenry Library","link":"https://events.ucsc.edu/event/2721","event_instances":"1","event_date":"1429995600","thumbnail":"","description":"A panel of faculty and alumni will share their oral histories about UC Santa Cruz's early years. Refreshments will be provided."}},{"event":{"title":"From Here to Modernity","teaser":"Alumni Arts professionals present how an array of educational experiences at UCSC helped inspired five of its graduates to pursue their present careers as curators and directors at five of America’s notable art museums.","location":"Digital Arts Research Center (DARC)","link":"https://events.ucsc.edu/event/2693","event_instances":"1","event_date":"1429997400","thumbnail":"","description":"Alumni Arts professionals present how an array of educational experiences at UCSC helped inspired five of its graduates to pursue their present careers as curators and directors at five of America’s notable art museums. Panel hosted and introduced by Shelby Graham, Director of the Porter Sesnon Gallery, and moderated by Jock Reynolds (Stevenson ’69), Director of the Yale University Art Gallery, holding forth with alumni colleagues Jeremy Strick (Cowell ’77), director, Nasher Sculpture Center, Philip Brookman (Porter ’75), curator, National Gallery of Art, Karen Moss (Porter ’77), director of education and public programs, Orange County Museum of Art, and Erin O’Toole (Kresge ’92), assistant curator of photography, San Francisco Museum of Modern Art."}},{"event":{"title":"Cowell's Birthday","teaser":"Cowell was the founding college of UCSC. We will celebrate turning 50 years old with a brunch. The party will include some speeches.","location":"","link":"https://events.ucsc.edu/event/2697","event_instances":"1","event_date":"1430067600","thumbnail":"","description":"Cowell was the founding college of UCSC. We will celebrate turning 50 years old with a brunch. The party will include some speeches. Please note that the brunch was first held during alumni weekend 2011 and so this event will also mark 5 years of alumni gathering for bacon and eggs and bagels and lox on the Cowell Provost's Lawn."}},{"event":{"title":"Sounds of the Times","teaser":"The Dizikes Concert is an annual event, and it is always well attended. In light of UCSC turning 50, the songs this year will be popular songs on the hit parade in 1965-1966. Some of the songs will have surprising and revised lyrics.","location":"","link":"https://events.ucsc.edu/event/2699","event_instances":"1","event_date":"1430076600","thumbnail":"","description":"The Dizikes Concert is an annual event, and it is always well attended. In light of UCSC turning 50, the songs this year will be popular songs on the hit parade in 1965-1966. Some of the songs will have surprising and revised lyrics."}},{"event":{"title":"Celebration of Kenneth and Ann Thimann","teaser":"This celebration will honor Kenneth and Ann Thimann, the founders of Crown College with a gathering to reminiscence about them and the founding of Crown College in 1966.","location":"Crown College","link":"https://events.ucsc.edu/event/2700","event_instances":"1","event_date":"1430082000","thumbnail":"","description":"This celebration will honor Kenneth and Ann Thimann, the founders of Crown College with a gathering to reminiscence about them and the founding of Crown College in 1966."}},{"event":{"title":"80th Running of the Cardiac Pacer 5-Mile Run","teaser":"The oldest run in Santa Cruz County. Signup morning of the event only. Meet at the track at the OPERS East Field between 9:15 and 9:55am. $5/person, and the race begins at 10:00am!","location":"","link":"https://events.ucsc.edu/event/2701","event_instances":"1","event_date":"1430586000","thumbnail":"","description":"The oldest run in Santa Cruz County. Signup morning of the event only. Meet at the track at the OPERS East Field between 9:15 and 9:55am. $5/person, and the race begins at 10:00am!"}},{"event":{"title":"80th Running of the Cardiac Pacer 5 Mile Run","teaser":"Oldest Run in Santa Cruz County. This Bi-Annual race begins and ends at the East Field House Complex. 50% Pavement/50% trails. All entrants receive a specialized banana at the finish.","location":"","link":"https://events.ucsc.edu/event/2719","event_instances":"1","event_date":"1431190800","thumbnail":"","description":"Oldest Run in Santa Cruz County. This Bi-Annual race begins and ends at the East Field House Complex. 50% Pavement/50% trails. All entrants receive a specialized banana at the finish. "}},{"event":{"title":"Traditional and New Indonesian Music and Dance","teaser":"UCSC West Javanese Gamelan presents MUSIC & DANCE FROM SUNDA & CIREBON directed by Undang Sumarna, drummer UCSC Balinese Gamelan 'Swarasanti' presents KECAK, MUSIC & DANCE FROM BALI directed by Brian Baumbusch with drummer-dancer I Gedé Oka Artha Negara","location":"Music Center Recital Hall","link":"https://events.ucsc.edu/event/2743","event_instances":"1","event_date":"1431225000","thumbnail":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/undang-sakura-kelley-SQ.jpeg?itok=MRrzyCrP","description":"UCSC West Javanese Gamelan presents MUSIC & DANCE FROM SUNDA & CIREBON directed by Undang Sumarna, drummer UCSC Balinese Gamelan 'Swarasanti' presents KECAK, MUSIC & DANCE FROM BALI directed by Brian Baumbusch with drummer-dancer I Gedé Oka Artha Negara"}},{"event":{"title":"Miriam Ellis International Playhouse","teaser":"Every year language students participate in short plays in various languages which audiences enjoy with the help of Superscripts in English. 2015 will mark the 15th year of the International Playhouse performances and will coincide with major fund raising events.","location":"Stevenson Event Center","link":"https://events.ucsc.edu/event/2742","event_instances":"1","event_date":"1431658800","thumbnail":"","description":"Every year language students participate in short plays in various languages which audiences enjoy with the help of Superscripts in English. 2015 will mark the 15th year of the International Playhouse performances and will coincide with major fund raising events."}},{"event":{"title":"Emeriti Lecture Series","teaser":"“Through the Looking Glass: Revealing the ‘Other World’ of Tumor Biology with UCSC Cancer Browsers” with Josh Stuart, Assistant Professor of Bio-Molecular Engineering","location":"Arboretum","link":"https://events.ucsc.edu/event/2702","event_instances":"1","event_date":"1432233000","thumbnail":"","description":"“Through the Looking Glass: Revealing the ‘Other World’ of Tumor Biology with UCSC Cancer Browsers” with Josh Stuart, Assistant Professor of Bio-Molecular Engineering"}},{"event":{"title":"World Ocean Days","teaser":"Visit the Seymour Marine Discovery Center during its 15th anniversary year - take a tour, touch a shark, and celebrate our blue planet.","location":"Seymour Marine Discovery Center","link":"https://events.ucsc.edu/event/2726","event_instances":"1","event_date":"1433610000","thumbnail":"","description":"Visit the Seymour Marine Discovery Center during its 15th anniversary year - take a tour, touch a shark, and celebrate our blue planet."}},{"event":{"title":"Social Documentation Graduate Exhibition","teaser":"2015 will be the ten year anniversary of the Social Documentation Program, a showing of socially engaged documentary work by the graduating Master's Class of 2015","location":"","link":"https://events.ucsc.edu/event/2737","event_instances":"1","event_date":"1433984400","thumbnail":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/socdoc-delmar_crop.jpg?itok=HiDi-64D","description":"2015 will be the ten year anniversary of the Social Documentation Program, a showing of socially engaged documentary work by the graduating Master's Class of 2015"}},{"event":{"title":"Dedication of the Cowell Archives","teaser":"The McHenry Library has archives for the whole university. Cowell has archives related to events at Cowell over the last 50 years. Recently, brilliant emeritae staff Angie Christmann and Lynne Wolcott have been cataloguing all our memorabilia.  Come and view the archives!","location":"Cowell College","link":"https://events.ucsc.edu/event/2703","event_instances":"1","event_date":"1434135600","thumbnail":"","description":"The McHenry Library has archives for the whole university. Cowell has archives related to events at Cowell over the last 50 years. Recently, brilliant emeritae staff Angie Christmann and Lynne Wolcott have been cataloguing all our memorabilia.  Come and view the archives! "}},{"event":{"title":"Graduate Division Commencement","teaser":"Distinguished alumnus Joe Palca, Ph.D. 1982, Science Correspondent for National Public Radio, will deliver the commencement speech.","location":"","link":"https://events.ucsc.edu/event/2735","event_instances":"1","event_date":"1434150000","thumbnail":"","description":"Distinguished alumnus Joe Palca, Ph.D. 1982, Science Correspondent for National Public Radio, will deliver the commencement speech."}},{"event":{"title":"OPERS Fall Festival","teaser":"Held on Sept. 22, 2015, this will be the 30th Annual OPERS Fall Festival, a campus-wide Resource Fair for all new undergrad, grad, transfer and re-entry students.","location":"","link":"https://events.ucsc.edu/event/2728","event_instances":"1","event_date":"1442959200","thumbnail":"","description":"Held on Sept. 22, 2015, this will be the 30th Annual OPERS Fall Festival, a campus-wide Resource Fair for all new undergrad, grad, transfer and re-entry students. There will be over 200 tables with information on campus departments and student clubs and organizations where students can learn about the many activities, programs and services available to them. Dining Services provides a farmer's market style dinner to meal-card holders and meals can also be purchased on site. With over 5,000 participants, this is the largest Zero Waste event on campus, which is made possible through the collaborative efforts of OPERS, Physical Plant, the Sustainability Office, and Dining Services. "}},{"event":{"title":"Ken Norris Memorial Lecture","teaser":"The 2015 lecture celebrates 50 years of science at UCSC and 15 years of marine science education at the Seymour Marine Discovery Center.","location":"Seymour Marine Discovery Center","link":"https://events.ucsc.edu/event/2722","event_instances":"1","event_date":"1444960800","thumbnail":"","description":"The 2015 lecture celebrates 50 years of science at UCSC and 15 years of marine science education at the Seymour Marine Discovery Center."}},{"event":{"title":"Hand, Eye, and Mind: Art by Early UCSC Faculty","teaser":"Early faculty produced a lot of great art","location":"Cowell College","link":"https://events.ucsc.edu/event/2744","event_instances":"1","event_date":"1445040000","thumbnail":"","description":"Early faculty produced a lot of great art"}},{"event":{"title":"Seymour Science Sunday and Fall Celebration","teaser":"Marine scientists bring you public lectures with photography, video, and stories of their work and lives. This special Science Sunday caps off the Seymour Center's 15th anniversary year.","location":"Seymour Marine Discovery Center","link":"https://events.ucsc.edu/event/2723","event_instances":"1","event_date":"1445198400","thumbnail":"","description":"Marine scientists bring you public lectures with photography, video, and stories of their work and lives. This special Science Sunday caps off the Seymour Center's 15th anniversary year."}}]}