{"events":[{"event":{"title":"Call For Music Video Participants!","teaser":"Attention Banana Slugs! We're making a special music video to celebrate our 50th anniversary and we want you to be in it! We're going to be dancing around and having fun to your fellow alumni, Brett Dennon's tune: \"When We Were Young\". Come help us celebrate turning 50!","location":"","location_details":"","link":"https://events.ucsc.edu/event/2682","event_instances":"1","event_date":"1416943800","thumbnail":"","description":"**Attention Banana Slugs!** We're making a special music video to celebrate our 50th anniversary and we want you to be in it! We're going to be dancing around and having fun to your fellow alumni, Brett Dennon's tune: \"When We Were Young\". Come help us celebrate turning 50! *There are multiple times and locations for this event:*\r\r**Tuesday, Nov 25: 11:30AM at Quarry Plaza** and also at **3:30 PM in front of the Science Library**\r\remail : earvizu@ucsc.edu for more details and future dates\r\r "}},{"event":{"title":"UC Santa Cruz Hackathon","teaser":"The second UC Santa Cruz hackathon was a huge success. Read all about the event at Santa Cruz Tech Beatwww.hackucsc.com","location":"Merrill Cultural Center","location_details":"","link":"https://events.ucsc.edu/event/2754","event_instances":"3","event_date":"1420790400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/hackathon-words.png?itok=or-hxUVz","alt":""},"description":"The second UC Santa Cruz hackathon was a huge success. Read all about the event at [Santa Cruz Tech Beat](www.santacruztechbeat.com/2015/01/12/results-ucsc-hackathon-winners \"Santa Crua Tech Beat\") \r\r\rwww.hackucsc.com\r"}},{"event":{"title":"Emeriti Lecture Series","teaser":"Open to Emeriti Association members ONLY: “Looking for Santa Cruz’s First Municipal Water System” a lecture by  Melanie Mayer, Professor Emerita Psychology.","location":"Arboretum","location_details":"","link":"https://events.ucsc.edu/event/2684","event_instances":"1","event_date":"1421350200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/mjmayer.jpg?itok=Sh1G-ZhE","alt":""},"description":"Open to Emeriti Association members ONLY: “Looking for Santa Cruz’s First Municipal Water System” a lecture by  Melanie Mayer, Professor Emerita Psychology."}},{"event":{"title":"Campus Kick-Off: Dress Like 1965 Day!","teaser":"The campus kick-off was a blast. Check out the content winners and photo gallery.","location":"Quarry Plaza","location_details":"","link":"https://events.ucsc.edu/event/2683","event_instances":"1","event_date":"1421352000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/ms0090_pho_0013.jpg?itok=2rQahQdz","alt":""},"description":"The campus kick-off was a blast. Check out the [content winners and photo gallery](http://50years.ucsc.edu/kick-off/).\r\r### Event overview\r\"Mad Men\" costume designer and alumna Tiffany White Stanton (Kresge '03, psychology) will prepare advice and tips to give you the perfect look. Dress up and then show up at Quarry Plaza to be photographed so she can determine who has the most authentic 1965 costume."}},{"event":{"title":"Our Disappearing Microbes - Dr. Martin Blaser","teaser":"Come celebrate 15- and 50-year anniversaries with the Microbiology and Environmental Toxicology (METX) Department at UC Santa Cruz.","location":"","location_details":"Rio Theatre, Santa Cruz","link":"https://events.ucsc.edu/event/2676","event_instances":"1","event_date":"1421377200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/martin-blaser.jpg?itok=n3L-hnAW","alt":""},"description":"Come celebrate 15- and 50-year anniversaries with the Microbiology and Environmental Toxicology (METX) Department at UC Santa Cruz. \r\rIn honor of the METX Department's 15th anniversary and UC Santa Cruz's 50th anniversary we invite you to attend this free public lecture and book signing with the renowned Dr. Martin Blaser."}},{"event":{"title":"8th Annual Santa Cruz Chocolate Festival","teaser":"The 8th annual Santa Cruz Chocolate Festival, hosted by the UC Santa Cruz Women's Club will again be held at the beautiful Cocoanut Grove on the Santa Cruz Beach Boardwalk, Sunday, January 18, 2015 from 1-4 pm.Nominations and voting for Chocoholic-of-the-Year will be in January.","location":"","location_details":"The Cocoanut Grove at the Santa Cruz Beach BoardwalkDirections and Parking:The Cocoanut Grove is about a 75-minute drive from San Francisco, 45 minutes from the Monterey/Carmel area, and 30 minutes from the San Jose area.To get to the Cocoanut Grove, take Highway 17 or scenic Highway 1 to Santa Cruz and follow the street signs to Santa Cruz Beach.Parking is available at the venue. Parking is free if the Boardwalk is closed due to weather. There is a cost for parking if the Boardwalk is open.","link":"https://events.ucsc.edu/event/2663","event_instances":"1","event_date":"1421614800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/15764860366_803fe4f21b_z.jpg?itok=Ns1kDjvD","alt":""},"description":"The 8th annual Santa Cruz Chocolate Festival, hosted by the UC Santa Cruz Women's Club will again be held at the beautiful Cocoanut Grove on the Santa Cruz Beach Boardwalk, Sunday, January 18, 2015 from 1-4 pm.\r\r\rNominations and voting for Chocoholic-of-the-Year will be in January.\r\rPurchase tickets online and avoid waiting in line. \r\rYou can purchase tasting tickets, souvenir glasses for wine tasting, cupcake decorating tickets and Chocolate Festival aprons. You can also donate directly to the scholarship fund. Tickets are also available to purchase the day of the festival as long as supplies last.\r\rPurchases made BEFORE January 1, 2015 will receive in your will call envelope a $20 gift card from Cococlectic, a craft Bean-to-Bar club. For more information about this amazing offer, go to www.cococlectic.com\r\rAt the festival, you will also enjoy browsing and purchasing gifts from the amazing silent auction, trying your hand at cupcake decorating (for the young at heart), and listening to soft and enchanting jazz music. It will all round out a beautiful afternoon of fun and chocolate goodness.\r\rNet proceeds from this event are used to help fund scholarships for deserving re-entry students.\r\rTasting tickets are $15 for six tastes (online or in person).\rWine glass and one taste - $5\rCupcake decorating - $4\rFace painting - $4\r\rGenerous contributions from donors and members make it possible for the Women's Club to continue to support scholarships for future generations\r\rSupport us by making an additional contribution or by becoming a member.\rAll proceeds will go to support re-entry scholarships."}},{"event":{"title":"50th anniversary: Remembrance of UC Santa Cruz founding Chancellor Dean McHenry","teaser":"\"Memories of Dean and Jane McHenry and the Beginning of UC Santa Cruz,\" a remembrance at the UC Santa Cruz Arboretum.Program:“The Bear Comes over the Mountain: Dean McHenry Arrives”Hal Hyde, Founding Vice Chancellor, Business and Finance, UCSC","location":"Arboretum","location_details":"UC Santa Cruz Arboretum","link":"https://events.ucsc.edu/event/2796","event_instances":"1","event_date":"1422392400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/mchenry.09-01-03.240.jpg?itok=AFUHEIXy","alt":""},"description":"\"Memories of Dean and Jane McHenry and the Beginning of UC Santa Cruz,\" a remembrance at the UC Santa Cruz Arboretum. \r\r\rProgram:\r“The Bear Comes over the Mountain: Dean McHenry Arrives”Hal Hyde, Founding Vice Chancellor, Business and Finance, UCSC\r\r\"Memories of Dean and Jane McHenry\"Bill Doyle, Member of the founding faculty of UCSC and Cowell College, \r\r\"My Remembrance of Dean\" Stanley Stevens, Map Librarian 1965-1993, Coordinator, Hihn-Younger Archives, Special Collections.\r\r\"Dean McHenry Confronts a Revolution...in the Dorms\" David Kaun, Emeritus Professor in Economics, founding member of Stevenson College, and its Provost 1981-1985\r\r“Jane and Dean McHenry, a Bi-Coastal Reflection” Herman Blake,  Founding Provost of  Oakes College 1972-1984 Executive Director, Gullah Geechee Cultural Heritage Corridor Commission. Blake’s tribute will be read by Chancellor Blumenthal.\r\rShort Intermission with photos of Jane and Dean McHenry  \r\r“UCSC Beginning's Perspectives: Myth or Reality\"\rDan Aldrich, Assistant Chancellor for University Relation 1980-1998.\r\r“ Some recollections of Dean McHenry’s prodigious memory”.John Faulkner,  Emeritus Professor  of Astronomy and Astrophysics Crown College\r\r\"Dean McHenry, Community Studies, and Academic Freedom\". Bill Friedland, Emeritus faculty in Community Studies and Sociology     Stevenson College\r\rConclusion:\r\rYou are invited to celebrate Dean and Jane with a glass of McHenry Pinot Noir.\r"}},{"event":{"title":"Questions that Matter: Making The Cosmos Local","teaser":"This series brings together UC Santa Cruz scholars with community members to explore questions that matter to all of us. We invite you to join us on January 27, 2015 for the series launch at the Kuumbwa Jazz Center.","location":"","location_details":"Kuumbwa Jazz Center320 Cedar StSanta Cruz, CA 95060","link":"https://events.ucsc.edu/event/2672","event_instances":"1","event_date":"1422410400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Cosmos%203.jpg?itok=yqFLMqe3","alt":""},"description":"This series brings together UC Santa Cruz scholars with community members to explore questions that matter to all of us. We invite you to join us on January 27, 2015 for the series launch at the Kuumbwa Jazz Center.\r\r*If you missed out! Video, podcast, and photos can be found at: [ihr.ucsc.edu/cosmos/](http://ihr.ucsc.edu/cosmos/)*\r\r**Featuring:** Minghui Hu (History) and Anthony Aguirre (Physics)\rFacilitated by: Nathaniel Deutsch (IHR Director)\r\r**Join the conversation at #ihrevents #ucsc50**\r\rFor millennia, people across the globe have searched the sky for answers. They have imagined and reimagined the cosmos, from an infinite and eternal backdrop full of other worlds, to a young Earth encircled by nearby planets and crystal spheres of stars. What is the relation between our lives here on Earth and the wider realm of nearby planets, distant stars, unfathomably faraway galaxies, and a potentially infinite universe—or swarm of universes? Where do we find, or create, meaning in such a picture?\r\rPlease join us for an evening of conversation and connection as we bring these questions down to earth and make the cosmos local.\r\r**This UCSC 50th Anniversary Event is presented by** the Institute for Humanities Research in partnership with Bookshop Santa Cruz and the Kuumbwa Jazz Center.\r"}},{"event":{"title":"31st Annual Martin Luther King, Jr. Convocation featuring Angela Davis","teaser":"Please join us for the 2015 Martin Luther King, Jr. Convocation featuring Angela Y. Davis.","location":"","location_details":"Santa Cruz Civic Auditorium307 Church StreetSanta Cruz, CA 95060","link":"https://events.ucsc.edu/event/2705","event_instances":"1","event_date":"1422500400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/DAVIScolor-1.jpg?itok=6WoyJbjB","alt":""},"description":"Please join us for the 2015 Martin Luther King, Jr. Convocation featuring Angela Y. Davis. \r\rAngela Davis is a distinguished professor emerita of History of Consciousness and Feminist Studies at UC Santa Cruz, and the author of nine books, including her most recent book of essays called, \"The Meaning of Freedom.\" \r\rThrough her activism and scholarship over the last decades, Angela Davis has been deeply involved in our nation’s quest for social justice.  Her work as an educator – both at the university level and in the larger public sphere – has always emphasized the importance of building communities of struggle for economic, racial, and gender equality. Her talk is titled, \"Racism, Militarism, Poverty: From Ferguson to Palestine.\"\r\rFeaturing vocal performance by singer and songwriter, Alexis Rose. Plus presentation of the 7th annual Tony Hill Memorial Award. \r\rQuestions? Please contact the UC Santa Cruz Special Events Office at 831-459-5003 or email specialevents@ucsc.edu. \r"}},{"event":{"title":"Three Generations of Smiths","teaser":"Page Smith was the founding provost of Cowell College and a pioneer of UC Santa Cruz. His wife Eloise supported the arts in the colleges.","location":"Cowell College","location_details":"Eloise Pickard Smith Gallery","link":"https://events.ucsc.edu/event/2708","event_instances":"1","event_date":"1422666000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/smith_page.97-11-03.gif?itok=6Wns5nkD","alt":""},"description":"Page Smith was the founding provost of Cowell College and a pioneer of UC Santa Cruz. His wife Eloise supported the arts in the colleges.\r\rThe winter show in the Eloise Pickard Smith Gallery will feature the paintings of Eloise, the fabrics of her son Carter, and the drawings of her granddaughter Sara."}},{"event":{"title":"Celebrating Page and Eloise Smith","teaser":"As part of UC Santa Cruz's 50th anniversary, Cowell College is hosting a day-long celebration of Page and Eloise, on Saturday, January 31, 2015.","location":"Stevenson Event Center","location_details":"","link":"https://events.ucsc.edu/event/2740","event_instances":"1","event_date":"1422723600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/page-eloise-smith.gif?itok=RCtxljWE","alt":"Page and Eloise Smith"},"description":"As part of UC Santa Cruz's 50th anniversary, Cowell College is hosting a day-long celebration of Page and Eloise, on Saturday, January 31, 2015.  We will share memories about their time with us, learn more about what they did after we graduated, reflect on their legacy, catch up with old friends and classmates, and meet some of today's students. \r \rInspired by Cowell's motto, \"the pursuit of truth in the company of friends\", the day is designed to create the sort of spiritual communal gathering with which the Smiths made us familiar when we were young. \r \rWe will convene at 9:00 am in the former Stevenson dining hall, with time to connect with each other over lunch, and opportunities during the day to view special exhibits in the Eloise Pickard Smith Gallery, Senior Common Room, and Provost House. The day will conclude with a social hour at 4:30 ​pm, and, for those who wish to continue to savor the moment, an informal dinner at 6:00 pm.\r\r[See the public attendee list here](http://connect.ucsc.edu/s/1069/index.aspx?sid=1069&gid=1&pgid=1692&cid=3203&fid=3202).\r\rFor more information visit http://cowell.ucsc.edu/alumni/smith-day/ or contact cof@ucsc.edu.\r "}},{"event":{"title":"Tom Franco Co-Lab: Reception and Lecture","teaser":"Join us for a gallery opening from 5:00pm - 7:30pm, followed by alumnus Tom Franco's lecture, The Artist Community Collaborative Experience from 7:30pm - 8:30pm.","location":"Sesnon Gallery, Porter College","location_details":"Reception: Porter Faculty Gallery-2nd Floor, Porter College (UCSC)Lecture: Music Center Recital Hall","link":"https://events.ucsc.edu/event/2749","event_instances":"1","event_date":"1423184400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/TomFrancoImage.jpeg?itok=mDEJiZTf","alt":""},"description":"Join us for a gallery opening from 5:00pm - 7:30pm, followed by alumnus **Tom Franco's** lecture, *The Artist Community Collaborative Experience* from 7:30pm - 8:30pm. \r\r*The reception is in the Sesnon Gallery at Porter College; the lecture is in the Music Center Recital Hall.*\r\rUC Santa Cruz alumnus **Tom Franco** (Porter '02) is co-founder of the **Firehouse Art Collective**, a pioneering project that is changing the arts community in the East Bay and is a compelling example of how UC Santa Cruz graduates are truly original. Franco has invested in a collection of buildings and spaces that promotes collaboration and community. The collective, spread throughout the East Bay, has live-work housing, studios, cafes, galleries, and event and performance spaces. This open platform and participatory style is being adopted and practiced by galleries and museums around the world.\r\rThe exhibition will be part of a Porter College course taught by Shelby Graham with Tom Franco. The project will cultivate a creative community through collaborative exhibition format, community open mic events, performance collectives, discussions, and workshops at the Sesnon Art Gallery.\r\rUC Santa Cruz students will showcase their collaboration with Franco. Students are playing an active role in the exhibition on all levels and will announce their program of special events taking place throughout the winter quarter at the Sesnon Gallery.\r\r\r**Gallery hours:**\rTuesday–Saturday, 12–5 p.m.\rWednesdays 12-8 p.m. \rClosed for all University holidays  \r\r**Parking:** \rParking permit $3 ($4 when attendants are present)"}},{"event":{"title":"50/50: 50 Artists from 5 Decades (Opening Receptions and Exhibits)","teaser":"Please join us as the Arts Division kicks off our celebration of UC Santa Cruz’s 50th Anniversary with two opening receptions for 50/50: 50 Artists from 5 Decades.","location":"Porter College","location_details":"Porter Faculty Gallery-2nd Floor, Porter College (UC Santa Cruz campus)R. Blitzer Gallery, 2801 Mission Street, Santa Cruz","link":"https://events.ucsc.edu/event/2750","event_instances":"1","event_date":"1423184400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/50_50_thumbnail_0.jpg?itok=qDqZASqU","alt":""},"description":"Please join us as the Arts Division kicks off our celebration of UC Santa Cruz’s 50th Anniversary with two opening receptions for 50/50: 50 Artists from 5 Decades.\rhttp://art.ucsc.edu/galleries/5050-ucsc-alumni-exhibition\r\rThe exhibition features work by alumni artists from Santa Cruz to New York City in the Faculty Gallery at UCSC’s Porter College, and at the R. Blitzer Gallery in Santa Cruz on the Westside. We thank all the artists, University Relations, and private donors for their support.\r\r**Thursday, Feb. 5th, 5:00pm - 7:30pm:** Opening reception at the Sesnon Gallery (also the opening reception for alumnus Tom Franco's Co-Lab exhibit)\r\r**Friday, Feb. 6th, 6:00pm - 9:00pm:** First Friday at the R. Blitzer Gallery \r\r\r**Exhibition Dates - Porter Faculty Gallery**\rFebruary 5 - February 28, 2015\r\r**Gallery Hours:**\r**Porter Sesnon Gallery**\rTuesday-Saturday, 12-5 PM\rextended hours on Wednesdays until 8 PM.\rInfo at sesnon@ucsc.edu or 831-459-3606.\r\r**R. Blitzer Gallery**\rTuesday-Saturday, 11-5 PM\rhttp://rblitzergallery.com\r\r**Parking:**\rParking permit $3 ($4 when attendants are present) in the Performing Arts Complex; street parking near the R. Blitzer Gallery\r\rPhoto credit: Charley Stern"}},{"event":{"title":"Random Magnets and Quantum Information","teaser":"Jack Baskin Auditorium 101","location":"","location_details":"Jack Baskin Auditorium 101","link":"https://events.ucsc.edu/event/2873","event_instances":"1","event_date":"1423328400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Screen%20Shot%202015-01-22%20at%2010.29.41%20AM.png?itok=pqOL0ggK","alt":""},"description":"Jack Baskin Auditorium 101\r\rPeter Young has recently announced his retirement after a distinguished career at UCSC for over 3 decades. In Peter’s honor we will hold a conference at UCSC on Random Magnets and Quantum Information- the domain of most of his activities over these years. The  the conference will be held on February 7th and 8th , 2015. Please join us in celebrating his impressive achievements in these areas."}},{"event":{"title":"Banff Mountain Film Festival World Tour","teaser":"This event, celebrating its 25th year in 2015, has been an integral part of the campus and community and is a major benefit for the Wilderness Orientation Program through the Recreation Department here at UCSC.","location":"","location_details":"Rio Theater1205 Soquel AveSanta Cruz, CA 95062","link":"https://events.ucsc.edu/event/2727","event_instances":"3","event_date":"1424487600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Screen%20Shot%202014-12-08%20at%209.47.32%20AM.png?itok=eb1gtUhz","alt":""},"description":"This event, celebrating its 25th year in 2015, has been an integral part of the campus and community and is a major benefit for the Wilderness Orientation Program through the Recreation Department here at UCSC. Explore exotic locations, stand on the highest peaks and be part of the gripping tales that make this year's Banff Mountain Film Festival World Tour."}},{"event":{"title":"'On the Tides': the book and physics that sank Galileo","teaser":"John Heilbron describes Galileo's tidal physics and similar \"marvels\" presented in the Dialogue.The working title of the book we know as the Dialogue Concerning the \"Two Chief World Systems\" (1632) was \"On the Tides.\"","location":"","location_details":"Thimann Auditorium 1","link":"https://events.ucsc.edu/event/2801","event_instances":"1","event_date":"1424995200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/heilbrongalileo.jpg?itok=r45cQTV_","alt":""},"description":"John Heilbron describes Galileo's tidal physics and similar \"marvels\" presented in the Dialogue.\r\rThe working title of the book we know as the Dialogue Concerning the \"Two Chief World Systems\" (1632) was \"On the Tides.\"\r\rWhen Galileo was finishing it, most interested persons in Rome knew he believed that he had found a strong, if not a decisive, argument for the Copernican system in the existence of tides. The Pope did not accept the argument and insisted that Galileo not mention the tides in the title lest unwary readers think that physics could prove the truth of the Copernican theory or of anything else.\r\rThe talk will describe Galileo's tidal physics and similar \"marvels\" (as he called them) presented in the Dialogue and concludes that they would not have passed peer review had there been any. This, however, was not the reason the Inquisition sentenced Galileo to perpetual imprisonment.\r\r\rSpeaker: John Heilbron"}},{"event":{"title":"Anita Hill: “Speaking Truth to Power: Gender and Racial Equality – 1991-2015″","teaser":"Anita Hill spoke to a full room of 450 and another 300 people heard her via simulcast in a nearby classroom.","location":"Colleges Nine/Ten Multi-purpose Room","location_details":"Printable map","link":"https://events.ucsc.edu/event/2671","event_instances":"1","event_date":"1425000600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/AHill_Pstcrd_front_webfinal.jpg?itok=qQ-ahwD5","alt":""},"description":"\r Anita Hill spoke to a full room of 450 and another 300 people heard her via simulcast in a nearby classroom. See photos of the even here:http://ihr.ucsc.edu/anita-hill/?utm_source=Event+Snapshot+-+Spring+2015&utm_campaign=Feb+23+2015+Weekly+Snapshot&utm_medium=email  \r\r\r\r\r\r\rAnita Hill visits UC Santa Cruz to speak on resistance to individual civil rights, campus sexual assault debates, why black lives matter, and challenges to equality in ‘post-identity’ America. Join the conversation at [#ihrevents](https://twitter.com/hashtag/ihrevents?src=hash \"#ihrevents\") [#ucsc50](https://twitter.com/hashtag/ucsc50?src=hash \"#ucsc50\") [Facebook](https://www.facebook.com/events/776370975776293/ \"Facebook\")\r\rFEBRUARY 26, 2015 \rUC SANTA CRUZ COLLEGE 9/10 MULTI-PURPOSE ROOM\r\rMore info: http://ihr.ucsc.edu/anita-hill\r\r5:30pm Doors Open | 6pm Program | 7:30pm Book signing\r\rLimited seating is first-come first-serve. Free and open to the public. $4 parking and shuttles available at Core West Parking Structure ([map](http://ihr.ucsc.edu/wp-content/uploads/2015/02/Map-Anita-Hill-Event-Parking-Directions-.jpg \"map\")). \r\rOverflow simulcast in Humanities Lecture Hall. Live broadcast on KZSC 88.1 FM and www.kzsc.org.\r\rUC Presidential Chair in Feminist Critical Race & Ethnic Studies is pleased to bring Anita Hill to UC Santa Cruz for a candid dialogue. After the talk Ms. Hill will be signing copies of her book, “Reimagining Equality: Stories of Gender, Race, and Finding a Home” (books will be sold at the event by Bookshop Santa Cruz). There will also be a public screening of the film “Anita: Speaking Truth to Power” at the Nickelodeon Theater in Santa Cruz  and a campus film screening with a panel on campus sexual harassment issues.\r\r**Public Film Screenings:**\rFilm screenings of the documentary “Anita: Speaking Truth to Power” at the Nickelodeon Theater on Sunday, Feb 22 at 11am and Monday, Feb 23 at 7pm (Tickets: www.thenick.com). Campus film screening with a panel on campus sexual harassment issues on Feb 24 at 7:30pm at the UCSC Humanities Lecture Hall.\r\r**Public Lecture Description:**\rIn 1991, the Senate confirmation hearings for Clarence Thomas, nominated to the U.S. Supreme Court, sparked nation-wide conversations regarding gender representation, sexual harassment, and race. Anita Hill testified about Thomas' inappropriate sexual behavior in the workplace when he served as Assistant Secretary for Civil Rights in the Department of Education and Chair of the Equal Employment Opportunity Commission. Her testimony before a television audience of 22 million put the issues of sexual harassment on the national agenda. In her lecture, she will explore the impact of the hearing, including the legal developments, and related issues of credibility, consent, agency, and the interplay of culture, race, class, gender, and sexuality. \r\r**This UCSC 50th Anniversary Event is sponsored by:**\rUC Presidential Chair in Feminist Critical Race & Ethnic Studies, Dean of Students, Humanities Division, Social Sciences Division, Arts Division, Institute for Humanities Research, Bookshop Santa Cruz.\r\r**Questions:**\rFor information and disability accommodations, please contact ihr@ucsc.edu or 831-459-5655. ASL interpreters will be provided."}},{"event":{"title":"Mixed Media Mixer","teaser":"Tom Franco Co Labwith Alumnus Tom Franco + Firehouse Art Collective + UCSC students + alumniLive art! Live music! Mixed Media Mixing!Music schedule (6-10pm):","location":"Sesnon Gallery, Porter College","location_details":"","link":"https://events.ucsc.edu/event/2955","event_instances":"1","event_date":"1425002400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/TomFrancoCoLab-7559-crop.jpg?itok=wIYTtaFM","alt":"Mixed-Media"},"description":"Tom Franco Co Lab\r\rwith Alumnus Tom Franco + Firehouse Art Collective + UCSC students + alumni \rLive art! Live music! Mixed Media Mixing! \r\rMusic schedule (6-10pm):\r\r6:00 Lea Grant\r6:45 Tay Gersbach\r7:30 Chloé and The Giant Peach\r8:15 Salt & Sage\r8:45 Hannah Werdmuller\r9:15 Chonk!\r\r\rArtists from the Bay:\rTay Gersbach (Instruments and Odd Objects)\rErik Walker (Illustration and Odd objects)\rEl Maldito (Painting and Drawing)\rOmar Ramirez (Printmaking)\rDani Robison (Glass and Mosaics)\rShervin Rostami (Drawings and Illustrations)"}},{"event":{"title":"No Prospect of an End: Living with an Ever Changing Climate","teaser":"The Divisions of Physical & Biological Sciences and Social Sciences are proud to announce The Second Annual UCSC Climate  & Policy Conference.  The dates of the conference are Friday March 13th-Saturday March 14th.","location":"Colleges Nine/Ten Multi-purpose Room","location_details":"","link":"https://events.ucsc.edu/event/2662","event_instances":"1","event_date":"1426300200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Climate%26Policy_Poster%20%281%29.jpg?itok=SBsx4Ufz","alt":""},"description":"The Divisions of Physical & Biological Sciences and Social Sciences are proud to announce The Second Annual UCSC Climate  & Policy Conference.  The dates of the conference are Friday March 13th-Saturday March 14th.\r\rOur overarching theme this year is “No Prospect of an End”: Living with an Ever Changing Climate. The quote from James Hutton’s Theory of the Earth is not meant to be depressing. Rather, we want to remind (or enlighten) audience members that if we do not dramatically reduce greenhouse gas emissions, we may trigger a rapid shift in climate that might not slow for a millennium, and that those new hot conditions might last many tens of millennia. From a societal perspective, climate change would seem never ending, and predicting environmental conditions in that future “hot house” world will be very difficult.\r\rThe Friday night lecture to kick off the event will feature eminent geologist Richard Alley (Penn State).  Alley is renown for his work on glaciers, abrupt climate change, and sea level.\r\rFollowing Friday's lecture, on Saturday will be a day-long 2-part panel discussion, the core of the conference. Panelists include climate scientists, civil servants, economists, and educators from across the country.\r\rThe morning Panel will focus on Coastal Resilience: Weathering the Coming Storm \r\rThe afternoon panel's focus is Wicked Solutions: Unavoidable Tradeoffs between Food, Water, Energy, and Biodiversity.  \r\rWe anticipate many lively discussions as we have the panelist interact with the audience (We expect a sell-out crowd)\r"}},{"event":{"title":"Science Sunday: Making Mummies Talk","teaser":"Science Sunday: Making Mummies TalkUsing fossils to understand how seals will respond to environmental changePaul Koch, Ph.D.Dean, Physical and Biological SciencesProfessor, Earth and Planetary SciencesUC Santa Cruz","location":"Seymour Marine Discovery Center","location_details":"","link":"https://events.ucsc.edu/event/2963","event_instances":"1","event_date":"1426449600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Screen-shot-2015-02-26-at-11.18.16-AM.png?itok=o1bAu827","alt":""},"description":"**Science Sunday: Making Mummies Talk**\r*Using fossils to understand how seals will respond to environmental change*\rPaul Koch, Ph.D.\rDean, Physical and Biological Sciences\rProfessor, Earth and Planetary Sciences\rUC Santa Cruz\r\rUnderstanding how animals responded to environmental shifts in the past may offer important clues as to how they will deal with the challenges of the coming centuries. Mummies are an especially rich source of information. Beyond just letting us know who lived where in the past, they provide information on population size, body condition, reproductive traits, and feeding preferences as revealed by studies of anatomy,ancient DNA, and forensic chemistry.\r\rThe frigid, dry climates of Antarctica are especially conducive to natural mummification of animals. Large numbers of seals have wandered into the Dry Valleys of Antarctica where they perished and now dot the landscape as mummies that can be sampled for studies of past ecology.\r\rKoch will discuss his work on mummies to understand the ecology of the seals that lived in the Ross Sea of Antarctica over the past 8,000 years, and how insights gained from study of mummies might be important for conservation of the species in the future.\r\rLecture is free with admission. Recommended for ages 10 and older. \r\r*Doors open to the lecture hall at 12:30 PM. Lecture passes are available at the admissions counter at noon. Seating is limited and first-come, first-served. No late seating.*"}},{"event":{"title":"\"An Uncommon Place: Celebrating 50 Years of Building UC Santa Cruz\" (Los Angeles Event)","teaser":"An Uncommon Place: Celebrating 50 Years of Building UC Santa Cruzwith Campus Architect Emeritus Frank Zwart, Cowell '71at Seasons 52 in Century CitySunday, March 152:00 p.m. – 4:00 p.m.","location":"","location_details":"Seasons 52 in Century City10250 Santa Monica Blvd.Los Angeles, CA  90067","link":"https://events.ucsc.edu/event/2950","event_instances":"1","event_date":"1426453200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Central%20Service%20Bridge%20ua0050_neg_00351b_03.jpg?itok=UM0Du8WL","alt":"Central Service Bridge"},"description":"An Uncommon Place: Celebrating 50 Years of Building UC Santa Cruz\rwith Campus Architect Emeritus Frank Zwart, Cowell '71\rat Seasons 52 in Century City\rSunday, March 15\r2:00 p.m. – 4:00 p.m.\r\rJoin us as we make a toast to our beloved university's 50 amazing years! Hear from Campus Architect Emeritus and Cowell '71 alumnus, Frank Zwart, about UC Santa Cruz's early days and the concepts that went into building our beautiful campus.\r\rThis event is free of charge. Light appetizers, cake, and champagne will be served.\r\rDon't miss this opportunity to meet other Los Angeles Banana Slugs, learn about UC Santa Cruz's past, present, and future, and celebrate the 50th anniversary!\r\rFor more information about 50th anniversary events, go to 50years.ucsc.edu.\r\rQuestions about the event? Contact Samantha Li at sakli@ucsc.edu or (831) 459-4631. "}},{"event":{"title":"East Bay Alumni Volunteer Service Day","teaser":"Lend a helping hand...UC Santa Cruz Alumni Volunteer Service Dayat MLK Jr. Shoreline Park in OaklandSaturday, March 219:30 a.m. – 12:30 p.m.","location":"","location_details":"MLK Jr. Shoreline Park in Oakland","link":"https://events.ucsc.edu/event/2951","event_instances":"1","event_date":"1426955400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/audubon.jpg?itok=p7MRIbf0","alt":"Golden Gate Audubon Society"},"description":"Lend a helping hand...\r\rUC Santa Cruz Alumni Volunteer Service Day\rat MLK Jr. Shoreline Park in Oakland\rSaturday, March 21\r9:30 a.m. – 12:30 p.m.\r\rWhen you were a student at UC Santa Cruz, the campus's core values of public service, social justice, and civic engagement became as much a part of you as the learning you were immersed in. As an alum, those values have become your own--and we invite you to an opportunity to express them with a day of service and fun!\r\rJoin us in our first East Bay Alumni Volunteer Service Day with the Golden Gate Audubon Society! We will be planting and tending to native plants that provide habitat to birds and other wildlife. Together, we will be working to protect sensitive natural habitat. \r\rThis is a great opportunity to meet other Santa Cruz Banana Slugs and continue the spirit of UC Santa Cruz by supporting the local community. We look forward to seeing you there!\r\rQuestions? Contact Samantha Li at sakli@ucsc.edu or (831) 459-4631. "}},{"event":{"title":"\"An Uncommon Place: Celebrating 50 Years of Building UC Santa Cruz\" (Santa Clara Event)","teaser":"An Uncommon Place: Celebrating 50 Years of Building UC Santa Cruzwith Campus Architect Emeritus Frank Zwart, Cowell '71at UCSC ExtensionThursday, March 266:00 p.m. – 7:45 p.m.","location":"","location_details":"UCSC Silicon Valley Extension2505 Augustine DriveSanta Clara, CA 95054","link":"https://events.ucsc.edu/event/2952","event_instances":"1","event_date":"1427418000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Central%20Service%20Bridge%20ua0050_neg_00351b_03_0.jpg?itok=4Psm0lje","alt":"Central Service Bridge"},"description":"An Uncommon Place: Celebrating 50 Years of Building UC Santa Cruz\rwith Campus Architect Emeritus Frank Zwart, Cowell '71\rat UCSC Extension\rThursday, March 26\r6:00 p.m. – 7:45 p.m.\r\rJoin us as we make a toast to our beloved university's 50 amazing years! Hear from Campus Architect Emeritus and Cowell '71 alumnus, Frank Zwart, about UC Santa Cruz's early days and the concepts that went into building our beautiful campus.\r\rThis event is free of charge. Light appetizers, cake, and champagne will be served.\r\rDon't miss this opportunity to meet other Silicon Valley Banana Slugs, learn about UC Santa Cruz's past, present, and future, and celebrate the 50th anniversary!\r\rFor more information about 50th anniversary events, go to 50years.ucsc.edu.\r\rQuestions about the event? Contact Samantha Li at sakli@ucsc.edu or (831) 459-4631. "}},{"event":{"title":"Cesar Chavez Volunteer Service Day","teaser":"UC Santa Cruz Alumni Volunteer Service Dayat the Homeless Garden Project Natural Bridges FarmSaturday, March 2810:00 a.m. – 2:00 p.m.","location":"","location_details":"Homeless Garden ProjectShaffer Road off Delaware Ave.Santa Cruz","link":"https://events.ucsc.edu/event/2948","event_instances":"1","event_date":"1427562000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/hgpimage.jpg?itok=zhk9rGLW","alt":"Homeless Garden Project"},"description":"UC Santa Cruz Alumni Volunteer Service Day\rat the Homeless Garden Project Natural Bridges Farm\rSaturday, March 28\r10:00 a.m. – 2:00 p.m.\r\rJoin us at our Cesar Chavez Volunteer Service Day in collaboration with the Homeless Garden Project, the Santa Cruz Volunteer Center, and Mayor Don Lane's new campaign, Charter for Compassion, as we prepare the beds and plant the seeds to start growing in the spring!\r\rThis is a great opportunity to meet other Santa Cruz Banana Slugs and continue the spirit of UC Santa Cruz by supporting the local community.\r\rLunch, beverages, and snacks will be provided. We look forward to seeing you there!\r\rQuestions? Contact Samantha Li at sakli@ucsc.edu or (831) 459-4631. \r"}},{"event":{"title":"Linguistics@SantaCruz: Theory and Practice","teaser":"There will be talks, discussions, photos, and interactive demonstrations illustrating the history and current directions of linguistics at UC Santa Cruz.","location":"","location_details":"Stevenson Fireside Lounge, Stevenson College","link":"https://events.ucsc.edu/event/2844","event_instances":"1","event_date":"1428170400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Screen%20Shot%202015-01-22%20at%208.56.01%20AM.png?itok=AY9XwtHP","alt":""},"description":"There will be talks, discussions, photos, and interactive demonstrations illustrating the history and current directions of linguistics at UC Santa Cruz. This conference will focus on the Department's past and present research on endangered languages and linguistic theory; new experimental methodologies; linguistic training as a bridge to careers in language technology.\r\r**Time:**  \r11:00 am - 3:00 pm"}},{"event":{"title":"An Uncommon Place: Shaping the UC Santa Cruz Campus","teaser":"Running April 8 - May 9.An exhibition exploring the transformation of a spectacular natural site into the one of the most cherished university campuses in the world.","location":"Sesnon Gallery, Porter College","location_details":"","link":"https://events.ucsc.edu/event/2731","event_instances":"24","event_date":"1428519600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Early%20University.jpg?itok=vU9X-z77","alt":""},"description":"Running April 8 - May 9.\r\rAn exhibition exploring the transformation of a spectacular natural site into the one of the most cherished university campuses in the world. \r\rSince 2011, Professors Emeriti James Clifford, Michael Cowan, Virginia Jansen and Campus Architect Emeritus Frank Zwart (Cowell ’71) have been investigating the early history of UC Santa Cruz as a built environment, from four distinct perspectives. Neither a natural history, an institutional history, nor a purely architectural history, their project focuses on place making, and on architecture as a broadly interactive process. \r\rHow did the ensemble of sites, structures, and environments that is the UC Santa Cruz campus take shape? How has this special place been sustained and transformed through changing times and in relation to an evolving educational project? Where has it fallen short? What has been overlooked? The group’s approach has been founded on the assumption that UCSC’s extraordinary physical setting and the university’s educational vision are inseparable. \r\rThe campus, praised by all for its beauty, remains in a continuing process of adaptation, negotiating inherent tensions and contradictions in changing historical moments. A tradition as well as an essential resource, it needs to be critically understood, and celebrated.\r\r[An Uncommon Place: Shaping the UC Santa Cruz Campus](http://art.ucsc.edu/galleries/exhibitions/upcoming) is the first result of their efforts. Combining seldom seen architectural drawings and photographs with remarks from participants and observers of campus development, the exhibition traces decisive moments in the early creation of UC Santa Cruz’s built environment and the visions that shaped the campus. \r\rThe exhibition evokes paths taken and not taken in the first decades of campus development: decisions, constraints, hopes, realities. It celebrates the achievement of UC Santa Cruz’s founding planners who married an extraordinary physical site with an innovative educational project and it analyzes the tensions and contradictions the founders built into the campus. Through its many subsequent transformations, the university that took shape on rugged forested terrain atop a high hill, remains an uncommon place.\r\rGallery hours are: \rTuesday – Saturday, 12:00–5:00 p.m. & \rWednesday 12:00-8:00 p.m."}},{"event":{"title":"Rhythms of Place: Photographic Explorations of the UCSC Campus","teaser":"The Santa Cruz campus is often said to be “beautiful,” “awesome,” “spectacular”—words that strain to evoke a sense of place for which we lack adequate language.","location":"","location_details":"Porter College Faculty Gallery","link":"https://events.ucsc.edu/event/3001","event_instances":"1","event_date":"1428519600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Rhythms%20of%20place-Website%20image.jpeg?itok=31tePMnl","alt":""},"description":"The Santa Cruz campus is often said to be “beautiful,” “awesome,” “spectacular”—words that strain to evoke a sense of place for which we lack adequate language. This gathering of historic and contemporary images by professional and amateur photographers accompanies “An Uncommon Place,” at the Porter Sesnon Gallery. It adopts a phenomenological approach, evoking sensory rhythms characteristic of UCSC’s environment—the movement between shadow and light, vertical and horizontal, void and structure, thicket and clearing, formal and improvised uses of the site. Curated by James Clifford, Richard Wohlfeiler, and Irene Reti.\r\r**Event Dates:**  \rThe exhibit runs from APRIL 8 - MAY 9\r\r**Porter College Faculty Gallery Hours:**  \rTuesday – Saturday at 12:00 – 5:00 pm  \rWednesdays at 12:00 - 8:00 pm\r\r**Special Events:**  \rReception April 8 at 5:00 - 7:00 pm in conjunction with An Uncommon Place: Shaping the UC Santa Cruz Campus at the Sesnon Gallery  \rAlumni Weekend Reception and Curators' Walkthrough April 24 at 5:00 - 6:00 pm"}},{"event":{"title":"The Feminist Architecture of Gloria Anzaldua: New Translations, Crossings and Pedagogies in Anzalduan Thought","teaser":"A Conference on the Work of Gloria Evangelina Anzaldua","location":"Humanities 1 Building","location_details":"Humanities Lecture Hall, Room 206","link":"https://events.ucsc.edu/event/2738","event_instances":"1","event_date":"1428649200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Anzpstr_Fnl_1.jpg?itok=TpWXMZAO","alt":""},"description":"A Conference on the Work of Gloria Evangelina Anzaldua\r\rGloria Evangelina Anzaldúa — poet, philosopher, and critical scholar — founded, wrote, and encouraged a transformative body of writing and scholarship, with generative influences on critical race, feminist, queer, and decolonizing ways of knowing. Importantly for UCSC, Anzaldúa was a vital presence on our campus for over twenty years, and her legacy is a profound part of the 50th anniversary celebrations of the campus.\r\rThe UC Presidential Chair in Feminist Critical Race and Ethnic Studies is proud to initiate a celebration of the intellectual legacy of Gloria Anzaldúa. This year-long celebration includes a series of undergraduate workshops and creative writing seminars, advanced study seminars for graduate students and faculty, performances by artists and poets as part of the creative writing Living Writers’ reading series, and an installation of Anzaldúa’s writing altar from her archives in McHenry Library’s Special Collections. Finally, our celebration will culminate in a two-day (April 10-11, 2015) scholarly conference: The Feminist Architecture of Gloria E. Anzaldúa: New Translations, Crossings, and Pedagogies in Anzaldúan Thought.\r\rFor the conference schedule and list of speakers visit: http://ihr.ucsc.edu/event/anzaldua/"}},{"event":{"title":"9th Annual HOPE International Music Festival ","teaser":"College Nine and College Ten Co-curricular Programs Office, the HOPE Planning Team, and our Cosponsor Hermanas Unidas are proud to present the 9th Annual International Hope Benefit Concert.","location":"College Nine","location_details":"This event is being held on the College Nine & College Ten Lawn.College Nine & College Ten Lawn is located to the left of the Dining Hall, and in between the Social Sciences buildings.","link":"https://events.ucsc.edu/event/2776","event_instances":"1","event_date":"1428782400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/HOPE2015_Flyer.jpg?itok=6wvisGat","alt":""},"description":"College Nine and College Ten Co-curricular Programs Office, the HOPE Planning Team, and our Cosponsor Hermanas Unidas are proud to present the 9th Annual International Hope Benefit Concert. \r\rHope is a tradition with a cause here at the University of California, Santa Cruz which seeks to address social justice issue from around the world incorporating both the College Nine theme of  International and Global Perspectives, and College Ten's theme of Social Justice and Community. \r\rThis year HOPE will highlight Mayan women's activism on reproductive rights in the Yucatán Peninsula. All proceeds from the event will go to the Mexican NGO, Semillas, which provides economic resources and funds to women organizing in Mexico around obstetric violence and the struggle for reproductive rights. \r\rThe Hope Benefit Concert will provide opportunities for students to gain knowledge about the fight for reproductive rights in both the Yucatán Peninsula and in our community through tabling, letter signing, petitions and other forms of activism by international and local organizations. \r\rThe concert will feature live music, performance, food, tabling and an interactive art project.  The HOPE Concert will be held outdoors at Colleges Nine and Ten on Saturday, April 11th from 1 to 4pm (rain moves event indoors to Multipurpose Room). The concert is open to the campus community and all proceeds will be derived from the regional food which may be purchased (by donation) at the event. \r\r\rFor more information or accommodations, please contact Erin Ramsden at eramsden@ucsc.edu. \r\r\r"}},{"event":{"title":"Views from the Hill","teaser":"The spring show at the Eloise Pickard Smith Gallery will feature works from UCSC alumni who are well recognized artists. This is an invitational show, celebrating 50 years of the arts infusing education.","location":"Cowell College","location_details":"Eloise Pickard Smith Gallery","link":"https://events.ucsc.edu/event/2741","event_instances":"1","event_date":"1429315200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Screen%20Shot%202015-01-22%20at%208.58.26%20AM.png?itok=kJ-niei1","alt":""},"description":"The spring show at the Eloise Pickard Smith Gallery will feature works from UCSC alumni who are well recognized artists. This is an invitational show, celebrating 50 years of the arts infusing education."}},{"event":{"title":"Views from the Hill: Looking Out, Looking In","teaser":"Alumni Invitational ExhibitionIn Celebration of the 50th Anniversary of UCSC, 1965-2015April 17 - June 14, 2015Reception: Friday, April 17, 5-7pmEloise Pickard Smith Gallery, Cowell College, UCSCGallery Hours: 11am-4pm Tuesday-Sunday","location":"","location_details":"Eloise Pickard Smith Gallery, Cowell College, UCSC","link":"https://events.ucsc.edu/event/3068","event_instances":"41","event_date":"1429315200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Rinaldo_SM_2-Arboretum_soft-ground.jpg?itok=7wNRfZ0H","alt":""},"description":"Alumni Invitational Exhibition \rIn Celebration of the 50th Anniversary of UCSC, 1965-2015\rApril 17 - June 14, 2015   \rReception: Friday, April 17, 5-7pm\rEloise Pickard Smith Gallery, Cowell College, UCSC\rGallery Hours: 11am-4pm Tuesday-Sunday\rFor more information: (831) 459-2953\r\rInvited Alumni Artists:\r                       \rCheryl Doering, Richard Shaffer, Holly Downing, David Keuter, Linda Pope,\rEric Thiermann, Renée Beville Flower, Susan Heinz, Brian Rounds, \rClaire Thorson, Carmen León, Ann Elizabeth Thiermann, Danielle Williamson\rSalal Moon Rinaldo, Terry Hogan, Maayan Tsadka, Catharina Marlowe,\rBryce Vinokurov, Aaron Johnson, and Ziggy Rendler-Bregman.\r\rImage: Salal Moon Rinaldo, \"Arboretum\", soft ground etching, 9.75\" x 12\", \rMerrill College, Class of 1994\r\r\r"}},{"event":{"title":"IT'S A WILD LIFE","teaser":"The Santa Cruz premiere of “It’s a Wild Life” by UC Santa Cruz alumnus Keenan and Karen Ward.","location":"","location_details":"Rio Theatre1205 Soquel Avenue, at the intersection of Soquel and Seabright.(831) 423-8209","link":"https://events.ucsc.edu/event/2947","event_instances":"1","event_date":"1429324200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Itsawildlife4K5x8_17FEB2015b.jpg?itok=cS0Vmq1f","alt":""},"description":"The Santa Cruz premiere of “It’s a Wild Life” by UC Santa Cruz alumnus Keenan and Karen Ward.\r\rFilmmakers Kennan and Karen Ward present the Santa Cruz premiere of their first feature length film “It’s A Wild Life.”  Filmed in the mountains and coast of Big Sur, the film captures the majestic beauty of the land and its inhabitants.  \r\rA graduate of the UC Santa Cruz Environmental Studies program (’79), Kennan combines his knowledge of nature, keen eye, and obvious love of the Big Sur region to produce the film, which was six years in the making.  The film follows the main characters deeply influenced by this place.  Wildlife includes bobcats, hummingbirds, and the magnificent California condors.\r\rCome see the film that prompted Congressman Sam Farr to exclaim “You haven’t seen Big Sur until you’ve seen this movie.”\r\rView a trailer for the film and learn more by visiting [It's A Wild Life](http://itsawildlifefilm.com)"}},{"event":{"title":"\"Come Home\" our 50th anniversary Alumni Weekend 4/23-4/26","teaser":"Alumni Weekend 2015 is Thursday April 23 - Sunday April 26. We have an amazing line-up of programs.","location":"","location_details":"UC Santa Cruz","link":"https://events.ucsc.edu/event/3051","event_instances":"1","event_date":"1429772400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/alumni-weekend.jpg?itok=sZmrXMLG","alt":"Alumni Weekend 2015 | April 23-26"},"description":"Alumni Weekend 2015 is Thursday April 23 - Sunday April 26. We have an amazing line-up of programs. [See the FULL listing](http://50years.ucsc.edu/alumniweekend2015/events.html) and [register here](https://securelb.imodules.com/s/1069/index.aspx?sid=1069&gid=1&pgid=1723&cid=3246).\r\rActivities include:\r- Bring back the Quarry tour, Journey through time: Limeworks tour, and many other tours.\r- Pan-DANM-Onium DANM's 10th anniversary\r- Kenneth S. Norris Center for Natural History dedication\r- Sunday brunches at the colleges \r- 4/26 event honoring Kenneth and Ann Thimann\rand [much, much more](http://50years.ucsc.edu/alumniweekend2015/events.html)!"}},{"event":{"title":"Mentor Match: A Student & Alumni Networking Dinner","teaser":"NOTE: THIS EVENT IS NOW SOLD OUTIf you have ever thought about mentoring a UC Santa Cruz student—this is the event for you! Alumni are cordially invited to Mentor Match: A Student & Alumni Networking Dinner.","location":"Stevenson Event Center","location_details":"Cost: $25 - Stevenson Event Center","link":"https://events.ucsc.edu/event/2802","event_instances":"1","event_date":"1429840800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/mentor.png?itok=RHQOjpY9","alt":""},"description":"**NOTE: THIS EVENT IS NOW SOLD OUT** \r\rIf you have ever thought about mentoring a UC Santa Cruz student—this is the event for you! Alumni are cordially invited to Mentor Match: A Student & Alumni Networking Dinner. \r\rThis event provides a fantastic opportunity to share your field of expertise and life lessons with an exceptional group of students from across campus. \r\rLearn about the challenges facing current students, connect with other slugs, and provide guidance for the next generation of alumni.\r\rFor more information contact [Katie Linder](mailto:klinder@ucsc.edu), Alumni and Student Outreach Coordinator.\r"}},{"event":{"title":"TEDxSantaCruz","teaser":"UC Santa Cruz is a major sponsor for TEDxSantaCruz 2015. For their 2015 event, the TEDx team is planning an event to help shine a spotlight on the impact of UC Santa Cruz through faculty research and alumni endeavors.","location":"","location_details":"General Admission: $70UCSC Students: $35Rio Theater1205 Soquel AvenueSanta Cruz, CA 95062","link":"https://events.ucsc.edu/event/2774","event_instances":"1","event_date":"1429893000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/tedxsc.jpg?itok=tsj6gIDA","alt":""},"description":"UC Santa Cruz is a major sponsor for TEDxSantaCruz 2015. For their 2015 event, the TEDx team is planning an event to help shine a spotlight on the impact of UC Santa Cruz through faculty research and alumni endeavors. UC Santa Cruz faculty, staff, students and alumni are well represented among the [speakers](http://www.tedxsantacruz.org/events/tedxsantacruz-2015-radical-collaboration/) at this event. Expect it to be an inspiring day of ideas and experiences born out of, or in need of, radical collaboration. More at the [TEDxSantaCruz](http://www.tedxsantacruz.org) website. "}},{"event":{"title":"DNA Day","teaser":"UC Santa Cruz, home of the UCSC Genome Browser and the assembly of the first draft of the human genome, celebrates national DNA Day every April.","location":"Sinsheimer Laboratories","location_details":"Sunken courtyard between Sinsheimer Laboratories and S&E Library.","link":"https://events.ucsc.edu/event/2846","event_instances":"1","event_date":"1429898400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/DNADay.jpg?itok=OlA2RTzk","alt":""},"description":"UC Santa Cruz, home of the UCSC Genome Browser and the assembly of the first draft of the human genome, celebrates national DNA Day every April. \r\rThe celebration features the annual double-human helix dance, the banana slug genome project, a student research poster session, hands-on strawberry DNA extraction, opportunities to learn about the CBSE Research Mentoring Institute (RMI) and other campus activities and groups related to genomics, and free stuff.\r\rDNA Day commemorates the date in 1953 when James Watson, Francis Crick, Maurice Wilkins, Rosalind Franklin, and colleagues published papers in the journal Nature on the structure of DNA. It was first celebrated in 2003 by proclamation of both the US Senate and the House of Representatives."}},{"event":{"title":"11th Annual Graduate Research Symposium","teaser":"The Graduate Research Symposium highlights the innovative research being conducted by graduate students in our thirty-eight programs across five academic divisions.It celebrates the scholarly, creative, social and commercial impact they make within California and around the world!","location":"McHenry Library","location_details":"","link":"https://events.ucsc.edu/event/2690","event_instances":"1","event_date":"1429905600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/11th-annual-graduate-research-symposium.jpg?itok=jjZRJgzK","alt":"11th Annual Graduate Research Symposium - Alumni Weekend 2015"},"description":"The Graduate Research Symposium highlights the innovative research being conducted by graduate students in our thirty-eight programs across five academic divisions.\r\rIt celebrates the scholarly, creative, social and commercial impact they make within California and around the world!\r\rIn addition to graduate students presenting their research to a general audience, graduate alumni selected by the Division of Graduate Studies will serve as Symposium judges, and graduate symposium alumni researchers noteworthy contributions will be highlighted. Join us at the Symposium to view presentations and discuss students' research.\r\rFor more information contact [gradadm@ucsc.edu](mailto:gradadm@ucsc.edu).\r"}},{"event":{"title":"True Originals: M. Sanjayan presents: A New Wild: Saving Nature in a Human-Dominated World ","teaser":"In a world of seven billion humans, can wild nature continue to exist? The environmental movement has long been dominated by a Western philosophy that sees humans as separate from and detrimental to nature.","location":"Media Theater","location_details":"Cost: $10 - Theater Arts Center, Rm M110","link":"https://events.ucsc.edu/event/2691","event_instances":"1","event_date":"1429929000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/sanjayan.png?itok=kE4v_0B-","alt":""},"description":"In a world of seven billion humans, can wild nature continue to exist? The environmental movement has long been dominated by a Western philosophy that sees humans as separate from and detrimental to nature. While great strides have been made in the past few decades, most scientists will agree that conservation efforts are simply not keeping up with the vast scale of planetary change. Despite our best efforts, the conservation movement is failing.   \r \r**Dr. M. Sanjayan**, Executive Vice President and Senior Scientist for Conservation International and UCSC grad (Graduate Divison 97), has just returned from a global quest to explore what it means to save nature in a world where wildness no longer exists. Looking beyond the expected devastation of human activity on the natural world, Sanjayan found places—most at the frontiers of where people and wildlife meet—where people can help nature thrive. Even more crucially, this \"new wild\" relationship is benefiting human well-being in ways we never before imagined.\r\rSanjayan’s talk will draw on his 2015 PBS television series [EARTH: A New Wild](http://www.pbs.org/earth-a-new-wild/home/) to reveal how, through human ingenuity, technology and sometimes ecological tragedy, people are becoming a positive part of the ecological systems we depend on for our well-being. The result is a new framework that reinvents environmentalism by making saving nature about saving ourselves. \r\rThis presentation is part of the *True Originals Notable Alumni Speakers Series*.\r\r**Award Presentation**\rDr. Sanjayan is the recipient of the 2015-2016 Alumni Association [Alumni Achievement Award](http://alumni.ucsc.edu/association/awards-programs/alumni-achievement-award.html); the highest honor bestowed on a graduate of UC Santa Cruz. Previous recipients include NPR Science Correspondent Richard Harris, Pulitzer Prize-winning journalists Dana Priest and Martha Mendoza, California Secretary for Natural Resources John Laird, and Monterey Bay Aquarium Executive Director Julie Packard.\r\rFor more information contact the [Special Events Office](mailto:specialevents@ucsc.edu), or call 831-459-5003."}},{"event":{"title":"Banana Slug Kid Zone","teaser":"A family-friendly event where alums can visit different craft booths with their little Banana Slugs.","location":"","location_details":"Founder's Glen Lawn","link":"https://events.ucsc.edu/event/2816","event_instances":"1","event_date":"1429981200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/sammy.jpg?itok=Apjq5LP6","alt":"Sammy - Banana Slug Kid Zone - Alumni Weekend 2015 Featured Event"},"description":"A family-friendly event where alums can visit different craft booths with their little Banana Slugs. \r\rCome enjoy the fun kid-centered activities where current slug students will be on hand to engage your little ones with fun activities including face painting, cookie decoration, a reading corner, bubbles, crafts, games, prizes and more!\r\rFor more information contact [Katie Linder](mailto:klinder@ucsc.edu), Alumni and Student Outreach Coordinator."}},{"event":{"title":"True Originals: 50 years of American Film Comedies","teaser":"Filmmaker Ron Yerxa with Santa Cruz Sentinel's Wallace Baine.","location":"","location_details":"Humanities Lecture Hall","link":"https://events.ucsc.edu/event/2818","event_instances":"1","event_date":"1429984800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Ron_Yerxa_SVFF_2014-477-resize_0.jpg?itok=4V--_2s8","alt":""},"description":"Filmmaker Ron Yerxa with Santa Cruz Sentinel's Wallace Baine.\r\rUCSC Alumnus (Grad Division) Ron Yerxa has produced several film comedies including ELECTION, LITTLE MISS SUNSHINE, and NEBRASKA.  In a conversation which might include some film clips, Ron and Wallace will discuss comedies which provide an escape from the ordeal of American life and those that embrace our social conditions head-on.  Not every year since UCSC opened will be fully discussed.\r\rFor more information contact [Meg Corman](mailto:mlcorman@ucsc.edu), Special Assistant to the Chancellor and VC of University Relations."}},{"event":{"title":"True Originals: Money, Politics, Climate Change and the Law: Will We Rise to the Challenge?","teaser":"NOTE: THE LOCATION FOR THIS EVENT HAS CHANGED TO THE STEVENSON EVENT CENTER.","location":"Stevenson College","location_details":"Stevenson Event Center","link":"https://events.ucsc.edu/event/2820","event_instances":"1","event_date":"1429984800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/paul-hall.jpg?itok=Hpz0c9_W","alt":"Alumni Weekend 2015 Featured Event"},"description":"**NOTE: THE LOCATION FOR THIS EVENT HAS CHANGED TO THE STEVENSON EVENT CENTER.**\r\r**Paul Hall**, Esq (Merrill ’72) will moderate an interdisciplinary panel of distinguished alumni who will help us take a keen look at the interplay of money and power in our political and governing systems.\r\r\rPanelists include: \r**Mary Doyle** (Porter, '74), Former Vice President, Legal and Global Chief Compliance and Ethics Officer at Oracle, **Judge Kelvin Filer** (Stevenson ’77), Los Angeles Superior Court in Compton, **Judge Teri Jackson** (Stevenson ’77), San Francisco Superior Court, **Art Torres** (Stevenson ’68), Retired State senator and Vice Chair of CIRM, and **Zach Wasserman** (Merrill ’69) public interest lawyer in Oakland.  \r\rFor more information contact [Meg Corman](mailto:mlcorman@ucsc.edu), Special Assistant to the Chancellor and VC of University Relations."}},{"event":{"title":"Banana Slug Lunch: Farm Fresh, Family Style","teaser":"EVENT SOLD OUT - Taking place at the heart of alumni weekend, the Banana Slug Lunch embodies the ideal of coming home. Elbow-to-elbow with fellow alumni and sharing a meal over conversation.","location":"Cowell College","location_details":"Cost: $25 - Cowell Courtyard","link":"https://events.ucsc.edu/event/2822","event_instances":"1","event_date":"1429990200","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/lunch.png?itok=FJ0p8i8M","alt":""},"description":"**EVENT SOLD OUT** - Taking place at the heart of alumni weekend, the Banana Slug Lunch embodies the ideal of coming home. Elbow-to-elbow with fellow alumni and sharing a meal over conversation.\r\rThis year the lunch will take place in the Cowell courtyard and include stories from assembled guests.\r\rOver a family style meal serving delicious, locally sourced produce, alumni will share their own stories of the campus and know they are always welcome home.\r\rFor more information contact the [Special Events Office](mailto:specialevents@ucsc.edu) or call 831-459-5003.\r"}},{"event":{"title":"Tales as Tall as the Redwoods: Reflections on UCSC's Founding Years","teaser":"NOTE: ROOM CHANGE TO STEVENSON ROOM 150. Join an animated roundtable discussion of faculty emeriti and alumni sharing stories about their experiences at UC Santa Cruz during its early years.Our engaging list of panelists includes:","location":"Stevenson College","location_details":"Stevenson Room 150","link":"https://events.ucsc.edu/event/2721","event_instances":"1","event_date":"1429995600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/tales.png?itok=W0ECQI6f","alt":""},"description":"**NOTE: ROOM CHANGE TO STEVENSON ROOM 150.** Join an animated roundtable discussion of faculty emeriti and alumni sharing stories about their experiences at UC Santa Cruz during its early years. \r\rOur engaging list of panelists includes: \r\r**Peter Kenez** (Professor Emeritus)\rMultiple generations of UC Santa Cruz students recognize the name Peter Kenez. A Ph.D. graduate from Harvard University and celebrating 50 years on campus in 2016, it is not uncommon for students ask, \"Does Peter Kenez still teach history here? My dad was a student of his!\" A wonderful opportunity to hear the wisdom of a much beloved pioneer.\r\r**David Thomas** (Professor Emeritus)\rDavid Thomas was a professor of politics at UCSC from 1966 to 1999. From 1980, he taught a course, whose final title was \"Sexual Politics: Queer Politics.\" The course was a major contribution to queer life at UCSC and was one of the first of its kind in the United States. A true trailblazer in his field and one we welcome home for Alumni Weekend.\r\r**Gregg Herken** (Stevenson '69)\rGregg Herken is a distinguished UC Santa Cruz alumnus and Professor Emeritus of History at the University of California. He taught at Oberlin College and Yale before becoming a Founding Faculty member at UC Merced. He is the author of five books and was a finalist for the 2003 Los Angeles Times Book Prize in History.\r\r**Linda Peterson** (Stevenson '70)\rLinda Peterson currently serves as a UC Santa Cruz Foundation Trustee and Associate General Counsel at Occidental Petroleum. Her distinguished career includes tenures as Director of the The Mary Magdalene Project, President of the Los Angeles Chapter of the American Corporate Secretaries and Governance Professionals, and founding member of the Board of Directors of Theater By The Blind (now theater Breaking Through Barriers), a New York City-based theater\rcompany that works with the disabled. \r\r**Gail Hershatter - Moderator**  \rGail Hershatter is Distinguished Professor of History at the University of California, Santa Cruz, where she has taught since 1991.  Her books include *The Workers of Tianjin, 1900-1949* (1986), *Personal Voices: Chinese Women in the 1980s* (with Emily Honig, 1988), *Dangerous Pleasures: Prostitution and Modernity in Twentieth-Century Shanghai* (1997), *Women in China’s Long Twentieth Century* (2007), and *The Gender of Memory: Rural Women and China’s Collective Past* (2011). She chaired the History Department from 2010-2013 and is a former President of the Association for Asian Studies (2011-2012).\r\rFor more information contact [Stephanie Sawyer](sawyer@ucsc.edu), Assistant Manager, History Department."}},{"event":{"title":"True Originals: From Here to Modernity—Perspectives from Distinguished Museum Professionals","teaser":"Alumni Arts professionals present how an array of educational experiences at UC Santa Cruz helped inspire five of its graduates to pursue their present careers at five of America’s notable art museums.","location":"Digital Arts Research Center (DARC)","location_details":"Room 230","link":"https://events.ucsc.edu/event/2693","event_instances":"1","event_date":"1429997400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/jock-reynolds.jpg?itok=Kf8kvsSH","alt":"True Originals - Alumni Weekend 2015 Featured Event"},"description":"Alumni Arts professionals present how an array of educational experiences at UC Santa Cruz helped inspire five of its graduates to pursue their present careers at five of America’s notable art museums. \r\rA panel hosted and introduced by **Shelby Graham**, Director of the Porter Sesnon Gallery, will be moderated by **Jock Reynolds** (Stevenson ’69), Director of the Yale University Art Gallery, holding forth with alumni colleagues **Jeremy Strick** (Cowell ’77), Director, Nasher Sculpture Center, **Philip Brookman** (Porter ’75), Consulting Curator, National Gallery of Art, **Karen Moss** (Porter ’77), Curator and Faculty, Otis College of Art and Design and USC Curatorial MA Program, and **Erin O’Toole** (Kresge ’92), Associate Curator of Photography, San Francisco Museum of Modern Art.\r\rFor more information contact [Meg Corman](mailto:mlcorman@ucsc.edu), Special Assistant to the Chancellor and VC of University Relations."}},{"event":{"title":"True Originals: The Santa Cruz Stairway—Today's Writing and Publishing Strategies from Fiction to Memoir to Hand-Made Books","teaser":"Alumni authors share their experiences in pursuing their dream of writing and with the changing landscape of publishing.","location":"McHenry Library","location_details":"McHenry Library, Room 4286 - 2:30-4 pm. &Bookshop Santa Cruz (1520 Pacific Ave, Santa Cruz, CA 95060) - 6:30 pm.","link":"https://events.ucsc.edu/event/2773","event_instances":"1","event_date":"1429997400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/bookshop-sc.jpg?itok=-cUZYkaO","alt":"Alumni Weekend 2015 Featured Events"},"description":"Alumni authors share their experiences in pursuing their dream of writing and with the changing landscape of publishing.\r\r**The panel includes:**  \rLiterary agent and author **Laurie Fox** (Porter College ‘75 -- it was College Five then), Author **Reyna Grande** (Kresge  ’99) , Printer and writer **Tom Killion** (Cowell ‘75), Mystery series author **Laurie King** (Kresge '77), and Author and editor **Don Wallace** (Cowell ’74). \r\rFollowing the panel event a reading at Bookshop Santa Cruz is planned for 6:30 pm. \r\rFor more information contact [Meg Corman](mailto:mlcorman@ucsc.edu), Special Assistant to the Chancellor and VC of University Relations.\r\r"}},{"event":{"title":"Teach In: Craig Haney","teaser":"NOTE: ROOM CHANGE TO HUMANITIES LECTURE HALL. Be a student again for an afternoon! Professor Craig Haney will present a lecture entitled \"Think Different: Why Everything We’ve Been Taught About Crime is Wrong and What We Need to Do About It.\"","location":"","location_details":"Humanities Lecture Hall","link":"https://events.ucsc.edu/event/2825","event_instances":"1","event_date":"1429997400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/craig-haney.jpg?itok=PFqN5scL","alt":"Alumni Weekend 2015 Featured Events"},"description":"**NOTE: ROOM CHANGE TO HUMANITIES LECTURE HALL.** Be a student again for an afternoon! Professor Craig Haney will present a lecture entitled \"Think Different: Why Everything We’ve Been Taught About Crime is Wrong and What We Need to Do About It.\"\r\rProfessor Haney will describe the political and media misrepresentations of the nature and causes of crime in our society and their consequences in helping to fuel a very expensive and misguided set of crime control policies over the last several decades. \r\rHe will present the results of extensive research—his own and that of a number of others—demonstrating the developmental and social contextual origins of criminal behavior, including the impact of childhood risk factors, trauma, and maltreatment as well as economic inequality and neighborhood disadvantage on life trajectories. \r\rIndeed, there is now an entire science of “life course criminology” that stands in direct opposition to the simplistic model of “free will” upon which much criminal law and prison policy continues to be based. \r\rHaney will conclude by proposing an alternative, truly preventive model of crime control that stems directly from this fundamentally different understanding of the nature of criminality.\r\rFor more information contact [Samantha Li](sakli@ucsc.edu), Regional Program Assistant, University Relations."}},{"event":{"title":"Teach In: Bettina Aptheker","teaser":"NOTE: ROOM CHANGE TO CLASSROOM UNIT 2. Be a student again for an afternoon! Attend a lecture entitled \"Feminism & Social Justice\" from faculty professor of feminist studies Bettina Aptheker.","location":"Classroom Unit","location_details":"Classroom Unit 2","link":"https://events.ucsc.edu/event/2826","event_instances":"1","event_date":"1429997400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/bettina-aptheker.jpg?itok=0EJKgjr6","alt":"Bettina Aptheker - Teach-in Alumni Weekend 2015 Featured Event"},"description":"**NOTE: ROOM CHANGE TO CLASSROOM UNIT 2.** Be a student again for an afternoon! Attend a lecture entitled \"Feminism & Social Justice\" from faculty professor of feminist studies Bettina Aptheker.\r\rJoin fellow alums for a lively look at current movements in social justice and the ways in which gender, race, class, and sexuality interconnect with each other.\r\rFrom birth matters to thinking about prisons, from queer stakes to transgender identities, from immigrant lives to environmental justice in scores of communities across the country, these issues animate and agitate. Join in debate, dialogue and discussion.\r\rFor more information contact [Samantha Li](sakli@ucsc.edu), Regional Program Assistant, University Relations."}},{"event":{"title":"Alumni Wine Reception: Sunset and Wine","teaser":"EVENT SOLD OUT – Unwind with a glass of wine in the company of friends and reconnect with favorite faculty and staff.","location":"Cowell College","location_details":"Cost: $10 - Cowell Courtyard","link":"https://events.ucsc.edu/event/2830","event_instances":"1","event_date":"1430002800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/wine-reception_0.jpg?itok=d2G-Ovco","alt":"Alumni Wine Reception: Sunset and Wine"},"description":"**EVENT SOLD OUT** – Unwind with a glass of wine in the company of friends and reconnect with favorite faculty and staff.\r\rFeatured Teach-In professor **Craig Haney** will be on-hand to continue discussion of his lecture over fine-food, drink and a beautiful spread of hors d'oeuvres. \r\rFor more information contact the [Special Events Office](mailto:specialevents@ucsc.edu) or call 831-459-5003."}},{"event":{"title":"Bonfire by the Bay","teaser":"After a busy day of reconnecting, grab an old friend and head to the East field to catch the remaining moments of the sunset while warming up by a bonfire. Music, hot chocolate, food trucks. This event is a must to wind down your day.","location":"East Field House","location_details":"East Field, Volleyball Court","link":"https://events.ucsc.edu/event/2831","event_instances":"1","event_date":"1430010000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/bonfire.jpg?itok=2F0-Yj9a","alt":"Bonfire by the Bay - Alumni Weekend 2015 Featured Event"},"description":"After a busy day of reconnecting, grab an old friend and head to the East field to catch the remaining moments of the sunset while warming up by a bonfire. Music, hot chocolate, food trucks. This event is a must to wind down your day. \r\rFor more information contact the [Special Events Office](mailto:specialevents@ucsc.edu)."}},{"event":{"title":"50th Anniversary Event Honoring Kenneth and Ann Thimann","teaser":"You are invited to an informal event sharing the memories of Crown College founders Kenneth and Ann Thimann.","location":"","location_details":"Crown-Merrill Cultural Center","link":"https://events.ucsc.edu/event/2700","event_instances":"1","event_date":"1430082000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/thimann.jpg?itok=IsJ4eAek","alt":""},"description":"You are invited to an informal event sharing the memories of Crown College founders Kenneth and Ann Thimann. \r\rKenneth Thimann was an eminent biologist who came from Harvard to become the founding Provost of Crown College and the first dean of the Science Division at UCSC. He played a major role in establishing the Biology department and guided the development of other science departments on campus.\r\rEmeriti faculty and present faculty, including former Crown College Provosts Ed Landesman and Peggy Musgrave will participate.\r\rFor more information contact [Cathy Murphy](mailto:cmurphym@ucsc.edu), College Academic Programs Coordinator, Crown College.\r"}},{"event":{"title":"UCSC Bioneers Conference May 2-3","teaser":"1st Annual UCSC Bioneers Conference at Kresge College, May 2-3Free and open to the public. Free parking in the Core West Parking Garage.Full program online at commonground.ning.com/ucscbioneers","location":"Kresge Town Hall","location_details":"","link":"https://events.ucsc.edu/event/3062","event_instances":"1","event_date":"1430582400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/bioneers_swirl.jpg?itok=CFG2_wG4","alt":""},"description":"1st Annual UCSC Bioneers Conference at Kresge College, May 2-3\r\rFree and open to the public. Free parking in the Core West Parking Garage.\rFull program online at commonground.ning.com/ucscbioneers\r \rCommon Ground Center at Kresge College presents UCSC Bioneers, A Bioneers Resilient Communities Network Event. Don’t miss the first annual UCSC Bioneers Conference, two days of transformation and connection featuring over 30 plenaries and workshops with visionary activists, scholars and students, Saturday evening community World Cafe conversations and drum circle, food vendors, ice cream social and more! \r\rPlenaries:\rJon Young - Deep Nature Connection, Mentoring and Culture Repair\rRebecca Bales - Gender and Sacred Space\rJohn Foran - Climate Justice Movement\rKathia Laszlo - Human Side of Sustainability\rBruce Lipton - Science of Personal Empowerment\rBarbara Jefferson - The Work That Reconnects\rLiora Adler - Ecovillages for Global Regenerative Emergence\rHansung Lee - Envisioning New Humans and Community\rKritters Blevins - Affordable Student Housing\rJuan Poblete - Racism in the Contact Zones\rNada Miljković - Activism in the Digital Age\rJohn O'Mara - Wilderness Rites of Passage\r\rWorkshops topics:\rRebecca Bales - Native American Women: Living with the Landscape\rArty Mangan - Local Food: Healthy People, Environmental Stewardship\rJon Young - The Art of Village Building: Invisible Structures to Support Sustainability and Regeneration\rJames Stark - Ecology of Leadership \rMelissa Moreno - Culture and Seeds: “Las Tres Hermanas”\rDaniel Sheehan - “Ecoterrorism” and the Threat to our Constitutional Rights\rEliana Willis and Kaki Demski - Building Naturalist Community\rFrank Andrews - Choice by Choice, Living Life With a Yes\rVanessa Raditz - Reclaiming Public Education to Reclaim the Commons\rLiora Adler, Hansung Lee, Kritters Blevins and Cecile Andrews - Ecovillages, Intentional Communities and Housing Cooperatives. \rRick Longinotti - Nonviolence Begins in My Head: Powerful Advocacy Without Moral Outrage\rKristen Rivers - The Millennial Jedi, Warrior, Priestess: On a Mission\rBarbara Jefferson - The Work That Reconnects\rEducators Unite! - Models of Transformative Teaching and Learning\rTia Lebherz, Madeleine Keller, Cristal Gonzalez - Water Privatization and Drought \rJohn Foran and 350.org - Climate Justice \rKresge Garden Co-op - Raising Consciousness from Seed to Salad Mix\rAnd more!\r\rFull program online at commonground.ning.com/ucscbioneers. UCSC Bioneers opening ceremony will begin at 9:00 am on Saturday, May 2nd; the first keynote begins at 9:15am with workshops in the afternoon and a musical celebration ending at 9:00pm. Sunday morning keynotes begin at 9:00am followed by workshops and a final keynote to finish at 3:00pm.\r\rSaturday Community Night\rSaturday 1:00 - Live Acapella with the Hightones, 5:00-6:30pm Thriving Resilient Communities World Cafe, followed by dinner and an outdoor Drum Circle with Jim Greiner 7:30-9:00pm!\r\rFood Vendors\rFood vendors Holy Smokes Country BBQ and Cafe Iveta will be on site selling food Sa lunch and dinner and Su lunch. Kresge Food Co-op will be onsite selling snacks and drinks. Community Agroecology Network will be onsite serving free bottomless coffee. We aspire for this to be a zero waste event, please bring your coffee cup and dishware.\t\r\t\t\t\t\t\rSince 1990, Bioneers has acted as a fertile hub of social and scientific innovators with practical and visionary solutions for the world’s most pressing environmental and social challenges. Visit Bioneers.org to learn more about our programs including: Resilient Communities Network, Everywoman’s Leadership, Cultivating Women’s Leadership trainings, Indigenous Knowledge, Restorative Food Systems, and our award- winning radio series and rich library of media materials. Experience the Bioneers National Conference each October, and regional Bioneers Resilient Community Network gatherings held throughout the year. To learn more about Bioneers, visit www.bioneers.org. \r\t\t\t\t\rThe mission of the Kresge Common Ground Center is to create cultural change for social justice, environmental regeneration, and economic viability; acting as a catalyst and facilitator of systemic change through undergraduate action-education, research, advocacy, and civic engagement. To learn more about the Kresge Common Ground Center visit kresge.ucsc.edu/commonground.\r\rThank You to Our Sponsors\rThis event is made possible by the Kresge College Common Ground Center, Bioneers, Campus Sustainability Council, Sustainability Office, Measure 43, Porter Provost, Porter Senate, Oakes Provost, College 8 Provost, Cowell Provost, Kresge Ecovillage, Literature, Environmental Studies, Sociology, Anthropology, Community Agroecology Network, Mission Hill Creamery, and all of our plenary and workshop presenters who have generously donated their time.\r\rThe full program is available online at http://commonground.ning.com/ucscbioneers and https://www.facebook.com/events/973014252732757/ \r\rUCSC Bioneers is a local, self-organized Bioneers Resilient Communities Network Event. To learn more about Bioneers, visit www.bioneers.org. \r\rThis event is free and open to the public. Free parking in the Core West Parking Garage."}},{"event":{"title":"80th Running of the Cardiac Pacer 5 Mile Run","teaser":"Oldest Run in Santa Cruz County. This Bi-Annual race begins and ends at the East Field House Complex. 50% Pavement/50% trails. All entrants receive a specialized banana slug at the finish.","location":"","location_details":"Main Track","link":"https://events.ucsc.edu/event/2719","event_instances":"1","event_date":"1430586000","thumbnail":"","description":"Oldest Run in Santa Cruz County. This Bi-Annual race begins and ends at the East Field House Complex. 50% Pavement/50% trails. All entrants receive a specialized banana slug at the finish. "}},{"event":{"title":"Traditional and New Indonesian Music and Dance","teaser":"UCSC West Javanese Gamelan presents MUSIC & DANCE FROM SUNDA & CIREBON directed by Undang Sumarna, drummer UCSC Balinese Gamelan 'Swarasanti' presents KECAK, MUSIC & DANCE FROM BALI. Directed by Brian Baumbusch with drummer-dancer I Gedé Oka Artha Negara","location":"Music Center Recital Hall","location_details":"","link":"https://events.ucsc.edu/event/2743","event_instances":"1","event_date":"1431225000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/undang-sakura-kelley-SQ.jpeg?itok=8imZOcMq","alt":"Pictured: Undang Sumarna; Photograph: Sakura Kelley"},"description":"UCSC West Javanese Gamelan presents MUSIC & DANCE FROM SUNDA & CIREBON directed by Undang Sumarna, drummer UCSC Balinese Gamelan 'Swarasanti' presents KECAK, MUSIC & DANCE FROM BALI. Directed by Brian Baumbusch with drummer-dancer I Gedé Oka Artha Negara"}},{"event":{"title":"Volcanism as the re-creation of Earth - Jim Gill","teaser":"Volcanoes have both immediate and remote significance – immediate when they erupt, and remote because they are a primary mechanism of planetary change. The eruptions are a kind of planetary recreation, and generating magma re-creates the Earth.","location":"Music Center Recital Hall","location_details":"","link":"https://events.ucsc.edu/event/2944","event_instances":"1","event_date":"1431397800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Gillvolcano.jpg?itok=iSnl1Rrw","alt":""},"description":"Volcanoes have both immediate and remote significance – immediate when they erupt, and remote because they are a primary mechanism of planetary change. The eruptions are a kind of planetary recreation, and generating magma re-creates the Earth. My talk will explore both aspects, and be illustrated. Eruptions, and the volcanoes that they create, differ because the magmas that erupt are highly variable in composition because what melts (the source rock) is so variable. I will summarize eruptions, magmas, and sources from the three main volcanic regimes on Earth: mid-ocean ridges where tectonic plates are born; ocean islands where they are middle- aged; and subduction zones where they die. I will emphasize subduction zones (e.g., the Circum-Pacific Ring of Fire) because that is where I have spent most of my career, both on land and below the sea. Those magmas are unique to Earth, are the most explosive, create the most valuable metal deposits, and produce the continents on which we live. I will discuss their origin, their role in Earth evolution, and how they are studied in the field and laboratory."}},{"event":{"title":"The Accelerating Universe: Einstein's Blunder Undone","teaser":"Robert Kirshner of the Harvard-Smithsonian Center for Astrophysics talks about exploding stars and the accelerating universe.","location":"","location_details":"Rio Theatre1205 Soquel Avenue Santa Cruz, CA 95062","link":"https://events.ucsc.edu/event/2996","event_instances":"1","event_date":"1431568800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/mandellecture.png?itok=NTaaq3LW","alt":""},"description":"Robert Kirshner of the Harvard-Smithsonian Center for Astrophysics talks about exploding stars and the accelerating universe.\r\rThe discovery of the acceleration of the expansion of the universe is one of the most surprising results of 20th century astrophysics.  Around 1916, Albert Einstein famously introduced a \"cosmological constant\" to make a static universe.  In the 1930s, the work of Edwin Hubble and others showed that we live in an expanding universe and Einstein shunned his own creation.  But in the 1990s, astronomers began to develop sharp tools for accurately measuring the history of comic expansion over the past 5 billion years.  The observations of thermonuclear supernovae showed that the Universe is not just expanding, but that the expansion is speeding up.  We attribute this astonishing fact to the presence of \"dark energy\" which may be a modern form of the cosmological constant.  Today, a firm web of evidence makes the dark energy a leading mystery of modern physics."}},{"event":{"title":"The Miriam Ellis International Playhouse","teaser":"15 YEARS OLD AND COUNTING!...","location":"Stevenson Event Center","location_details":"","link":"https://events.ucsc.edu/event/3084","event_instances":"4","event_date":"1431658800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/IP%20image_0.jpg?itok=XbEGdc18","alt":""},"description":"15 YEARS OLD AND COUNTING!...\r\rThe Department of Languages and Applied Linguistics, Cowell College, and Stevenson College, will present The Miriam Ellis International Playhouse (MEIP), an annual multilingual program of fully-staged short theater pieces, for its 15th season. Four public performances will be held on May 14, 15, 16, 17, at 8:00PM at the Stevenson Event Center, UCSC, and will feature works in French, Italian, Japanese, Russian, and Spanish, with English super-titles. The program will be directed by Language lecturers and performed by Language students. There is no admission charge.\r\rThis year's works include: (in French) THE GAP, by Ionesco, and a scene from THE WOULD-BE GENTLEMAN by Molière, directed by Miriam Ellis; (in Italian) BROTHER ATM and SERENDIPITY, by Benni, directed by Giulia Centineo; (in Japanese) SWEET POISON, traditional, directed by Sakae Fujita; (in Russian) THE PATIENT, by Dovlatov, directed by Natalya Samokhina; (in Spanish) MISERY, by Güiraldes, directed by Marta Navarro. The pieces range in time from medieval and classical periods to modern-day theater, with emphasis on their comic elements."}},{"event":{"title":"BSLUGS Go to Fenway!","teaser":"BSLUGS go to FenwayRed Sox vs. the AngelsFriday, May 22, 20157:10 p.m. at Fenway Park","location":"","location_details":"Fenway ParkBoston, MA","link":"https://events.ucsc.edu/event/2949","event_instances":"1","event_date":"1432346400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/fenway.jpg?itok=S5bUbDnl","alt":"Fenway Park"},"description":"BSLUGS go to Fenway\rRed Sox vs. the Angels\rFriday, May 22, 2015\r7:10 p.m. at Fenway Park\r\rJoin the B-Slugs, the Boston area UC Santa Cruz alums, as we head to Fenway Park on Friday night, May 22. We have a block of tickets reserved in the Right Field grandstand, $33 each. First come, first served to get yours! So what if the Sox didn't do so well last year...they won it all the year before. And, whatever the outcome of the game, you get to be at wonderful Fenway!\r\rTo reserve your tickets, send your check made out to 'BOSTON CHAPTER' to Erika Tarlin, P.O. Box 45108, Somerville, Mass. 02145. Limit 3 tickets, please. Include a note with the number of tickets requested, your e-mail address, and your address as tickets will be mailed to you. \r\rQuestions? E-mail Beata Panagopoulos or Erika Tarlin. \r\rSee you there! Go Sox and Banana Slugs!"}},{"event":{"title":"World Ocean Days","teaser":"Visit the Seymour Marine Discovery Center during its 15th anniversary year - take a tour, touch a shark, and celebrate our blue planet.","location":"Seymour Marine Discovery Center","location_details":"","link":"https://events.ucsc.edu/event/2726","event_instances":"1","event_date":"1433610000","thumbnail":"","description":"Visit the Seymour Marine Discovery Center during its 15th anniversary year - take a tour, touch a shark, and celebrate our blue planet."}},{"event":{"title":"Social Documentation Graduate Exhibition","teaser":"2015 will be the ten year anniversary of the Social Documentation Program. This event showcases socially engaged documentary work by the graduating Master's Class of 2015.","location":"","location_details":"Del Mar Theater1124 Pacific AvenueSanta Cruz, CA 95067","link":"https://events.ucsc.edu/event/2737","event_instances":"1","event_date":"1433984400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/socdoc-delmar_crop.jpg?itok=KWLO7lnj","alt":""},"description":"2015 will be the ten year anniversary of the Social Documentation Program. This event showcases socially engaged documentary work by the graduating Master's Class of 2015."}},{"event":{"title":"Dedication of the Cowell Archives","teaser":"The McHenry Library has archives for the whole university. Cowell has archives related to events at Cowell over the last 50 years. Recently, brilliant emeritae staff Angie Christmann and Lynne Wolcott have been cataloguing all our memorabilia.  Come and view the archives!","location":"Cowell College","location_details":"Dungeon at Cowell","link":"https://events.ucsc.edu/event/2703","event_instances":"1","event_date":"1434135600","thumbnail":"","description":"The McHenry Library has archives for the whole university. Cowell has archives related to events at Cowell over the last 50 years. Recently, brilliant emeritae staff Angie Christmann and Lynne Wolcott have been cataloguing all our memorabilia.  Come and view the archives! "}},{"event":{"title":"True Originals: 50th Anniversary Commencement Speakers","teaser":"For Commencement 2015, we are honored to welcome back to campus distinguished alumni from a variety of fields and across the nation.","location":"","location_details":"OPERS East Field","link":"https://events.ucsc.edu/event/2735","event_instances":"3","event_date":"1434150000","thumbnail":"","description":"For Commencement 2015, we are honored to welcome back to campus distinguished alumni from a variety of fields and across the nation.\r\r**Stevenson - James Edmund Datri,** *President and CEO of the American Advertising Federation*  \rThe American Advertising Federation represents nearly 100 corporate members comprised of the nation’s leading advertisers, advertising agencies, and media companies, and puts on major industry events such as the Advertising Hall of Fame Induction Ceremonies and the American Advertising Awards.  Well known for his leadership in government, politics, and public policy, James formerly served as executive director of the Democratic Caucus in the U.S. House of Representatives.  He was named five times to Roll Call’s “Fabulous Fifty” list of the 50 most influential advisers and strategists on Capitol Hill.  He sits on several major boards, including the Ad Council and The Washington Ballet.  A New York City native, and previously a partner at two large U.S. law firms, James earned his Juris Doctor in 1992 from Harvard Law School.\r\r**Porter - Julia Sweig,** *Senior Fellow, Council on Foreign Relations*  \rJulia is an internationally recognized authority on Latin America and U.S. foreign policy, especially with respect to Latin America.\u2028\u2028An award-winning and prolific writer, she is the author of Inside the Cuban Revolution: Fidel Castro and the Urban Underground (2002), Friendly Fire: Losing Friends and Making Enemies in the Anti-American Century (2006), and Cuba: What Everyone Needs to Know (2009). Her writing also appears in the New York Times, the Washington Post, the Los Angeles Times, the Financial Times, Foreign Affairs, Cigar Aficionado, The Nation and a host of international publications—in Spain, Mexico, Brazil, and Cuba, for example. \u2028She is on our 45 + 5 list.\r\r**Oakes - Azadeh Moaveni,** *Author, Journalist, Time Magazine, Contributing Writer*  \rAzadeh is the author of *Lipstick Jihad* and co-author, with Nobel Peace Prize winner Shirin Ebadi, of *Iran Awakening*. She has reported widely on youth culture, women’s rights, and Islamic reform for Time, the New York Times Book Review, the Washington Post, and the Los Angeles Times. \r\r**College 8 - Sheila Davis,** *Executive Director, Silicon Valley Toxics Coalition*  \rOver the past 10 years, Sheila Davis has played a valuable role at SVTC and in shaping environmental policy in the high-tech industry. She is one of the co-founders of the Computer TakeBack Campaign and sits on its steering committee. In 1996 she researched and developed the first electronic recycling legislation to reach the California Governor’s desk and in 1999 spearheaded the first pilot programs in the country to collect and recycle electronic waste from the residential curbside. Before becoming SVTC’s executive director, she served as program director of SVTC’s Sustainable Technologies Program (formerly the Clean Computer Campaign). Sheila’s research, advocacy and policy development led to a successful ban on hazardous electronic waste from the California municipal landfills and the subsequent passage of the first electronic recycling legislation in the nation. Sheila holds a Bachelor’s Degree from the University of California and served as a journalist, state legislative aide and community development specialist before joining the staff of SVTC.\r\r**College 9/10 - Héctor Tobar,** *Author, Journalist*  \rLos Angeles-born author and former national and foregin correspondent for the LA Times whose work examines the evolving and interdependent relationship between Latin America and the United States. Héctor  is the author of four books, including the critically acclaimed, New York Times bestseller Deep Down Dark: The Untold Stories of 33 Men Buried in a Chilean Mine and the Miracle That Set Them Free. Deep Down Dark is a finalist for the National Book Critics Circle Award.\r\r**Graduate Division - Joe Palca,** *Science Correspondent, National Public Radio*  \rJoe Palca has covered a wide range of science topics—everything from biomedical research to astronomy. He also occasionally fills in as a guest host for NPR's *Talk of the Nation Science Friday*. Palca began his journalism career in television in 1982 as a health producer for the CBS affiliate in Washington, D.C., and then worked for *Nature* and *Science* magazines. He has won numerous awards, including the National Academies Communications Award for excellence in communicating science, engineering, and medicine to the general public. He has also received the Science-in-Society Award of the National Association of Science Writers, and the American Association for the Advancement of Science Journalism Prize. In 2009 Palca was the first-ever science-writer-in-residence at the Huntington Library in San Marino, Calif. With Flora Lichtman, Palca is the coauthor of *Annoying: The Science of What Bugs Us* (2011), which explores psychology, evolutionary biology, anthropology, and more, to uncover the roots of human annoyance. Joe is on our 45+5 list.\r\r**Engineering - Bev Crair,** *General Manager, Storage Division at Intel Corporation*  \rBev has an MBA from Pepperdine and is an executive with extensive storage industry experience and is a proven leader. She has successfully led teams building sophisticated, mission-critical software in a global environment. Bev has deep knowledge of operating systems and software development in closed and open source, and has worked at Unisys, Sun, Cisco, Quantum and now Intel. Bev got Intel to join UC Santa Cruz’s NSF I/UCRC, the Center for Research in Storage Systems."}},{"event":{"title":"Lick Observatory Summer Visitor Program","teaser":"During the summer, guests may purchase tickets to look through the 36-inch Lick Refractor and the 40-inch Nickel Reflector telescopes.","location":"Lick Observatory","location_details":"","link":"https://events.ucsc.edu/event/3061","event_instances":"1","event_date":"1434164400","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/lickobservatory.png?itok=wYTvrZ6X","alt":""},"description":"During the summer, guests may purchase tickets to look through the 36-inch Lick Refractor and the 40-inch Nickel Reflector telescopes. Amateur astronomers will be available to operate other telescopes and give informal talks, in addition to two speakers that will give history and science lectures.\r\r**Event Dates:**  \rJune 12, 2015 - 8:30 pm  \rJune 13, 2015 - 8:30 pm  \rJune 26, 2015 - 8:30 pm  \rJuly 10, 2015 - 8:30 pm  \rJuly 24, 2015 - 8:30 pm  \rAugust 7, 2015 - 8:30 pm  \rAugust 21, 2015 - 8:00 pm\r"}},{"event":{"title":"16th Annual UC Systemwide Bioengineering Symposium","teaser":"The UC Systemwide Bioengineering Symposium offers a well-established forum for faculty, researchers, and students from the 10 UC campuses to network, collaborate, and present ","location":"Stevenson College","location_details":"","link":"https://events.ucsc.edu/event/2968","event_instances":"1","event_date":"1434996000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/BioESymp_WB_020115-email.png?itok=M7oK7xbB","alt":"16th Annual UC Systemwide Bioengineering Symposium, June 22-24, 2015, UC Santa Cruz"},"description":"The **[UC Systemwide Bioengineering Symposium](https://bioeng-symposium-2015.soe.ucsc.edu/ \"UC Systemwide Bioengineering Symposium\")** offers a well-established forum for faculty, researchers, and students from the 10 UC campuses to network, collaborate, and present the latest bioengineering research. This year’s symposium features exciting speakers from industry and academia, including invited faculty speakers and chairs from all 10 campuses and events with industry representatives and student poster and oral presentations.\r\r**Plenary speakers:**\r\r**W.E. Moerner,** Professor, Chemistry and, by courtesy, Applied Physics, Stanford University, CA; 2014 Nobel Prize in Chemistry\r\r**Joseph DeRisi,** Howard Hughes Medical Institute Investigator; Professor & Chair, Biochemistry and Biophysics, UC San Francisco\r\r**Jennifer Cochran,** Hitachi America Faculty Scholar Associate Professor of Bioengineering and (by courtesy) Chemical Engineering, Director of Graduate Studies in Bioengineering, Stanford University\r\r**David Haussler,** Howard Hughes Medical Institute Investigator; Distinguished Professor, Biomolecular Engineering, UC Santa Cruz; Scientific Director, UC Santa Cruz Genomics Institute\r\r**Robert Coffman,** Senior Vice President and Chief Scientific Officer, Dynavax Corporation, Berkeley, CA \r\r**Breakout session topics:**\r\rStem cells and regenerative medicine\rData science and bioengineering\rSynthetic biology\rGenomics and computational biology\rTechnology and the nervous system\rProbes and sensors\rBiophotonics and optical imaging\rMicro/nanotechnology\rDrug design and discovery\rInfectious disease prevention and therapies\rBiomaterials for implants\rAssistive technology and rehabilitation"}},{"event":{"title":"OPERS Fall Festival","teaser":"This will be the 30th Annual OPERS Fall Festival, a campus wide Resource Fair for all new undergrad, grad, transfer and re-entry students.","location":"","location_details":"OPERS Upper East Field","link":"https://events.ucsc.edu/event/2728","event_instances":"1","event_date":"1442959200","thumbnail":"","description":"This will be the 30th Annual OPERS Fall Festival, a campus wide Resource Fair for all new undergrad, grad, transfer and re-entry students. There will be over 200 tables with information on campus departments and student clubs and organizations where students can learn about the many activities, programs and services available to them. Dining Services provides a farmer's market style dinner to meal-card holders and meals can also be purchased on site. With over 5,000 participants, this is the largest Zero Waste event on campus, which is made possible through the collaborative efforts of OPERS, Physical Plant, the Sustainability Office, and Dining Services. "}},{"event":{"title":"Founders Celebration 2015","teaser":"Join us for our most spectacular Founders Celebration event yet, during our fall signature weekend of 50th festivities, Sept. 25-27.","location":"","location_details":"","link":"https://events.ucsc.edu/event/2938","event_instances":"1","event_date":"1443315600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/founders-celebration.jpg?itok=Y97Spfcu","alt":"Founders Celebration 2015"},"description":"Join us for our most spectacular Founders Celebration event yet, during our fall signature weekend of 50th festivities, Sept. 25-27. The Founder's event will be a deliciously interesting evening with Foundation Medal awardee [Alice Waters](http://www.chezpanisse.com/about/alice-waters/)—chef, activist, author, and owner of famed Berkeley restaurant Chez Panisse. The full weekend of programming will include other events celebrating our history and looking to our next 50 years.\r\r"}},{"event":{"title":"Ken Norris Memorial Lecture","teaser":"The 2015 lecture celebrates 50 years of science at UCSC and 15 years of marine science education at the Seymour Marine Discovery Center.","location":"Seymour Marine Discovery Center","location_details":"","link":"https://events.ucsc.edu/event/2722","event_instances":"1","event_date":"1444960800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/norris_kenneth.jpg?itok=u-DCktIM","alt":""},"description":"The 2015 lecture celebrates 50 years of science at UCSC and 15 years of marine science education at the Seymour Marine Discovery Center."}},{"event":{"title":"KRUZ through KZSC's History ","teaser":"Join us at 7 pm for an evening of stories from the history of UCSC's student-run radio station! We'll have live interviews with those who built KRUZ in the basement of Stevenson Dorm 2 in 1967, debut clips from a KRUZ/KZSC documentary film, and play highlights from our audio archives.","location":"","location_details":"","link":"https://events.ucsc.edu/event/2765","event_instances":"1","event_date":"1444960800","thumbnail":"","description":"Join us at 7 pm for an evening of stories from the history of UCSC's student-run radio station! We'll have live interviews with those who built KRUZ in the basement of Stevenson Dorm 2 in 1967, debut clips from a KRUZ/KZSC documentary film, and play highlights from our audio archives. Broadcast live on KZSC 88.1 FM and on-demand at kzsc.org. Live radio event."}},{"event":{"title":"Hand, Eye, and Mind: Art by Early UCSC Faculty","teaser":"This exhibition is based on the art of early UCSC Faculty, and the philosophy behind the hand, eye, and mind, teaching methods of their time.","location":"Cowell College","location_details":"Eloise Pickard Smith Gallery","link":"https://events.ucsc.edu/event/2744","event_instances":"1","event_date":"1445040000","thumbnail":"","description":"This exhibition is based on the art of early UCSC Faculty, and the philosophy behind the hand, eye, and mind, teaching methods of their time."}},{"event":{"title":"Seymour Science Sunday and Fall Celebration","teaser":"Marine scientists bring you public lectures with photography, video, and stories of their work and lives. This special Science Sunday caps off the Seymour Center's 15th anniversary year.","location":"Seymour Marine Discovery Center","location_details":"","link":"https://events.ucsc.edu/event/2723","event_instances":"1","event_date":"1445198400","thumbnail":"","description":"Marine scientists bring you public lectures with photography, video, and stories of their work and lives. This special Science Sunday caps off the Seymour Center's 15th anniversary year."}},{"event":{"title":"13th Annual Practical Activism Conference ","teaser":"Join us for the 13th Annual Practical Activism Conference, organized by students from Colleges Nine, Ten and Oakes.","location":"Colleges Nine/Ten Multi-purpose Room","location_details":"","link":"https://events.ucsc.edu/event/2775","event_instances":"1","event_date":"1445707800","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/PAC_SaveTheDateFlyer15.jpg?itok=YM3x7BpN","alt":""},"description":"Join us for the 13th Annual Practical Activism Conference, organized by students from Colleges Nine, Ten and Oakes. \r\rThe Practical Activism Conference is a day-long, student led conference that provides tools for local and global change. The conference schedule includes a keynote address, spoken word performances and ten workshops to choose from. The student planning team designs the structure and content of each workshop, which addresses a social justice issue and provides practical ways to create social change. Past workshop topics include race and education, environmental justice, immigration, and food security.  \r\rThis year's workshop topics and keynote speaker will be chosen in late April. More information to come. \r\rThis event is free and open to the public, no prior registration required. \r"}},{"event":{"title":"Psychology and art, and the case of Cézanne -Pavel Machotka","teaser":"Pavel Machotka is a UCSC emeritus  Professor of Psychology  continuing his research in his native land, the Czech Republic","location":"","location_details":"","link":"https://events.ucsc.edu/event/2965","event_instances":"1","event_date":"1447212600","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/Cezanne2.jpg?itok=BotGbsg_","alt":""},"description":"Pavel Machotka is a UCSC emeritus  Professor of Psychology  continuing his research in his native land, the Czech Republic\r\r                                    \r\rCan psychology illuminate the nature of art? Years of research into this question tell us clearly that yes, it can. Many studies, some of which I conducted at UCSC, show that the kind of art we are attracted to depends on our personality, while others show that our personality guides the kind of art that we will produce. Art clearly serves our personal needs. \r\rBut does psychology explain great art? Only up to a point.  In some artists’ lives we can find early traumas, while in others we can find comments on their daily life in their art. Each finding, and many others like it, connects the art to the artist’s life. But not all art, of any artist, is connected to their life. Can psychology explain the art that remains independent? And can it explain whether the art is great, or at least good, or altogether mediocre? \r\rThese are more complicated questions. The life and work of the great artist Cézanne is an excellent example.  His landscapes, for example, show how closely his art depended on the appearance of things. (I will show my photographs of the sites that he painted.) Yet they are also great works of art, with careful attention to composition and color harmony, and especially to the brushstrokes by which the painting surface is unified. We can account for his dependence on the model – but not for his creative independence from it. In my talk, I will deal with this complexity, and conclude with my view of the role of psychology in understanding art.\r\r\r"}},{"event":{"title":"The Sixth Annual Morton Marcus Memorial Poetry Reading","teaser":"For UCSC's 50th Anniversary, California Poet Laureate, Al Young, poet, novelist, screenwriter, and former UCSC lecturer in Creative Writing, will be our honored guest reader.","location":"","location_details":"","link":"https://events.ucsc.edu/event/2768","event_instances":"1","event_date":"1447380000","thumbnail":{"src":"https://events.ucsc.edu/sites/default/files/styles/scale-380/public/events/alyoung_0.jpg?itok=ClxJRjJi","alt":""},"description":"For UCSC's 50th Anniversary, California Poet Laureate, Al Young, poet, novelist, screenwriter, and former UCSC lecturer in Creative Writing, will be our honored guest reader.\r\rThe Annual Morton Marcus Memorial Poetry Reading honors poet Morton Marcus (1936-2009), continues Mort's tradition of bringing acclaimed poets to Santa Cruz County, and highlights his poetry archive housed in UCSC's Special Collections and Archives."}}]}